https://play.google.com/store/apps/details?id=com.wunderground.android.weather
MAS-G-0027: This screen tells me the [forecast] for the week. This is helpful where I live as it can change pretty quick without much notice. I typically use it in the winter. It is especielly important during the coldest of nights when it reaches below zero F. Need to turn on a small heater in the basement to prevent frozen pipes.
To find this page I open the app, once opened I scroll down to the third section labeled ["daily forecast"]. I then click on ["more"] to open the full screen with [more information found on this page]. I will then scroll left to right to find any particular day that looks to be bad weather or severely cold. Then I will read the [finer details] of what is to be expected that day so I can make sure I am prepared for any delays on the road to work like snow.

https://apps.apple.com/us/app/apollo-for-reddit/id979274575
MAS-G-0019: When i lay down at night this is the first screen i go to because its like a launchpad of what i need and want to check for that day,  I go thru the [main subreddits] and make sure i check the top 10 so i can keep up with [whats going on for that day]. Its super easy for me because i have everything in one place and don't have to move or navigate around the app looking for [my favorite subreddits]. I like how its all in one screen so i can go back and forth. I have the app default to this screen in the settings so as soon as i launch the app it will take me to this screen by default. I also use the dark theme because i use the app mostly at night and its easier on my eyes, and does not really give off too much blue lights. 

https://apps.apple.com/us/app/apollo-for-reddit/id979274575
MAS-G-0009: The goal that I wish to achieve on the [Popular posts] screen on Apollo is to find [interesting new content] to view and possibly comment upon. To get to this screen from the app's homescreen, I select the upper left corner where the label "Subreddits" is present and then select the "Popular Posts" option near the top of the screen with the blue and white trending arrow icon. Once I am on the screen, I scroll down until I find [a post that I think might be interesting]. To do so, I look for visual cues such as [the number of awards given to a post] as well as numerical information such as [the number of positive votes a post has received] as well as [the number of comments that are associated with the post]. After viewing a post and its [comments], I can swipe from the left edge of the screen to return back to the Popular Posts screen. The screen has endless scrolling enabled and so I can continue to scroll and find additional [content]. I do this until I am satisfied with what I have seen or if have something to attend to (e.g. the line that I have been waiting in has cleared and I put away my phone).

https://apps.apple.com/us/app/cheapcharts-your-media-deals/id772046134
MAS-G-0044: I have a huge iTunes TV and movie collection that I allow my family to share.  It's a fun thing that I enjoy collecting and sharing.  One key app I use to help me not go bankrupt doing this is Cheapcharts.  It helps me keep track of  my [library] and place [movies that I want to purchase] on a [wish list], then I get [alerted] when they go on sale.  To get here I open the app, tap the upper left corner to bring up the side menu, then select "Wish List".  From there I can easily toggle between [movies], [TV Shows], or even [audio books] that I may look to purchase once the [price] goes down.  I can also choose "On Sale" on the side menu to see [everything that is on sale] in case there's something I want that I didn't think to have on [my list]. 

https://apps.apple.com/us/app/draftkings-fantasy-sports/id710535379
MAS-G-0096: I use this app and this screen to enter [daily fantasy sports contests for different NBA games]. The screen changes in response to the [filling of contests] and the [completions of different games] or [slates of games], and I choose [the contests that I want to enter] as I use the app. I also can fill out my [lineups] when entering the contest. I get to the screen by choosing NBA on the home screen, then hitting Classic to show [my preference] for the type of contests I want to enter, and then choosing a [slate], which in this case is tonight's 7:00 slate. Now that I am at the screen I can scroll down and choose which contests I want to enter. If I have [money in my account], then I can easily click a contest, then fill out a lineup and submit it and I will be entered. If I already have filled out a lineup, I can simply enter that one as I enter the contest. 

https://play.google.com/store/apps/details?id=com.mentormate.android.inboxdollars
MAS-G-0074: I have been using the Inboxdollars app for over a year now.  I treat it as a little side hustle for paying bills or simply being able to afford gifts for birthdays or christmas.  It has come in really useful through out the year.  I find it to be one of the most profitable apps out there where you do not have to spent any money to use it. It's completely free and very generous to use. My main goal when using this is to at least log in once a day and meet the [basic goals] which can easily be accomplished within a couple of minutes.  The steps I took to get to this screen was simple.  I just opened up the app and then just swiped upwards and there I was.  It shows me the [daily goal] and [how many days I have been reaching my goals].  The [monthly goal] really pays off too.

https://apps.apple.com/us/app/webull-investing-trading/id1179213067
MAS-G-0088: I use this screen to see [how  various cryptocurrencies are performing over the past 24 hours]. I will quickly scan my [favorite currencies] and look at the [price action] from various [time frames]. The main goal i want to see if there is a very active crypto that I can potentially trade for the sessions. I log in to the app, click on the [markets icon] at the bottom, then scroll through the various markets. The [US market], and the [worldwide market] before deciding on crypto. Once at the screen I will give a quick glance to all of the cryptos, then I will click on the ones of interest for a deep3er look individually. After doing that I will find a play, make a limit or then watch the play until my [order] is filled. Once filled I will trail the order until it reaches my [target price] or it stops me out at a loss.

https://apps.apple.com/us/app/mcdonalds/id922103212
MAS-G-0030: This is one of most frequently used app. I use this app to order food. I use this app as I can accumulate [points] and redeem them on future purchase. I will use offer and deals by using this App. This app also helps to find [location of the store near me]. I can use this app to pay for the purchase. I can find [new deals]. I can find [new menu]. This app offers free fries on some [order]. I use to redeem points to buy free drink. I will take time to know what is new deals available. The app comes with [code] that I can use If I buy in store. This app is good to redeem points and get free drink. Some time the app offers buy one get one free burger. It also offers free fries for order on deal of the day. This is must have app for me.

https://apps.apple.com/us/app/apple-health/id1242545199
MAS-G-0100: The main task is to calculate the data from my [daily activity] that from day starts and till the end of my day it just keep tracking [the data of my health and activity] and we need to add some data like our weight and height and some [other data] need to be provided inorder calculate a [target] and gives a [goal of total activity] that we need to do per day by then it gives us some [award] like things within the app if we do the given target goal each day and it also tracks the [sleep track] and gives us the data to analysis and then the app gives some [rating] and saves that data in the cloud from there we can check the data of almost one year back 's data and can analyze the data and if we add some more details like our [health conditions] it saves and it emergency condition the doctors can have access to the data even if we are in danger state

https://play.google.com/store/apps/details?id=com.spotify.music
MAS-G-0033: I use this screen to select [the music I want to listen to]. It shows [my most recently selected music] and some [pinned playlists] that I like the most, such as [Liked Songs]. I got to this screen by selecting the "Your Library" option at the bottom of the app that is always present. The options at the top give some options for filtering through the music in my [library]. I can select [artists] and it will show me all the [artists] I have in my [library] and I can select from there. I can select [playlists] and it will give me [the list of playlists] I've made before and liked from other people. This is a good way for me to get to [the music I want to listen to]. It's a good way to find what you're looking for, both in a specific way, and in a more general way that helps you make the decision of [what you want to listen to].

