[{"text": "From this screen, I like to search for anything from recipes, to home decor, to people, etc., just depending on my mood. To get to this screen all I had to do was tap on the little magnifying glass next to the image of the home icon, and this is where you would search for whatever you like, kind of like how it works with google, but more customized to your preferences and trends. To find whatever I'm looking for, I click on the search bar to type a word or phrase. I try to keep it brief. For example, if I'm looking for a pasta recipe for dinner, I'll type pasta dinner recipe, then select the phrase that matches what I'm looking for. I then rummage through the available pins and decide which one I like the most before saving the pin to the board that most closely matches the kind of query I made. ", "app_url": "https://apps.apple.com/us/app/pinterest/id429047995", "scenario_id": "MAS-G-0001"}, {"text": "I always keep a track of which games are going on at the moment as I am a Football enthusiast and I love to gain as much knowledge as possible about Football so that I can talk to my friends and family about it. Not just them, I also discuss these at my workplace. The screenshot only shows matches of one certain league, the Premier League but other I also follow other leagues amongst them. \r\nAs soon as I open the app, at the bottom of the screen you may see the options of Home, Games, Discover and Profile. Just a tap to the Games section and it directs me to the matches that are being held recently or in the future with the variety of choosing which competitions to follow. \r\nOnce I am onto the Games section, I look for the league that is most interesting to me such as the Premier league by scrolling up and down and when I finally reach the destination of the league, I tap onto the match that is the most interesting and easily I can view the statistics, Overview, Line-ups of teams in that match.", "app_url": "https://play.google.com/store/apps/details?id=de.motain.iliga", "scenario_id": "MAS-G-0002"}, {"text": "On this screen I want to put together a shopping list I can use while at the store. To arrive on this specific screen you have to open the app. Then you need to create a shopping list by selecting 'Add shopping list' from the main screen menu. Multiple shopping lists can exist at the same time. To reach the screen in the picture you  must then select a shopping list. In this instance, I chose my Kroger store shopping list. On this page you can add shopping items to your list by choosing the plus. You can add also add details for each item by selecting the small i symbol. These details can include pictures and other notes.  You can cross out items you have purchased by selecting an existing item. This is helpful as you shop. You can print out the list or send the list. Sending the list is helpful because it is a shared grocery list. It is also possible to scan items by selecting the scanner symbol.", "app_url": "https://play.google.com/store/apps/details?id=com.headcode.ourgroceries", "scenario_id": "MAS-G-0003"}, {"text": "I use this screen by reading the posts to see if there's anything interesting enough to click on. If not I scroll down looking for posts that may interest me more. I mostly use it to stay entertained during down time throughout the day, but sometimes I use it to keep up with current events even though I'd rather not. I also use it to find specific communities of like minded people to talk with. I also use it for help with things sometimes, like if I'm doing a DIY project, legal issues, cooking, or basically anything else. Above all I use it when I'm bored but there are plenty of times I've used it to get helpful information, there are many helpful people using the site. To get this specific screen I just opened the app then went to the page called \"all\" which is just all the communities listed together sorted by the most popular posts currently.", "app_url": "https://play.google.com/store/apps/details?id=com.andrewshu.android.reddit", "scenario_id": "MAS-G-0004"}, {"text": "This is the general screen on wild rift that I used to interact with the platform. It includes social functions like adding friends, typing messages to them, And finding groups to play with. I can also use the play button to get in a match and play with other players. When I’m on the screen I usually press the play button and then I get into a match where I fight in a battle arena online. This green also includes functions for redeem rewards for simply playing the game as you can see there are options to click on the wild pass rank missions and there is a store icon where you can buy endgame merchandise to improve your player experience overall. This screen also let you bring up the rankings of other players so you can compare your performance to those that are also playing the game with you . ", "app_url": "https://apps.apple.com/us/app/league-of-legends-wild-rift/id1480616990", "scenario_id": "MAS-G-0005"}, {"text": "I use this screen to add items to an errands list and then cross them off as I complete them. The goal is to track and complete all of the errands that I need to do, and have a space where I can look over how I want to complete the tasks (what order, what time I need to do the tasks, etc.) To get to this project screen, I first navigate to the home screen, and tap on the \"Errands\" project. To add an item to the screen, I click the action button on the lower right, which has a plus sign. I then add the details of the errand such as the title and when it will be due. I tap the button to finalize adding the item, at which point it shows up in the list. To finish an item, I click on the circle to the left of it.", "app_url": "https://apps.apple.com/us/app/todoist-to-do-list-tasks/id572688855", "scenario_id": "MAS-G-0006"}, {"text": "This screen allows me to get the currency conversion amounts from UK Pound Sterling (GBP) to US Dollar (USD) (and others if I choose). It's a comprehensive screen and can be personalized to the user's needs (using the blue \"edit\" function). To get to this screen, I chose the conversion button (A>B) from the standard calculator screen, which brings up a list of common (Cooking, Currency, Length, Temperature, Volume, Weight, etc) and specialized (Angle, Area, Lighting, Torque, etc) conversions. Each item category in the list leads to its own conversion screen. On the next screen, I select \"UK Pound Sterling\" from among others, and I arrive on the screen pictured above. Here, I wanted to convert £4.38 to US Dollar (USD), and I got the value of $5.41 at the rate current as of May 6, 2022, but there are other conversions to major currencies listed if those are needed. To return to the main calculator screen, I simply press the large figure of 4.38 at the bottom.", "app_url": "https://apps.apple.com/us/app/pcalc/id284666222", "scenario_id": "MAS-G-0007"}, {"text": "This page/screen helps me choose which videos to watch by scrolling to all or some of the viral videos and videos that are related to my searches. I usually go to this page when I want to see which videos are viral at the moment and if I need to look for a certain video but I am not sure what to put on the search bar. This feature has categories that help me with my search. I just click the discover tab then scroll to look for the category I am looking for and browse until I see the video I want to watch. I usually look at the category first, like there is one for metgala, for small business so all the videos I watch will be in that category. Alternatively, if I can't find what I'm looking for I use the search bar and type related words for the video I have in mind. I also use this screen to see the most viewed video and the viral ones.", "app_url": "https://play.google.com/store/apps/details?id=com.zhiliaoapp.musically", "scenario_id": "MAS-G-0008"}, {"text": "The goal that I wish to achieve on the Popular posts screen on Apollo is to find interesting new content to view and possibly comment upon. To get to this screen from the app's homescreen, I select the upper left corner where the label \"Subreddits\" is present and then select the \"Popular Posts\" option near the top of the screen with the blue and white trending arrow icon. Once I am on the screen, I scroll down until I find a post that I think might be interesting. To do so, I look for visual cues such as the number of awards given to a post as well as numerical information such as the number of positive votes a post has received as well as the number of comments that are associated with the post. After viewing a post and its comments, I can swipe from the left edge of the screen to return back to the Popular Posts screen. The screen has endless scrolling enabled and so I can continue to scroll and find additional content. I do this until I am satisfied with what I have seen or if have something to attend to (e.g. the line that I have been waiting in has cleared and I put away my phone).", "app_url": "https://apps.apple.com/us/app/apollo-for-reddit/id979274575", "scenario_id": "MAS-G-0009"}, {"text": "To find out what is going on with the world, I simply tap the \"Trending\" Tab that's navigated in the search icon below. This is more convenient to me than the desktop version of Twitter because I can quickly access these tabs in a pinch. With the Trending tab, you can find out any juicy news or anything that would serve of great importance to you. It's actually pretty simple if you think about it, you don't have to jump through hoops to navigate on the Twitter app. If you want to be even more technical about it, then check out the microphone icon that's between the search icon and the bell icon. With the microphone button, you can make your own voice chat talking about the latest news and what is going on around the world. Twitter in my personal opinion, is a great place for news because of that reason alone.", "app_url": "https://play.google.com/store/apps/details?id=com.twitter.android", "scenario_id": "MAS-G-0010"}, {"text": "I usually use this page when I want to order out for a meal but do not want to pay an extreme price for delivery fee or the food itself. My main goals for when I am on this page are to find places with a $0-$2 delivery free or to find restaurants running promotional offers. Usually places will do buy one get one free offers or \"free item when spending over X on your order\". \r\n\r\nTo get to this screen first you would need to open the UberEats app, and then click on the \"Restaurants\" button near the top left. After clicking restaurant you then click on the Deals button that is also in the top left. \r\n\r\nOnce on the Deals screen I would then scroll through the different restaurants until I find one that meets my desires. It is as simple as using my finger to scroll down/through the options until I spot a restaurant that has a good enough deal/fits my desires.", "app_url": "https://play.google.com/store/apps/details?id=com.ubercab.eats", "scenario_id": "MAS-G-0011"}, {"text": "I use this screen if I want to search a person's profile for a certain tweet I am looking for or maybe saw before and want to find again. I go to a person's profile then I hit the search icon to search just that person's tweets for information I need. I just scroll down the results once I get the search results from my search term. I use this screen when I need to search someone's profile specifically rather just needing to search twitter generally. This search is much more specific. I go the app if I need to do this because I do not have that functionality when I am using Twitter on my laptop. I think it is very helpful to search someone's tweets for key terms and knowing I can do that keeps me from trying to remember things or taking screenshots when I am browsing on Twitter.", "app_url": "https://play.google.com/store/apps/details?id=com.twitter.android", "scenario_id": "MAS-G-0012"}, {"text": "I use this screen to organize my songs. I find them using the albums they belong to. Sometimes I can opt for arranging them in alphabetical order. I can also choose to sort it by length. If I click on the upper and lower level button, I can drag the songs around based on my needs. I can also add my sounds to my favorite or remove it from the list by clicking that menu button (three dots). The list is automatically organized by folder first, but I can always change it using the menu icon. There will also be times when I don't want to listen to a certain song in the album and I want to exclude that from the playlist. I can also do that in the menu. Finally I am also able to share the song from the playlist using the share function in the menu.", "app_url": "https://play.google.com/store/apps/details?id=com.aimp.player", "scenario_id": "MAS-G-0013"}, {"text": "To see current relevant events going on, I go to the search tab and can sort through various topics, audio only spaces, and find profiles of other people. Also able to see trending hashtags, customized content for your account based on history. It's pretty self explanatory, and is simple to use. It can show you profiles, videos, photos, different links to sites and visit outside sites through it's built in browser extension. If you want to find everything but trending / currently relevant items, you click the search bar on top. It'll populate different current hot topics as you type words into it to help you along the way.\r\n\r\nThe plus symbol also allows you to create your own tweet and share it with your followers or general accounts if you're public. A source of inspiration for things to tweet about. It also lets you retweet and join communities of various interests. ", "app_url": "https://apps.apple.com/us/app/twitter/id333903271", "scenario_id": "MAS-G-0014"}, {"text": "This is the sleep stage timeline screen in the Garmin Connect app. It shows when I slept and how deeply I slept through the night. I use this screen to try to improve the quality of my sleep, by seeing how changes to my behavior impact the quality and the amount of my sleep.  To get to this screen, I first open the Garmin Connect app. Then, I scroll down on the home page until I get to the \"sleep\" section that shows the amount of time I slept the night before.  When I click on this area, it takes me to the sleep detail page.  The top of the page tells me hour many hours and minutes of each type of sleep that I got. Then, I scroll down and I get to this timeline. It shows when I went to sleep, the depth of my sleep, and when I work up.  I use this to see if modifying behaviors, lighting, reading material, bed times, impact or improve the amount of sleep I get, and how deeply I am able to sleep. ", "app_url": "https://apps.apple.com/us/app/garmin-connect/id583446403", "scenario_id": "MAS-G-0015"}, {"text": "The way i use this page most often is to quickly find some music for me to listen to without having to select each song. The goal i normally have when using this screen is to find a playlist that i enjoy listening to that is created based off of what i normally listen to. Apple music provides playlists that are based off of my preferences, and have different themes for each playlist. Some are chill, some are for workouts, etc. To get to this screen, all i need to do is open up my apple music app, and then click on the bottom left symbol marked \"listen now\". I actually scrolled down a little on the screen so i could see the \"stations for you\" section. This is a section i use very often that plays music based off of music i normally listen to using the app. To achieve my main goal of finding a playlist, i would either go to the \"made for you\" section and choose a playlist, or simply go to a \"stations for you\" icon and pick one of those. Either of these options are very quick ways for me to have songs played that match what i generally like.", "app_url": "https://apps.apple.com/us/app/apple-music/id1108187390", "scenario_id": "MAS-G-0016"}, {"text": "This is the duo lingo home screen. Here I have access to all the core features of the app including the most important which are the lessons. In this screen shot you can see Unit 1 and some of its lessons IE Intro, Phrases, and Travel. You can also see various metrics and buttons to go to other features of the app like leader boards, stories, friends, gem store, and announcements. In the upper right you can see duo lingo pro button which allows you to see that you are subscribed or allow you to subscribe. below that is a premium feature that allows you to work on words or lessons you have made mistakes on in the past. And the bottom right circle is the current XP you have earned for the day as well as the monthly badge and how much XP you have towards completing the badge.", "app_url": "https://play.google.com/store/apps/details?id=com.duolingo&hl=en_US&gl=US", "scenario_id": "MAS-G-0017"}, {"text": "My goal is to improve the quality of my sleep and make sure that I am getting enough sleep time. From the main screen on the app, I scrolled down to the symbol for sleep (a half moon and a Z) and I can see my sleep score for the previous night. I can look for more details by clicking on the symbol. I can then see details of the following: 1. how many minutes I was awake during my sleep period. 2. how many minutes of REM sleep. 3. how many minutes of light sleep and 4. how many minutes of deep sleep. It also tells me what time I went to bed and what time I got up. The app analyzes this data, along with breathing and heartbeat, to generate a sleep score for the night. To have the app do all this, I must wear it to bed. I can see my sleep scores for the week in a graph at the top and I can scroll down for previous weeks. I can think about my activities on the days when my score is better so that I can make a habit of activities that promote good sleep scores. ", "app_url": "https://apps.apple.com/us/app/fitbit-health-fitness/id462638897", "scenario_id": "MAS-G-0018"}, {"text": "When i lay down at night this is the first screen i go to because its like a launchpad of what i need and want to check for that day,  I go thru the main subreddits and make sure i check the top 10 so i can keep up with whats going on for that day. Its super easy for me because i have everything in one place and don't have to move or navigate around the app looking for my favorite subreddits. I like how its all in one screen so i can go back and forth. I have the app default to this screen in the settings so as soon as i launch the app it will take me to this screen by default. I also use the dark theme because i use the app mostly at night and its easier on my eyes, and does not really give off too much blue lights. ", "app_url": "https://apps.apple.com/us/app/apollo-for-reddit/id979274575", "scenario_id": "MAS-G-0019"}, {"text": "To get to this page, I unlock my phone, slide my finger up the screen to open the app tray and find the Amazon Shopping icon, I touch to open the application. I open this app to take a look at products that I might want to purchase. I look at this screen for advertisements, because sometimes they have some good deals on the front page. Once I'm done perusing the front page, I move to the search bar and enter a search term for what I'm interested in buying. I click on anything interesting, then I read the product description. If the product would be suitable for me, I go on to read some customer reviews. If all the reviews are good, I mark the page as a possible purchase. I do the same thing with other products, that also might fit my needs. When I've narrowed my selection down to the product that I want to buy, I navigate to the checkout and purchase the product.", "app_url": "https://play.google.com/store/apps/details?id=com.amazon.mShop.android.shopping", "scenario_id": "MAS-G-0020"}, {"text": "This screen is used to find sounds to add to your videos. You can either make your video have only the sound you choose, or you can add background music to your video while still being able to hear the original audio. You are able to save sounds you like into 'favorites' and you can browse sounds by using the search bar along the top or browsing sounds available. There are sounds the algorithm suggests to you based on videos you have liked ('for you'), and there are sounds that are currently trending with other content creators. To get to this page once you open up Tiktok you have to press the plus (+) button located in the middle on the bottom bar. This opens up your phone's camera where you can take or upload a video. From here, along the top in the middle there is 'add sounds' (it is not a button, it is just text displayed) or if you choose to upload a video you've already taken (by pressing the button in the bottom right corner) then you will also be able to click the same 'add sounds'. Once you click 'add sounds' the above screenshot opens up. If you press the icon art to the left of the sound name it will begin playing the sound so that you can make sure it is the correct one (some have the same title but are different parts of the same song, remixes, etc). Once you have found the sound you want to use, when you click the sound a menu slides open giving you the open to favorite, clip, or use the sound. To use the sound you select the check mark button and it will be added to your video. ", "app_url": "https://play.google.com/store/apps/details?id=com.zhiliaoapp.musically", "scenario_id": "MAS-G-0021"}, {"text": "(1)I use this screen to look at what LINE friends have recently posted. It's a timeline that consists of posts from my friends and also from myself. As for the goals, there's really only one: to see what my friends have been up to -- you know, what's new in their life. \r\n(2)As for how I get to this screen, once you open the app, you're usually on the tab you were last using, so you generally have 3 others options to choose. Once I opened the LINE app, I was already on the \"Chats\" tab, therefore all I had to do was just a slide of my thumb to the right and press on the \"Timeline\" tab. \r\n(3)Now once at this screen, there aren't really any steps to take to achieve my goal. I simply scroll through the posts and hope to see some interesting content, or at least some good things happening the lives of my friends. ", "app_url": "https://apps.apple.com/us/app/line/id443904275", "scenario_id": "MAS-G-0022"}, {"text": "After logging into the Letsfit App on my phone, I can sync my smartwatch with the device to monitor my activity. The app can monitor things such as heart rate, blood oxygen levels, calories burned, steps taken, and sleep duration. I mainly use it to monitor my heart rate due to my Inappropriate Sinus Tachycardia. Once you're on the device all you have to do is wait to scroll down to Heart, which will show both your maximum heart rate as well as your resting heart rate. If you click on the heart rate tab it will show you a chart of your heart rate activity data, which consists of your daily, weekly, and monthly heart rates. This is very helpful to me because it allows me to keep track of my heart rates without having to worry about writing anything down to memorize it myself. The app is really useful for anyone who owns a Letsfit smartwatch. ", "app_url": "https://play.google.com/store/apps/details?id=com.honbow.letsfit", "scenario_id": "MAS-G-0023"}, {"text": "I use this screen more than any other on Spotify. One thing I love about Spotify is that it's so easy to create and edit large playlists. I can collect and curate all my favorite music any way I want. It's like creating the perfect music box sets, but I can take them with me anywhere I go. The main goals I want to achieve on this screen are to either create a new playlist (by tapping the plus button in the top right corner), or listening to one of my existing playlists (clicking on the title of any of the playlists on the screen). If I'm creating a playlist, the first step is to name my new playlist, then pressing the \"Create\" button. From there, I press the \"Add songs\" button to add music to it. On a preexisting playlist, I would just tap on the title of the playlist and press play to listen to it. To get to the Your Library screen, I tap the Your Library button at the bottom right of the app.", "app_url": "https://apps.apple.com/us/app/spotify-music-and-podcasts/id324684580", "scenario_id": "MAS-G-0024"}, {"text": "This is the Cart screen. Anytime i go to this screen It is because i usually am looking to checkout as i have already selected some items to buy. It is simple to find once you open the app as it is one of the 4 main buttons at the bottom. Once i am at the screen one of two things happen either A i know what i want to buy already and it is in the cart. Or B i want to find something i bought recently so i came here for buy again. Once i have things in my cart then it is simple because i can just easily checkout from there and my goal is pretty straight forward from there. If my goal is to find something i bought before then everything is listed within the buy it again section and i just have to follow those steps from there.", "app_url": "https://play.google.com/store/apps/details?id=com.amazon.mShop.android.shopping", "scenario_id": "MAS-G-0025"}, {"text": "I use this screen to see the content that I am interested in and that I follow so I can view it at a later time if needed. I will go to my following section and scroll through it and when there is no more new news left I will go to discover and search the related subjects that I'm interested in. I will type in the search bar specific subjects such as government, or covid so I can see what is happing in the news for those subjects. I will also go to the local page at the top of the app and read my local news and what is happening around my city. This is where I will find pretty much all of my important news locally and globally. I will like any posts or view the comments if it is an interesting article that I felt was worth the time to read about. I like to click the comments section just to see if any people have any interesting facts or comments about the article. ", "app_url": "https://play.google.com/store/apps/details?id=com.particlenews.newsbreak", "scenario_id": "MAS-G-0026"}, {"text": "This screen tells me the forecast for the week. This is helpful where I live as it can change pretty quick without much notice. I typically use it in the winter. It is especielly important during the coldest of nights when it reaches below zero F. Need to turn on a small heater in the basement to prevent frozen pipes.\r\nTo find this page I open the app, once opened I scroll down to the third section labeled \"daily forecast\". I then click on \"more\" to open the full screen with more information found on this page. I will then scroll left to right to find any particular day that looks to be bad weather or severely cold. Then I will read the finer details of what is to be expected that day so I can make sure I am prepared for any delays on the road to work like snow.", "app_url": "https://play.google.com/store/apps/details?id=com.wunderground.android.weather", "scenario_id": "MAS-G-0027"}, {"text": "To search for new photos and accounts on Instagram, I tap on the search icon. Then I either type something specific in the search bar to find what I'm looking for, or I'll scroll through the suggestions that pop up. I use this feature to find accounts that I don't want to actively follow, but I still want to check up on them for new content or updates. Sometimes it's nice to get suggested content related to my interests. It's a nice distraction to scroll through looking for something that catches my eye. If I do a specific search, I can search for accounts or hashtags. Another screen will open with the results of whatever term I entered into the search bar. Then I click the one that seems most relevant to my initial search terms. It's a pretty effective way to use the app and I like using it.", "app_url": "https://play.google.com/store/apps/details?id=com.instagram.android", "scenario_id": "MAS-G-0028"}, {"text": "To scan a receipt you need to click the orange camera button on the bottom of the screen. This will open up your camera which is used to scan the receipt. When scanning the receipt you need to make sure you get the store name, date, and the total. If you don't capture it all in one scan you move the camera and scan the next part of the receipt. Once the receipt is scanned it will look at the information on the receipt and give you your points. Most receipt start out at 25 points, but depending what special points things they are running you can get more then that. I have gotten 2000 points on one receipt before. From here you can also see the amount of points you have (which is marked off on my screenshot). This points can be redeemed by using the rewards button next to the orange camera button. You can get many different gift cards including play store, playstation, amazon.", "app_url": "https://play.google.com/store/apps/details?id=com.fetchrewards.fetchrewards.hop", "scenario_id": "MAS-G-0029"}, {"text": "This is one of most frequently used app. I use this app to order food. I use this app as I can accumulate points and redeem them on future purchase. I will use offer and deals by using this App. This app also helps to find location of the store near me. I can use this app to pay for the purchase. I can find new deals. I can find new menu. This app offers free fries on some order. I use to redeem points to buy free drink. I will take time to know what is new deals available. The app comes with code that I can use If I buy in store. This app is good to redeem points and get free drink. Some time the app offers buy one get one free burger. It also offers free fries for order on deal of the day. This is must have app for me.", "app_url": "https://apps.apple.com/us/app/mcdonalds/id922103212", "scenario_id": "MAS-G-0030"}, {"text": "I use the Kroger mobile app when I go to the Kroger grocery store. I use my laptop at home to add coupons because it is easier for me to use a laptop than my phone. I clip the coupons at home so when I go to the store they are stored on the app on my phone. I click on \"Savings\" then \"View all coupons\" then \"clipped\" to see the coupons I have loaded on my phone. When I scan my Kroger grocery store card the cash register takes the coupons off my purchases. I'm sure there is a way to use a mobile grocery store card but I don't know how to do that. On the Kroger app I can see that I have a  40 cent coupon off 18 count carton of eggs for example so I know which eggs to buy. I like to save money and get free items and the app helps me reach my goals. Groceries are expensive so every savings helps. ", "app_url": "https://play.google.com/store/apps/details?id=com.kroger.mobile", "scenario_id": "MAS-G-0031"}, {"text": "On this screen, I sort through all of the coupons offered by Kroger for use in store on their products that I want to buy. To get to this screen, I open up the Kroger app and tap on the Savings icon at the bottom of the screen. Then I tap on the Coupons sections and then tap on \"View All Coupons.\" From this screen, I can scroll and search through all of the available coupons and load them on to my shopper's card. Then when I make a purchase at Kroger, the coupon is automatically applied at checkout to my purchase. My goal is to find as many coupons that I can use as possible, so I will tap on the Browse button and search brand names that I am planning to purchase. I will also scroll through the list to see if there is anything else that catches my eye. When I find a coupon, I tap the Clip button, and it is applied to my card and ready to use. ", "app_url": "https://apps.apple.com/us/app/kroger/id403901186", "scenario_id": "MAS-G-0032"}, {"text": "I use this screen to select the music I want to listen to. It shows my most recently selected music and some pinned playlists that I like the most, such as Liked Songs. I got to this screen by selecting the \"Your Library\" option at the bottom of the app that is always present. The options at the top give some options for filtering through the music in my library. I can select artists and it will show me all the artists I have in my library and I can select from there. I can select playlists and it will give me the list of playlists I've made before and liked from other people. This is a good way for me to get to the music I want to listen to. It's a good way to find what you're looking for, both in a specific way, and in a more general way that helps you make the decision of what you want to listen to.", "app_url": "https://play.google.com/store/apps/details?id=com.spotify.music", "scenario_id": "MAS-G-0033"}, {"text": "This app lets you point your phone in any direction and shows you what stars, constellations, and even space stations are in that location. I downloaded the app when my kids were learning about astronomy, because it's hard to point at a star and try to tell my kids what it is, I can't tell if they can see what I'm seeing, and it's hard for them to understand why constellations are named after certain things.\r\n\r\nWhen I open the app, it sometimes asks if I want to upgrade to the paid version, but usually just opens right into a camera view with stars and constellations visible. If you stop on a constellation, it will show the image of the thing it was named after, such as the bull for Taurus in my screenshot. That really helps my kids see what the constellations are supposed to be, and it helps them remember the different ones.\r\n\r\nOnce I'm on the screen, I can point my phone at the night sky, ideally, but it works even if I'm pointing it at the ground. My kids love seeing what constellations are visible on the other side of the world. \r\n\r\nWe also use it to learn more about the constellations; if I click on the word \"Taurus\" that's at the bottom left of the screenshot, it opens a small information tab about the constellation and about the name origin. From there you can also click to expand for more information, and a larger article is available.", "app_url": "https://play.google.com/store/apps/details?id=com.t11.skyviewfree", "scenario_id": "MAS-G-0034"}, {"text": "I use this screen for a multiple of reasons. When I have run out of subscribed channels to watch I will usually look at home screen for any suggestions Youtube might have for me. I often see videos I may have missed earlier in the week from my subscriptions. Or just content that is related to other subscriptions and it is relatable. I often find other channels this way leading to even more videos to watch and people to subscribe to.\r\nIt also offers a search feature. So when all else fails and I just can't find something worthwhile to search from the suggestions or content I subscribe to, I can simply search a topic. Again this often leads to videos I have never seen and more channels to subscribe to offering content I am interested in through the topic alone. It really is an endless loop offering endless entertainment to watch.", "app_url": "https://play.google.com/store/apps/details?id=com.google.android.youtube", "scenario_id": "MAS-G-0035"}, {"text": "To find the daily rain or general precipitation forecast/total amount forecast, I tap on the weekly rain amount forecast on the home screen page. Then I scan the daily and/or hourly high for rain or precip to see if there's a particularly large amount of rain in the upcoming forecast for that day or week, depending on the situation. My goals in using this app are pretty simple in that I needed a better caliber of weather app to help keep track of upcoming storms, especially things like sudden rain showers or thunderstorms. My wife and I live in a 110-year-old house in an area of the United States (philadephia) that's prone to a fairly high amount of rain in the spring/summer and thus you'll have wet/flooded basements. this app helps me plan my week as far as when I travel or when to keep on eye on things like the gutters/basement.", "app_url": "https://apps.apple.com/us/app/carrot-weather-alerts-radar/id961390574", "scenario_id": "MAS-G-0036"}, {"text": "I use this screen to look for TV show content sorted by channel. Once on the app I use the tabs at the top to choose the format I want to search in. Once I get to this screen I search by channels that I like to browse for new content. Sometimes I recall a show I have heard of or seen before and I can find it by knowing what channel it may have been on. If I am in a certain kind of mood when looking for a show, searching by channel lets me look for certain types of shows. I can also look here to see if there has been a new channel added which would mean there is content that is new to me. I think that is a good way to find new things to watch when I find myself scrolling menus too long looking for something to watch.", "app_url": "https://play.google.com/store/apps/details?id=com.tubitv", "scenario_id": "MAS-G-0037"}, {"text": "This is a very simple kitchen timer app that is free to use, which is important for me. I don't pay for apps. It also plays nice with my adblocker and works fine without an internet connection. I originally got it when I was working in a professional kitchen so I wouldn't overcook the soft-boiled eggs, but now I regularly use it in my home life as a simple, fast, easy to use timer. The screen you're looking at here is the main screen, that's all there is to the app - you can add and remove time in increments of 1 and 10 minutes and the app gives you a 10 and 5 minute warning with a sharp beep. So, if I'm cooking a pork roast that takes 45 minutes, I'll open the app and add 45 minutes and press start. That's all there is to it, just set it and forget it.", "app_url": "https://play.google.com/store/apps/details?id=com.wixsite.ut_app.uttimer", "scenario_id": "MAS-G-0038"}, {"text": "I use this screen to see if I have Hits available to complete. I want to be alerted that there are Hits I need to complete on my laptop. I clicked the icon for this app on my phone and this screen is the first to show. I just need to scroll on this screen to see the history of jobs that have been available. I want to use this screen to see if I should return to my computer or continue to accomplish task I may have for the day that are away from my computer. I can use this app to also check my phone from my computer but when I use it on my phone it is just letting me know if I need to check my computer as well. I can also save this information to analyze later to judge busy times of the day or when I need to focus my efforts.", "app_url": "https://play.google.com/store/apps/details?id=com.pushbullet.android", "scenario_id": "MAS-G-0039"}, {"text": "This is the Reddit Is Fun mobile app for Reddit. The page is from the subreddit r/all where all the hot posts of the day are posted. My goal is to either get the most important news or funny content for the day or hour. On r/all, it would be for the day. If I switch the tab to top, there's timeframes that I can pick. I will usually pick 1 hour which will show me the top content within the hour. If I don't have time, I only scroll r/all. \r\n\r\nI can skim the titles for the ones I'm interested in reading further details about. Sometimes there may be a lot of news if it's a newsworthy day, and sometimes there isn't much news and it will be full of entertainment posts. I do this to keep up with news in one place while also being entertained. It's nice to just have one place to go to instead of a miriad of sites.", "app_url": "https://play.google.com/store/apps/details?id=com.andrewshu.android.redditdonation&hl=en_US&gl=US", "scenario_id": "MAS-G-0040"}, {"text": "When I'm looking for new music or just sort of want a change of pace, I go to Apple Music's Radio feature. From the main menu, I click on the Radio icon that's on the bottom of the page. I scroll down until something catches my eye that looks interesting to me. I look for an artist I like, or a specific type of music that I like. Once I see something interesting, I tap on the picture and that brings up some general information about the radio \"station\". From that I can usually quickly decide if it's something I want to sample. I usually sample by clicking on the featured playlist and listen to some of the songs. I can usually tell pretty quickly if it's something I like and/or am in the mood for. What's nice about the radio feature is that it's a really quick and convenient way to find new artists and expand my range of tastes. I don't have to wade through much stuff to find out if I like it or not.", "app_url": "https://apps.apple.com/us/app/apple-music/id1108187390 ", "scenario_id": "MAS-G-0041"}, {"text": "I recently moved to the state and I do not know where things are. Using the Waze app to find directions I can also find the stores or businesses I am looking for near me. I use this screen to find the closest store near me at the moment. My goal on this screen is to find the Frys grocery store near me that is the least number of miles away. To get to this screen, first I open the waze app. On the home page, bottom of the screen is a search bar. I type in the search bar what I am looking for, in this case Frys. I type in Frys and hit enter and I get a list of Frys stores near me and the number of miles away it is. Then I can click on my search results and find out how long it would take to get to the store I picked. ", "app_url": "https://apps.apple.com/us/app/waze-navigation-live-traffic/id323229106", "scenario_id": "MAS-G-0042"}, {"text": "The app I have selected and presented is the Chipotle Mexican grill restaurant mobile ordering app that gives you reward points for eating there which can be exchanged. I personally find this app very convenient and beneficial as Chipotle is my favorite restaurant to visit and eat at. Once you have the app downloaded and logged in, you will be presented with the main screen for either ordering or using your rewards. At the top left is an icon that is a silhouette of a human with small lines going around the head. You click on this icon and then hit the “rewards exchange” tab where you can spend the points that you’ve accumulated from eating at the restaurant. There are a variety of options you can choose from with each costing more or a smaller number of points. For example, to add a bag of chips to your meal it would cost you 300 points, that is the smallest reward you can get. Whereas the most expensive costs 8750 points that is $35 dollars off chipotle merchandise. I personally like to save my points and spend them on the double meat reward, which costs 600 points. To redeem the reward, you desire you would simply select the image and confirm. After this you will be able to scan a QR code at the register or apply the reward to your online order. The goal of this screen is to simply reward you for being a patron and consumer to Chipotle and encourages return visits for free stuff!", "app_url": "https://play.google.com/store/apps/details?id=com.chipotle.ordering&hl=en_US&gl=US", "scenario_id": "MAS-G-0043"}, {"text": "I have a huge iTunes TV and movie collection that I allow my family to share.  It's a fun thing that I enjoy collecting and sharing.  One key app I use to help me not go bankrupt doing this is Cheapcharts.  It helps me keep track of  my library and place movies that I want to purchase on a wish list, then I get alerted when they go on sale.  To get here I open the app, tap the upper left corner to bring up the side menu, then select \"Wish List\".  From there I can easily toggle between movies, TV Shows, or even audio books that I may look to purchase once the price goes down.  I can also choose \"On Sale\" on the side menu to see everything that is on sale in case there's something I want that I didn't think to have on my list. ", "app_url": "https://apps.apple.com/us/app/cheapcharts-your-media-deals/id772046134", "scenario_id": "MAS-G-0044"}, {"text": "On the Spotify app, I use this screen by selecting new music I like and listening to them. The goal I want to achieve through the screen is to find new songs to add to my playlist. The steps I took to get to the screen of the app is by selecting the search image. Once I am on the search tab page I click on the \"New Music Friday\" to see if anyone's songs are of my interest. Another goal I want to achieve through the new release section of the screen is sharing the song with my friends. I would make a new playlist and select the new songs that I think my friend will like and share with them. Another goal I want to achieve through the screen is to find songs so time can go faster instead of wasting my time doing nothing. It is a good way to use my time.", "app_url": "https://apps.apple.com/us/app/spotify-music-and-podcasts/id324684580", "scenario_id": "MAS-G-0045"}, {"text": "This is where i go to see all my subreddits, its the most used screen on the app because when i go  here all my important ones that i Favorited with the blue star are all there for my liking  and browsing, i also go to this screen to check any messages or reply i have had from any posts I've posted. There are more subreddits that do no not fit on this screen but these are the top ones where i mostly spend my time in, I would say the most used ones would be NBA and Florida, there is always something new on there and relatable to my interests. I sometimes do not even scroll down to see the rest of the subreddits i just know i am going to those 2 before i even enter this screen. I like the black theme because its easy on my eyes as well. ", "app_url": "https://apps.apple.com/us/app/apollo-for-reddit/id979274575", "scenario_id": "MAS-G-0046"}, {"text": "I used the Twitter home feed to get the latest news and updates from the people I follow. I get to this screen just by opening my Twitter app. After opening it, the home feed automatically loads up. I then scroll the feed to read information. Most of the time, the feed contains ads and retweets. When there are too many retweets from one specific source, I go to that person's profile to mute their retweets. I don't want my feed to be full of retweets but I understand why some profiles will do that. They don't have enough content of their own or they feel like they have always have to be active to beat Twitter' algorithm, so they'll retweet so many things. The ads that show up on my feed are ok since I can quickly just scroll past them. When I see a tweet that is interesting, I will like and/or retweet it.", "app_url": "https://play.google.com/store/apps/details?id=com.twitter.android&hl=en_US&gl=US", "scenario_id": "MAS-G-0047"}, {"text": "I use this screen in order to decide which subreddit I want to go to, especially if I'm just bored but I'm not sure what I want to look at. To get to this screen I just click on the app and click on the icon with 3 lines, and that is how I get to this page. This is a page that shows me all of the communities/groups that I've chosen to join on Reddit, and the top posts from a mixture of these subreddits will be what I see on my homepage (called Front Page on the app). There isn't a limit on how many subreddits you can join so I'm a member of many of them. You can also use this screen to easily unsubscribe to a subreddit, like I'll unsubscribe if the subeddit isn't active, or they give false information, or if I notice a subreddit has a large population of far-right people. This page also lets you create your own community, but I've never used that feature before so I don't know the details of it. I do know that literally anyone can create a community, but it's difficult to make it successful and populated, unless it's some niche topic that doesn't have a subreddit yet, or if you just get lucky or advertise it on Reddit and other social media websites.", "app_url": "https://apps.apple.com/us/app/reddit/id1064216828", "scenario_id": "MAS-G-0048"}, {"text": "To secure your notifications and manage the app's notification. I need to go to that particular place to manage my notifications of the app. Search for this setting through the search bar. Hide the notifications using this setting. It maintains the security level at a high level. It will be really good to maintain your app's security. It was important see the notification through this setting. It has various tones in it. It makes the phone vibrate when the notification arrives. It has reaction notifications to make full use if it. It makes the users more comfortable to use. It was the easiest way to maintain the notifications of the app. It was not very difficult to keep the notifications in the app. Default settings will be fine to use and interesting to look out for. there was no need of changing the default settings. It is user's wish to change or maintain the notification settings. ", "app_url": "https://play.google.com/store/apps/details?id=com.whatsapp", "scenario_id": "MAS-G-0049"}, {"text": "I use this screen on the app to treat myself and find items that I might like. Basically, after everything I've done and bought on Etsy, it's curated what I like, or at least it's idea of what I like, and it suggests me stuff based off of that. Having a tab to similar items that I have viewed helps me achieve my goals of getting items I want, finding new things I might not have found, and overall it's just an easier way to have access and gain insight on cool shops and items that could be very great for me. The steps I took to achieve getting to this screen we're pretty simple, I just open the app, and when I'm on the home page it has this \"items similar to what I've viewed\" tab, which I then click on. I click on this tab, and browse through all the items, and find stuff I might like, or my spouse might like, etc. It's just a good way to treat myself and find cool things.", "app_url": "https://play.google.com/store/apps/details?id=com.etsy.android&hl=en_US&gl=US", "scenario_id": "MAS-G-0050"}, {"text": "The goals that I want to achieve through this screen is to check my previous payments, to see how many payments I have left(along with their amounts), and to possibly make an early payment. The way that I get to this particular page is by first opening the app, tapping on the profile icon on the bottom of the screen, tapping on \"Your Orders\", tapping on \"Filter\" and selecting \"2021\" under \"Filter by order date\" and then tapping \"Apply\". I then tap on the purchase, which is an ASUS laptop, scroll down to the \"Order info\" section and tap on \"View and manage monthly payments\". From there, I tap on the summary information for the payment plan, which then takes me to the more detailed page(the screenshot). In order to achieve my goals, I either just quickly review the previously paid amount and see what amount is still remaining to be paid or I scroll down a tad bit to tap on \"Pay early\" in order to make the next payment now instead of waiting for it to be automatically deducted from my payment method on the specified future date.", "app_url": "https://apps.apple.com/us/app/amazon-shopping/id297606951", "scenario_id": "MAS-G-0051"}, {"text": "I use this screen to set up details about my WhatsApp account. I get here through the tab on the main page. I'll often change my notification settings here if I'm bombarded by DMs that day. I sometimes get strangers messaging me, so I use these settings to filter those out. As you can see, everything is laid out nicely from this screen. I can even invite friends to WhatsApp if I want. I could also experiment with the themes from this settings page, but I haven't done that yet - I still use all of the default functionalities. Occasionally I will enter the Account section here and make edits to my avatar. I have changed my phone number once as well, and I'm grateful that my number is not available from this page. Overall, this page was very easy for me to access - it only took one step really, and another step to get to where I want to go from here.", "app_url": "https://play.google.com/store/apps/details?id=com.whatsapp&hl=en_US&gl=US", "scenario_id": "MAS-G-0052"}, {"text": "This screen shows the menu of channels in the NFL Chat Discord server. This allows you to go to various channels (like chat rooms) devoted to various topics. To get to this screen, I tap on the server's icon on the left hand side. Then you can choose from the various channels in the server by tapping on the name of the server. Then you can talk to people on the server similar to how you would in a text messaging app with a text box at the bottom and your phone's keyboard. You can also share links, videos, or photos in the channels by using icons above the keyboard where you type. You can reply to other people's messages by quoting them using a special formatting language called markdown, or react to their messages by tapping and holding your finger on a message and waiting for the emoji menu to show up. When you've finished, you can his the enter button, and your message or reaction will be posted to the server for other members to view.  ", "app_url": "https://apps.apple.com/us/app/discord-chat-talk-hangout/id985746746", "scenario_id": "MAS-G-0053"}, {"text": "I always use this screen to set my fantasy team lineup for the day. I decide which players to sit and which players to start. My goal is to get the best stats that I can that day. I also use this screen to track my daily stats. After opening the app, I navigate to my team name and then select the My Team option on the bottom navigation bar. Once at the screen, I can start players to leave them on my bench. I make these decisions based on recent performance and also on pitcher and hitter match ups. I also take into account players that are considered injured or day to day. If a player is on a c old streak, I am more likely to sit them. If a pitcher is facing a good team, I might sit. This can all be done via drag and drop. ", "app_url": "https://play.google.com/store/apps/details?id=com.yahoo.mobile.client.android.fantasyfootball", "scenario_id": "MAS-G-0054"}, {"text": "I might click through to this screen if I couldn't find an interesting video on the home screen, and if this page showed a relevant category of videos to choose from. I can find videos that are both relevant to things I've recently watched on Youtube, as well as find videos from Youtube creators I frequently tend to watch. It also suggests channels I've never heard of before, so I could possibly find new interesting Youtubers to watch. To get to this feature, all you need to do is look at the top of your home page, and it's right there. There's an 'Explore' button that you can press to explore all kinds of categories, such as trending, music, sports, etc. And then there are the more personalized 'Explore' buttons that are relevant to you. To look through the different personalized Explore buttons available, you just swipe back and forth on the part of the screen where it shows the buttons. ", "app_url": "https://play.google.com/store/apps/details?id=com.google.android.youtube", "scenario_id": "MAS-G-0055"}, {"text": "This is how I analyze my games, or others' games, after they have been played. It is used to gain knowledge and see how the game could have played out in other lines/moves. From the home screen of the app, you can get here a few ways. Normally, I will go to my own games played, which requires me to open the profile page, then the games played tab, and then select a game. This will take me to the game board. From there I can find the analysis board function in a dropdown menu. Selecting that will take the game to the analysis board, allowing me to use the computer to analyze lines, to play out moves and see the best moves by computer analysis. I can also compare games I've played to others in the database from here, allowing me to see how other games will play out, to see if there are common traps or attacks that are used in certain positions by using the menu on the bottom. After moving pieces, the computer will automatically analyze them and offer move suggestions. It will also create new lines that you can save and go back to, automatically.", "app_url": "https://play.google.com/store/apps/details?id=org.lichess.mobileapp", "scenario_id": "MAS-G-0056"}, {"text": "When I open up the Twitch app and navigate to the \"Browse\" tab, I am actively looking to find a game or specific streamer. Luckily, Twitch saves my browsing history so I don't have to input my request every time. Since I'm already logged into my account, when I open the app I just tap on the \"Browse\" icon on the bottom right of the screen. Once I'm at the browse screen I can tap on the magnifying glass icon to input a specific word or phrase. If I was looking for a specific Twitch channel I would tap on the magnifying glass and input the channel name. This would immediately bring up the best matches for the name I inputted. There are also game categories so I can browse every streamer that's live in that category. That can be done by tapping on the image of the category you are interested in. Less used, but still helpful, is the \"Live Channel\" tab. Tapping on that tab will bring me to a list of all the streamers who are currently live on the platform. I can then use the \"Sort and Filter\" icon on the bottom middle to narrow down the type of stream I am looking for.", "app_url": "https://apps.apple.com/us/app/twitch-live-game-streaming/id460177396", "scenario_id": "MAS-G-0057"}, {"text": "I use the Deezer Shows screen to browse podcasts and find new content worth listening to. I use it to find podcasts that I have not previously listened to and would be good for me to subscribe to. In order to get to the podcasts screen I just go to the horizontal menu at the bottom that is visible when you first open the app. The Shows tab is the second option in the list, which I click to open. From there I scroll to the bottom where you can see categories of podcasts by duration as well as podcasts by network. From there I browse the different duration categories to find a podcast that fits within the timeframe that I am looking to listen to. If I can't really find anything from there that I want to listen to, I'll check for podcasts by network by opening up some network categories that I am familiar with.", "app_url": "https://play.google.com/store/apps/details?id=deezer.android.app", "scenario_id": "MAS-G-0058"}, {"text": "So this app is basically an app for the website reddit, but the app makes it much more user-friendly and accessible in my opinion. This main screen right here is the front page of Reddit, a social media site with hundreds of interest, subreddits for those interest, topics, discussions, and more. I use this page right here to cater to my interests and find out what's popular in those certain interests if that makes sense. So basically, I use this app, it allows me to send all my favorite subreddits of my interest to this page I took a screenshot of, and then I can browse through the page and find out what's popular or going on in those particular fields. This is pretty fun and helpful as an app to me, because it helps me learn new things, relax, watch some funny videos, learn a new skill, socialize, or overall just have a decent time on the app. To get to this screen is very simple, I just open the app, and this page is the first page that opens. My goals and steps are what I just described, I cater it to my interests, and my goal is to take in information or learn new things about those interests, and to discuss and socialize.", "app_url": "https://play.google.com/store/apps/details?id=com.rubenmayayo.reddit", "scenario_id": "MAS-G-0059"}, {"text": "When I access the Network tab on the VLC app I am looking to stream media from my NAS to my mobile phone. I mainly do this when I am in the kitchen cooking dinner or sitting down in another room in the house. To get to the Network screen I open the VLC app on my phone and tap on the icon on the bottom that says \"Network\". Once there, I could access any of the file shares on my network. Since I have a few Samba shares and filesharing enabled on my router, there are many different ways for me to stream media. Typically, I select my router because it seems to be the fastest at populating the list of shared media. On the rare occasion I use the network tab to download a movie or TV Show to my phone so I can take it on the road. To do that I tap on the \"Download\" icon in the middle of the screen and enter the URL of the file I want to download. It's easy, clean and works every time I want to use it.", "app_url": "https://apps.apple.com/us/app/vlc-media-player/id650377962", "scenario_id": "MAS-G-0060"}, {"text": "In order to know what is happening with traffic and if it is going to add a lot of time to my work commute, I use Waze. I first tap on the Waze app, then click on the 'Where to' box and click on work since I've already entered the address previously. The app will tell me approximately how long it will take with current traffic conditions. As I travel to work, it will update me on whether there is an accident, a hazard on the road, or where police have been reported so I can watch my speed. If there is an accident, I can get off the interstate and Waze will automatically adjust to the new route and tell me what route to take to make it to work. While I use it daily for work, Waze really works well when I'm traveling some place I've never been. It's comforting to know that I won't get lost and if I miss a turn, Waze will adjust and help me reach my destination.", "app_url": "https://play.google.com/store/apps/details?id=com.waze", "scenario_id": "MAS-G-0061"}, {"text": "This app helps me achieve the best sound quality for my device(s). It is a music player app, but it offers so many ways to customize your experience, that you can stay on this app all day fiddling with different options. It is also easy to use these controls and navigate the app. Once you have opened the app, and selected a song of your choice, the song will play and you will see a small bar along the bottom of the screen (above phone home controls). Click the equalizer symbol, or the three uneven vertical bars, and you will be where the screenshot is. This is where the magic happens, as this is where you can take your time and play with the sliders, the tones, etc. Also, there are more sound options if you explore further within the equalizer tab. Once you are content with your sound options, you can save it on the app. You can create multiple sounds/profiles and save them. Applying them to music is as simple as selecting the one you like the most.  ", "app_url": "https://play.google.com/store/apps/details?id=com.maxmpz.audioplayer", "scenario_id": "MAS-G-0062"}, {"text": "I use this screen to find coupons for my participating Family Dollar. This is the first screen when opening the app, so I don't press anything to get to it. I want to try and lower my prices at the store and get the best deals. I scroll through all the available coupons and  then I choose the coupons that are relevant to me and \"clip\" them, meaning I can use them in the store next time. Now, I will be able to use these coupons during my next shopping trip to get these deals. I can also search for items and get prices by using this app. This app shows if my local Family dollar has any item that I search for and the available quantity for that item as well. It shows me if it's on sale and if there are any available coupons for that particular item. ", "app_url": "https://play.google.com/store/apps/details?id=com.familydollar&hl=en_US&gl=US", "scenario_id": "MAS-G-0063"}, {"text": "My goals are to track my health and wellbeing over time on this screen. I first tap the menu in the top left of the main screen, then tap on Graphs & Reports on the list to get to this screen. Once I'm on this screen, I view the cycle duration to make sure that it's on irregular and close to average. Then I click on the different icons to input information that will help me track my health and it's changes. I tap on Weight to enter my weight for the day and to view the graph to see how quickly I'm losing weight and if I need to change something in my diet to continue losing weight. When I'm feeling tired and want to keep a close record of my sleep, I tap on the Sleep Duration icon to enter my sleep cycle and check to see that I'm getting my target sleep each night or total for the week. The app tracks all the health information I need to meet these goals and shows them to me in a quick understandable way.", "app_url": "https://play.google.com/store/apps/details?id=org.iggymedia.periodtracker", "scenario_id": "MAS-G-0064"}, {"text": "My goal in the step I'm about to describe is sharing a video that I've recorded with the app.  I generally record them for business purposes.  To share a recorded video, I first find the icon on my phone's screen.  It's on the primary screen I use when working with it.  I then click the icon.  Four different icons appear, and I click the one with four squares to access my videos.  On that screen (as it appears in the uploaded screenshot), I click on the network icon which looks like a \"less than\" symbol with circles at each angle.  I'm then given several options which are quite useful.  At this point, I generally choose the email option so I can directly attach it to one via my phone.  I've never had an issue sharing a video in this way as it's been a very reliable app.", "app_url": "https://play.google.com/store/apps/details?id=com.hecorat.screenrecorder.free", "scenario_id": "MAS-G-0065"}, {"text": "To search for what's trending or popular in the world on Reddit at the moment, I click on the 'Popular' tab on the far right after opening the Reddit app and starting on the homepage. From there, I'll make sure that the setting, \"Hot Posts\" is chosen on top left, followed by simply scrolling down by swiping up on my phone to see which posts interests me and that I'll click on and read, chat in the comments or save for later. My goal is just to be entertained and learn something from anything that pops up. I definitely end up spending quite a bit of time scrolling through various posts and leaving comments because I enjoy that social aspect of the app. I get to communicate with like-minded people that are enjoying the same content that I am checking out as well. Sometimes I'll end up learning some important news that's happening nationally or in the world.", "app_url": "https://apps.apple.com/us/app/reddit/id1064216828", "scenario_id": "MAS-G-0066"}, {"text": "I use this to watch live programming of tv shows because I do not subscribe to cable. This is paramount plus live section, they feature live programming from around where I live and also different channels as well as channels comprised of their own content. I use this feature to entertain myself mostly, like quickly finding a channel to watch on my lunch break. I also use it to watch local news and weather reports. It also has sports channels and showcases live and upcoming sports games. It is really easy to get to, once I open the app I click the live button on the bottom of the screen and it takes me to this page. On this page I can scroll thru the list of channels to see each channel and what is playing on it, as well as see upcoming shows or movies. I can also scroll thru the top banner and choose from different genres. ", "app_url": "https://play.google.com/store/apps/details?id=com.cbs.app", "scenario_id": "MAS-G-0067"}, {"text": "1. On this screen (on this section of the app) I change various settings so that I can set up video recordings specifically to my liking. Usually I want to achieve getting things set up so that my video recordings are of a high enough quality that they look alright to look at, but also aren't so high that they take up a ton of data when they're saved, and won't take up a lot of processing power to record.\r\n\r\n2. In order to get to this screen I tap on the app once, after which it opens a small bubble, and a bar above from the drop down menu. I click on the \"Home\" button from the drop down menu, which opens the main app. From there I tap the \"Settings\" button below, shown by the gear symbol.\r\n\r\n3. Once on this screen, I make adjustments, such as the video's orientation, the location of the save file, the resolution, frame rate, and general size of the file, as well as other settings like whether to enable or disable shaking to stop record, and other things like adjusting a countdown timer before recording. In order to do so, I tap on any of these settings, which then opens up a new menu with several options. From there I select all the options I want, and hit a checkmark button to save all the changes I've made. I do this for each individual option section until I'm pleased with all my changes.", "app_url": "https://play.google.com/store/apps/details?id=videoeditor.videorecorder.screenrecorder", "scenario_id": "MAS-G-0068"}, {"text": "Viewing this screen allows me to see a quick visual representation of how many calories I have already consumed today and how many are left in my daily calorie budget. It also allows me to see how my overall week has been thus far by showing me how many calories I am below budget for the whole week, which tells me if I have a little wiggle room to go over my budget today or not. To get to this screen, I open the app which gos right to the daily log with my detailed food entries, then I click the \"My Day\" icon on the bottom left of the screen to reach this daily overview screen. Once I'm here, I can view most of the info I want directly on this screen, but I can also scroll to the right along those icons at the top to see which daily tasks remain for me to complete if I'm interested in more than just the daily intake overview.", "app_url": "https://apps.apple.com/us/app/lose-it-calorie-counter/id297368629", "scenario_id": "MAS-G-0069"}, {"text": "I use this screen to check for bad weather coming through my area. Sometimes I want to just check for rain if I am anticipating being outside or having an outdoor event. It is especially helpful when there is unusually bad weather, such as tornadoes. To get to this screen on the app, I just have to click on the \"Radar\" tab, which is located on the footer menu of the app. Once on the screen, I need to put in the area that I am wanting information about into the search field at the top. Once I have entered the appropriate city and state, it will show a localized map. I can zoom in or out according to my preference. Next I can tap on the arrow to see a video of past, present, and future radar of weather coming through that area. If I need to pause, I can do that or I can rewatch it again as many times as I need to.", "app_url": "https://apps.apple.com/us/app/weather-the-weather-channel/id295646461", "scenario_id": "MAS-G-0070"}, {"text": "I would typically use this screen to look for a book. I select this screen when I want to find a book in the fantasy genre, though it is easy to follow a link from this page to find a book from a more specific category. I can choose a book, from the selection of titles, and tap for a more detailed view of that product. I can also look at what's new, in the genre, and learn more about what has been added since I last looked. I can find what the best sellers are, in this category, and browse through them to find one that suits my mood. I can also tap on the authors name, under the title of the book, and find a more detailed catalogue of what materials are available from that author. I can tap to go home, or navigate to my personal library. I also have the option of navigating to a discovery mode, where I'm shown suggestions, or I can move from this screen to my user profile.", "app_url": "https://play.google.com/store/apps/details?id=com.audible.application", "scenario_id": "MAS-G-0071"}, {"text": "I use Cronomoter, and specifically this screen, to track my food and exercise each day. It helps me to stay on track with my eating and exercise goals. The part on top is showing my calorie and macronutrient breakdown, and targets, for the day. For example, today I want to eat about 2100 calories, 133 grams of protein, 213 grams of carbs, and 83 grams of fat. Hitting these targets helps me with my ultimate goal of being healthy and hopefully building some muscle. To get to this screen I opened the app and tapped on the Diary picture in the bottom left. Then I swiped to the left in the top section, in order to get it to show the calorie and macronutrient breakdown. To use and interact with this screen I tap the Plus Sign at the bottom, which brings up another menu where I can manually search for and add a food I've eaten or scan the barcode on the packaging. Once I've selected the food I can add the amount. For example, 98 grams of banana. I can also search through different exercises to add one that I've done. It's still early, so I haven't eaten or done much today, which is why the entry is still fairly short.", "app_url": "https://play.google.com/store/apps/details?id=com.cronometer.android.gold", "scenario_id": "MAS-G-0072"}, {"text": "By selecting this greeting, I can choose to have spam callers hear it.  In this way, they may think that it's an out-of-service number so they will hopefully take it off their spam / scam list.  So the goal is, ultimately, to confuse scammers and people who want to hack your phone.  This is a security measure in a world where cybersecurity has become paramount.  To get to that screen in the YouMail app:  open the app, click on the menu icon at the top left (three horizontal lines), tap \"greetings\", select the \"recordings\" tab, and then you will be able to select from the current recordings.  At that point, to achieve the goal of selecting it, simply press the one that says \"Number Out Of Service\".  It can also be played on the screen that appears or assigned to contacts if one so chooses.", "app_url": "https://play.google.com/store/apps/details?id=com.youmail.android.vvm", "scenario_id": "MAS-G-0073"}, {"text": "I have been using the Inboxdollars app for over a year now.  I treat it as a little side hustle for paying bills or simply being able to afford gifts for birthdays or christmas.  It has come in really useful through out the year.  I find it to be one of the most profitable apps out there where you do not have to spent any money to use it. It's completely free and very generous to use. My main goal when using this is to at least log in once a day and meet the basic goals which can easily be accomplished within a couple of minutes.  The steps I took to get to this screen was simple.  I just opened up the app and then just swiped upwards and there I was.  It shows me the daily goal and how many days I have been reaching my goals.  The monthly goal really pays off too.", "app_url": "https://play.google.com/store/apps/details?id=com.mentormate.android.inboxdollars", "scenario_id": "MAS-G-0074"}, {"text": "I like to play simple games on my phone. One of my favorites is Sudoku because it's relaxing and challenging at the same time. I like this particular Sudoku app because it has a very clean interface and not a lot of ads that interfere with my concentration while playing. To access this app I just click on the icon that I have saved to my homescreen on my Android phone. I definitely use this app a lot, but I'm not sure that I have a specific goal in mind when I use it. I suppose I like to challenge myself and take satisfaction every time I can complete a puzzle, especially when I can do it in as little amount of time as possible. It's a great distraction I'm in line somewhere and it's also fun to do while I'm relaxing at home. Pretty much this screen is the entire functionality of the app.", "app_url": "https://play.google.com/store/apps/details?id=ee.dustland.android.dustlandsudoku", "scenario_id": "MAS-G-0075"}, {"text": "To see what's trending in the world, I first go to the bottom of my screen and click on the magnifying glass icon. I have the choice to go to any of the top portions by sliding on the screen. I click on the icon and slide over to the trending page. When I am on this page I look for things that interest me. This page usually has the major news things going on right now in the world. I want to stay updated on everything new that is happening in the world. When I find something that I want to explore more I click on it and the app takes me to a bunch of different tweets about the topic I want to see. I then read through all of the different tweets or news articles and pick the ones that I find most interesting and I click those to read more into them.", "app_url": "https://play.google.com/store/apps/details?id=com.twitter.android", "scenario_id": "MAS-G-0076"}, {"text": "My goal is to find music I love. I search through my favorite genres, usually pop, hip hop, alternative, and rock. I will want to search for music and create my own collection of music by clicking add to the collection. I will then be able to click my collection in the future and listen to all the songs that I love. My thoughts about using this app is that it allows me to find new artists and ones that I already know about. I can listen to music whenever I want to through this app and I can relax and get some cleaning done while listening. I also love the feature of it showing me the lyrics so I can really get to learn the songs and what they are saying in the songs. I would also use the search feature to find the songs that I have been listening often.", "app_url": "https://play.google.com/store/apps/details?id=com.pandora.android", "scenario_id": "MAS-G-0077"}, {"text": "When I open this app I go to this page and can update my profile. I can see how much progress I have made. I will then look at some of the plans that are available and if nothing interests me I can choose my own. I will typically go to the goals section and update or adjust any goals I want to achieve. I can set my reminders and nutrition information from this page. I can go to this page to check the steps I take daily. This is where I would also update my friends list and can interact with others through community. Over all this is the main place to make any changes and to see all things in an overall hub type place so that it is all easily accessible. I can make all of my inputs from here and also learn more about each section.", "app_url": "https://apps.apple.com/us/app/myfitnesspal-calorie-counter/id341232718", "scenario_id": "MAS-G-0078"}, {"text": "What I want to achieve through the screen is to find out up-to-the-minute info on what the humidity is outside. It varies a lot where I live and I moved here recently and the humidity, more than any other weather here influences what I do for the day. I have a really hard time in high humidity so I use it a LOT to plan out my day. To get there, I just click on the app icon from the main screen, my city is the first city shown, so I just scroll down about a page worth and I see the humidity right now. Once I see what it is, I can judge whether I want to put off some of my errands and other things I want to do outside, or if it's best for me to do it now because the humidity is low. It changes a lot throughout the day, so I'm constantly checking this.", "app_url": "https://apps.apple.com/us/app/weather/id1069513131", "scenario_id": "MAS-G-0079"}, {"text": "The major reason why I made use of this screen is that I need to look for new TV shows and also to continue watching a previous TV Show that I was seeing, Currently, I'm seeing a TV show titled Van Helsing. Steps to getting to this Page; First I need to open the Netflix app, I'll then need to log in to a pre-existing account. Afterward, I navigate to TV shows, and then I navigate to Continue watching. right there, I'd see any program or TV show that I was previously seeing. All I have to do next is to click on the program or TV show, It'll display information about the show. I can then decide to Play and continue watching the show from where I stopped or I could choose to check out and select other episodes. I could also choose to watch a triller if it's my first time seeing the Show.", "app_url": "https://play.google.com/store/apps/details?id=com.netflix.mediaclient", "scenario_id": "MAS-G-0080"}, {"text": "This is the exact part of the Reddit application where I go in order to see all of the pages, or subreddits, that I am currently subscribed to. The main thing that I aim to achieve whenever I am on this part of the app is to get an instant shortcut to all of my favorite pages that are hosted on Reddit's website. There is a very small amount of steps that are necessary to get to the part of this app in question. First, I open the app up. Secondly, I click on the icon at the bottom left of the screen, specifically, the one that is second to the left. Once I get to this part of the app, it is all just pretty much smooth sailing from there on out. I just simply click on the subreddit in mind, and it takes me right over there. I can then read, comment, post, and share.", "app_url": "https://play.google.com/store/apps/details?id=com.reddit.frontpage&hl=en_US&gl=US", "scenario_id": "MAS-G-0081"}, {"text": "I use this screen to keep up to date on the scores of the MLB. I want to achieve keeping up with the teams around the league. Baseball is important to me as I like following a team so I feel connected to others who also.  I to to this screen by opening up the MLB app on my Samsung. At first it takes me to the home page of my favorite team, the Atlanta Braves. At the bottom of the app there is a button that says 'Scores'. Selecting this will take me to the Scoreboard for all the teams around the league. It defaults to the current day and has my favorite team at the top of the page. I then can choose to just quickly look at the scores or select on one to get more stats of the game. This allows me to stay in touch with the entire league with a click of a button. ", "app_url": "https://play.google.com/store/apps/details?id=com.bamnetworks.mobile.android.gameday.atbat", "scenario_id": "MAS-G-0082"}, {"text": "This view is helpful for me to see the full photo my friend posted, the caption and any comments, and for me to like and/or comment on it myself. It's the key place where we interact about our images.\r\n\r\nYou can get here by either (a) browsing the main feed  (b) using a search function to find my friend by name  (c) looking through my following list to find my friend specifically if i haven't seen them in a while  (d) changing the main feed to show only images from people I am following in chronological order.  All of these options lead to the view of an individual photo with comments.\r\n\r\nonce there, I can scroll up and down to read all the accompanying information. I can long press on the photo and pinch outward to magnify and see any details I want to examine. note i have an iphone mini so my screen size is pretty small", "app_url": "https://apps.apple.com/us/app/instagram/id389801252", "scenario_id": "MAS-G-0083"}, {"text": "So this is an open source client for reddit.com. I don't usually have a specific goal when using the app - I'm just browsing popular stories, images and discussions of the day from reddit. The app has a menu on the left side where you can browse the /r/all page (popular submissions), the home page (which is tailored by your interests), and specific subreddit communities. Basically on this page, I'll just be scrolling through, looking for something amusing, or interesting to see more information about. It might be a gif of a cat doing something stupid, a news article about the government doing something stupid, a discussion about users of reddit doing something stupid. Any number of stupid things can be found. \r\n\r\nI like the app because it's open source, ad-free, easy to use and free of clutter. I don't actually get it from the play store link above, I use an open source package manager called F-Droid. ", "app_url": "https://play.google.com/store/apps/details?id=org.quantumbadger.redreader&hl=en_US&gl=US", "scenario_id": "MAS-G-0084"}, {"text": "My goal with this screen is to prevent any unwanted pregnancies. To get to this screen I have to open the app and then click on a day provided on the calendar it shows upon app opening and it takes me to this screen. I use this screen to record any information regarding my period, sexual activity, symptoms from my period as well as if I'm ovulating or have cervical mucus which helps me determine my risk of pregnancy and when I should be using a form of birth control. For example if it shows that my fertility window is high or moderate I try to be sure to use birth control if I have sex so I won't get pregnant. If my fertility is low or non-existent then I know I can safely have unprotected sex. I can also record if I had protected or unprotected sex and it will show me the probability of me becoming pregnant.", "app_url": "https://play.google.com/store/apps/details?id=com.lbrc.PeriodCalendar", "scenario_id": "MAS-G-0085"}, {"text": "The GetUpside app is used to get cash back on groceries, gas, and restaurants.  This screen shows a local grocery store where I could get cash back by claiming this offer and uploading a receipt within 24 hours.  In order to get to this screen I simply click on the store that I will be going to, there are many different stores/restaurants/gas stations that all have different offers for cash back.  So for instance another Cub Foods in a different location may have 10% cash back and another one may only have 5% cash back.  After I find the offer that I want to use I simply click on it and then click on claim offer.  As I said earlier at this point I have 24 hours to submit a picture of my receipt from my purchase on the app and I will usually get the cash back in my account with three or four days.  I usually cash out once I get about $15 dollars as there is no fee on withdrawals over that amount.  The money usually hits my PayPal account the next day. ", "app_url": "https://apps.apple.com/us/app/getupside-cashback-gas-food/id1099997174", "scenario_id": "MAS-G-0086"}, {"text": "I love this app because I get to use it to bring to life pictures I animate these pictures and I have found that. To make a new animated picture I open the app this is the first screen I see I select what kind of animation I want to do and then I get started by adding effects to my picture I add filters I change the colors I can Animate anything in alight motion picture simply by drawing a path. I add  real camera moving effects and dope photo transitions to your pics and video, I love the fact I can add already made animations to my photo and there are a lot ways that I use this app to make my pictures come to life, I then select what quality and length of the video output I want and then I upload it to YouTube and TikTok I love it because I can express Myself threw this app and it's easy.", "app_url": "https://play.google.com/store/apps/details?id=com.ryzenrise.movepic", "scenario_id": "MAS-G-0087"}, {"text": "I use this screen to see how  various cryptocurrencies are performing over the past 24 hours. I will quickly scan my favorite currencies and look at the price action from various time frames. The main goal i want to see if there is a very active crypto that I can potentially trade for the sessions. I log in to the app, click on the markets icon at the bottom, then scroll through the various markets. The US market, and the worldwide market before deciding on crypto. Once at the screen I will give a quick glance to all of the cryptos, then I will click on the ones of interest for a deep3er look individually. After doing that I will find a play, make a limit or then watch the play until my order is filled. Once filled I will trail the order until it reaches my target price or it stops me out at a loss.", "app_url": "https://apps.apple.com/us/app/webull-investing-trading/id1179213067", "scenario_id": "MAS-G-0088"}, {"text": "This feature is the Chipotle restaurant rewards that are given through redeeming points by eating at the restaurant and accumulating the points over time. The first step is to find the icon at the top left-hand corner of the screen shown as a human with rays around the head, then proceed to click this. After you will see in the middle of the screen an option that says, “My Rewards.” Where it will display the rewards, you currently have redeemable for use. Click the reward and add it to your “bag” so that it can be scanned or redeemed on your next purchase for free stuff! My goal on this screen to get more bang for my buck and get free offerings by eating a really good restaurant I enjoy- Chipotle. The feature works as a sort of cashback scheme in which I can earn more by eating there more. ", "app_url": "https://play.google.com/store/apps/details?id=com.chipotle.ordering", "scenario_id": "MAS-G-0089"}, {"text": "Upon opening Twitter, I'll tap on the magnifying glass to search for topics. The trending topics allow me to stay up to date on what is currently going on. They show different news topics and current events that I am interested in. It uses an algorithm that learns what I am interested in by what I follow and where I live and it personalizes trends for me. It saves me the time from having to search manually to find out about a piece of news that I am interested in. I can just tap on a story or trend and I instantly see top-rated tweets related to the event in question. I can even swipe up to refresh the trends if I am not interested in what is currently being displayed. I can hide certain trends that I don't like and the algorithm will learn from that and will tailor my trends better the next time around. This page is mainly a time-saver, which is why I use it so much.", "app_url": "https://play.google.com/store/apps/details?id=com.twitter.android", "scenario_id": "MAS-G-0090"}, {"text": "The screen is mainly how I get to the scheduling of the lightbulbs I have connected to the app along with the simpler 'tap to run' where I can just click it to turn on/off when needed. Getting to the screen is easy, down at the bottom where it says home/scene/etc you start on the \"home\" screen when you open the app. From there I simply clicked on 'scene' and it brings me to this page. From there I'm able to change the different scenes I have enabled or create new ones -- things like turning on the lights every night at a certain time and determining what percentage I want them at (higher for reading, lower for watching television, etc). I can even change the color of the lights which we like to do at night when we watch tv so that it leaves a slight glow (red or really dark blue) and it isn't completely pitch black.", "app_url": "https://play.google.com/store/apps/details?id=com.tuya.smartlife", "scenario_id": "MAS-G-0091"}, {"text": "I am a gambler so this screen is one of the keys to how i do my research. If I want to focus on hockey then I open up the flashscore app. I scroll to the games that are being played today after clicking the hockey button. It has all the different leagues in the world so I would click nhl. Say I am betting on red wings vs devils today as highlighted by the screen. Once I am on the page, it gives me an idea of their overall strengths and weaknesses. I can see the Red Wings are a little better than the Devils but Devils have the slightly better offense. I can expand the page to see just the last 5 games. In this case both teams are struggling so it is a game I might want to avoid. The top of the screenshot also has tabs so i can break it down by home/road and see which players in particular are in great form. Im not beating any books by doing this but it is a useful tool in my research.", "app_url": "https://apps.apple.com/us/app/flashscore-live-scores/id766443283", "scenario_id": "MAS-G-0092"}, {"text": "I use this screen to find good priced option contracts on stocks I can buy and or sell in my portfolio. My goals here is simply to grow my self directed investing portfolio to achieve more financial freedoms in my life and to be able to manage my portfolio to generate a consistent monthly income. To get to this screen that shows the option chain, and the watchlist of stocks on the right, I have to go through the login screen, after logging in I am on the dashboard that also has my watchlist on the right side of the screen. Then I just pick a stock from the watchlist by touching it, and it brings me to the options chain and overview screen that you see. To achieve my goal I look for stocks that have good pricing on their option chains, and match my other criteria rules for my portfolio before I buy and or sell any option. If I see a good one that matches up with my trade rules, I take the trade, otherwise I just move on, or not take any trades that day. ", "app_url": "https://play.google.com/store/apps/details?id=com.devexperts.tdmobile.platform.android.thinkorswim", "scenario_id": "MAS-G-0093"}, {"text": "Until recently, I'd use this screen mostly to view my Snapchat friends stories that they'd post periodically. As of today, I deleted all but 1 Snapchat friend, so I have almost no one's story to watch or view. So that being the case, I'd just use this section of Snapchat to view whatever stories Snapchat itself decides to upload here. To get this screen, you simply have to be logged into Snapchat, open up the app and swipe right. If you're trying to view your Snapchat friends stories, they would be at the top of this page, above all the stories Snapchat themselves post. If you have no one posting any stories, you simply scroll down and view the stories Snapchat posts. The main goal of this page is basically a cure for boredom or just mindless viewing of your friends stories or the stories that Snapchat post for it's users.", "app_url": "https://play.google.com/store/apps/details?id=com.snapchat.android", "scenario_id": "MAS-G-0094"}, {"text": "The Merlin Bird ID app is a application that lets you ID birds based on information that you provide. This screen allows you to enter (or edit) bits of information to the app that help the app come up with suggestions for what bird you may have seen. On this screen, I have entered the geographical location where I saw the bird, what size it is, the coloring, and whether I saw it flying, in the water, at a bird feeder, etc. The app the generates a list of best possible matches based on the information I just provided. Then, I scrolled down the list and selected the actual bird that I saw. I have a lot of birds in my back yard that come to my feeder and hand around in my trees, so this app is useful for identifying what they are and keeping track of what types of birds I have seen in my yard.", "app_url": "https://play.google.com/store/apps/details?id=com.labs.merlinbirdid.app", "scenario_id": "MAS-G-0095"}, {"text": "I use this app and this screen to enter daily fantasy sports contests for different NBA games. The screen changes in response to the filling of contests and the completions of different games or slates of games, and I choose the contests that I want to enter as I use the app. I also can fill out my lineups when entering the contest. I get to the screen by choosing NBA on the home screen, then hitting Classic to show my preference for the type of contests I want to enter, and then choosing a slate, which in this case is tonight's 7:00 slate. Now that I am at the screen I can scroll down and choose which contests I want to enter. If I have money in my account, then I can easily click a contest, then fill out a lineup and submit it and I will be entered. If I already have filled out a lineup, I can simply enter that one as I enter the contest. ", "app_url": "https://apps.apple.com/us/app/draftkings-fantasy-sports/id710535379", "scenario_id": "MAS-G-0096"}, {"text": "I use this screen within the spotify app with the goal of discovering and adding new music that is similar to the genres represented in the playlist. Since this particular playlist primarily includes hiphop and R&B music, the recommendations are similar. I review these recommendations periodically to update my playlist with new songs to keep my music selection fresh and entertaining. To access this screen, I first open the spotify app on my mobile android phone. I have my app set to automatically login, but other users could simply enter their email and password each time they access the app, if preferred. From the spotify home screen, I choose the option for \"your library\" at the bottom of the screen, which brings up all available (previously created) playlists. I then choose a specific playlist that I want to modify (in this case, \"my jams\"). After clicking on the title of the playlist, there is an option near the bottom of the screen for \"recommended songs.\" Clicking on the \"recommended songs\" option provides a list of recommended songs that are similar to the genres found in the playlist. There is a music symbol with a \"+\" sign to the right of each song selection. To add one of the recommended songs, I simply press the music symbol and the song is instantly added to the playlist. Alternatively, if I find that I am not interested in adding any of the recommended selections currently on the screen, I can use the \"refresh\" option at the bottom and will be given additional selections until I find a song that I want to add to the playlist. ", "app_url": "https://play.google.com/store/apps/details?id=com.spotify.music", "scenario_id": "MAS-G-0097"}, {"text": "I use this screen to get an idea of what others think about the topic of the post. My goal is to understand different viewpoints and thoughts that I may not be aware of myself. My goal is also to get more knowledge about the topic. I get to this screen by clicking on the post from either the subforum (AKA subreddit) posts listing or from the home page. Once at this screen I usually begin by reading the first few comments sequentially. I follow the thread of each comment until it no longer interests me and then collapse that top-level comment and move on to the next one. Once I feel that comments have become repetitive or are not within the context I am looking for (e.g., serious versus humorous), I may choose a different sorting method for the comments such as 'controversial' versus 'best'. Additionally, if I am looking for a certain piece of information or context, I may use the 'Find in Comments' feature to search comments for a specific word or phrase.", "app_url": "https://apps.apple.com/us/app/apollo-for-reddit/id979274575", "scenario_id": "MAS-G-0098"}, {"text": "I use the Instagram Explore page in order to seek out media from influencers on the Instagram app. When i am using the Instagram Explore page i am trying to find content that captures my interest or provide me with entertainment. I opened my iPhone and pressed the Instagram app icon which then takes me to the home page of Instagram after that i click on the magnifying glass icon on the bottom of the instagram page which takes me to the Explore Page. The moment i arrive on the Explore page i scroll down and look at the suggested content which includes pictures and videos. I will scroll until i find something that peeks my interest and click on the preview picture to view the content to achieve my goal of being entertained. I will also use the search bar at the top in order to input words that i have an interest in viewing which will filter media in that category if i am trying to be more precise.", "app_url": "https://apps.apple.com/us/app/instagram/id389801252", "scenario_id": "MAS-G-0099"}, {"text": "The main task is to calculate the data from my daily activity that from day starts and till the end of my day it just keep tracking the data of my health and activity and we need to add some data like our weight and height and some other data need to be provided inorder calculate a target and gives a goal of total activity that we need to do per day by then it gives us some award like things within the app if we do the given target goal each day and it also tracks the sleep track and gives us the data to analysis and then the app gives some rating and saves that data in the cloud from there we can check the data of almost one year back 's data and can analyze the data and if we add some more details like our health conditions it saves and it emergency condition the doctors can have access to the data even if we are in danger state", "app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "scenario_id": "MAS-G-0100"}]