[{"app_url": "https://play.google.com/store/apps/details?id=com.skype.raider", "usage_freq": "weekly", "text": "I use this screen to talk with my friend on Skype from the phone. I type messages to him and as long as be both have internet it is sent to him. We can also send audio messages or images to each other from this screen as well. Finally, we can perform voice calls and talk to each other on the microphone. I'm not sure if it's possible to do a video call from Skype mobile, I've never tried it. I also use the desktop version of this app and it has far more personal information than the mobile version. It's also got all my chat messages, though I don't consider any of the messages on this screen personal enough to redact, but all of it together would be personal information I would not want sent out to the web or to a third party without my authorization. I should also point out that the photo is not real, but were it real that would also be more personal information of both mine and my friends.", "scenario_id": "MAS-R-0", "risks": [["34", "40", 4.0], ["73", "81", 3.0], ["162", "176", 3.0], ["180", "186", 3.0], ["251", "262", 4.0], ["293", "303", 2.0], ["343", "353", 3.0], ["524", "537", 3.0], ["794", "799", 3.0], ["854", "874", 2.0], ["883", "887", 3.0], ["895", "902", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.gamefly.android.gamecenter", "usage_freq": "daily", "text": "This is the screen that lets me track what games I have rented, and which ones I have on my lists. This screen needs payment and an address in order to function. My goal is to organize my game lists in such a way that I get the games I want at the right time, and that they do not send me less desirable games. To do this I have to order the games in the order I want them, but I also need to take into account the Availity of the games as I do this. The app uses both their in-store counts on what they have, as well as my name and address to know where to send the games. Other than that it also has my payment info as I need to be able to pay for the services that the company provides to me. Lastly, I also have the option to buy the games, so I need to pay for that as well. ", "scenario_id": "MAS-R-1", "risks": [["38", "62", 5.0], ["68", "97", 5.0], ["117", "124", 5.0], ["132", "139", 5.0], ["188", "198", 5.0], ["342", "347", 5.0], ["524", "528", 5.0], ["605", "617", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.facebook.katana", "usage_freq": "daily", "text": "By using this screen edit my personal and account information. Information including full name, contact info like phone number and email ID, proof of identity, account ownership, and control settings. I can change my Facebook password and security settings like two-factor authentication, and authorized logins, get alerts about unrecognized logins, safe browsing, etc. I can set my payment preferences by using this screen. I can take a quick privacy checkup to know about my important privacy issues about security. I can set or change my preferences for the following news feed, reaction preferences like emojis and stickers, notification preferences, shortcuts preferences, language, and region, media preferences like autoplay, data saver, video quality, and themes like dark mode/light mode. I can change audience and visibility settings to control who can see my posts, stories, and profile. I can access a log of my activity and also I can access my information and download or transfer a copy of my information.", "scenario_id": "MAS-R-2", "risks": [["42", "61", 5.0], ["85", "94", 2.0], ["96", "108", 5.0], ["114", "126", 5.0], ["131", "139", 5.0], ["141", "146", 5.0], ["150", "158", 5.0], ["160", "177", 4.0], ["183", "199", 5.0], ["217", "234", 5.0], ["239", "256", 5.0], ["266", "287", 4.0], ["304", "310", 4.0], ["316", "322", 3.0], ["355", "363", 3.0], ["383", "402", 5.0], ["444", "451", 5.0], ["487", "501", 4.0], ["508", "516", 5.0], ["541", "552", 3.0], ["571", "580", 1.0], ["582", "602", 1.0], ["608", "614", 1.0], ["619", "627", 1.0], ["629", "653", 2.0], ["655", "676", 1.0], ["678", "686", 0.0], ["692", "698", 1.0], ["700", "717", 2.0], ["733", "737", 5.0], ["745", "758", 1.0], ["764", "770", 0.0], ["811", "819", 2.0], ["824", "843", 2.0], ["855", "875", 1.0], ["877", "884", 0.0], ["890", "897", 1.0], ["914", "917", 3.0], ["924", "932", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.seven.eleven.phoenix", "usage_freq": "monthly", "text": "This screen is a hub of my personal information. On this screen, I can view and edit my payment options. I can also change my current location, or permenantly change my address. I am able to find information regarding my reward points, and I can participate in referal programs. This is the page, for this app, where I take care of all of the back end requirements to use the app. I need to pay for my purchases, so I need to have current, correct payment information in the system. This is the hub where I can make changes to my payment methods. I need to make sure that deliveries will reach me, in my current location. I need to be mindful of what address is set, from this screen, to assure that my delivery will arrive at my current location. I may need to change my membership to a different level, which I will also need to do from this screen. (fyi, the reason I had to take a photo from a different camera, of the app screen, is that this app has privacy settings that prevent my phone's normal screenshot function from working)", "part2_false_pos13": "1", "part2_false_pos14": "1", "part2_false_pos15": "1", "scenario_id": "MAS-R-3", "risks": [["27", "47", 5.0], ["88", "103", 5.0], ["169", "176", 5.0], ["221", "234", 2.0], ["261", "277", 2.0], ["402", "411", 5.0], ["448", "467", 5.0], ["530", "545", 5.0], ["572", "582", 5.0], ["703", "711", 5.0], ["738", "746", 5.0], ["772", "782", 5.0], ["885", "890", 5.0], ["908", "914", 5.0], ["964", "972", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.podcasts", "usage_freq": "weekly", "text": "This page shows all the main podcasts that I follow/subscribe to, and it puts the most recently updated podcast in my subscriptions at the top so I will see it among the first on the list while I'm browsing through my favorite podcast channels. At the very top of the page, you can see a quick list of my favorites, which you can swipe left-right through, and which have a red dot on the top right corner, if there's been uploaded podcasts I haven't listened to yet from that podcast channel since the last time I had checked out that podcast. Each podcast listing below gives a nice brief summary of each episode that is named, so I can quickly preview the content of the podcast. At the very top left corner there's an option where I can stream the podcast content from my phone app to a connected device that I might prefer.", "part2_false_pos2": "1", "scenario_id": "MAS-R-4", "risks": [["29", "37", "N"], ["52", "61", 3.0], ["104", "111", "N"], ["118", "131", 4.0], ["227", "243", 3.0], ["305", "314", 3.0], ["476", "491", "N"], ["606", "613", "N"], ["658", "665", "N"], ["751", "766", "N"]]}, {"app_url": "https://apps.apple.com/us/app/community-first-cu-of-florida/id768808164", "usage_freq": "daily", "text": "I use this screen to stay on track with my finances. This screen shows me all my recent transactions that my checking account has been involved in. I look at this multiple days per day to make sure that my account is safe, and that no unwanted charges have been charged using my account. Cyber security is a major concern these days, and I have had charges to my account in the past that I did not authorize. Thankfully, I used this app to stay notified of these charges and was able to put a stop to it immediately, and get all the charges refunded right away. I was also able to change my checking account number and password so that it would not happen again by the same people. Another way that I use this app is to see exactly how much money I have coming in and going out every month. This allows me to make a proper budget for the year.", "scenario_id": "MAS-R-5", "risks": [["43", "51", 4.0], ["88", "100", 4.0], ["109", "125", 4.0], ["244", "251", 4.0], ["288", "302", 4.0], ["363", "370", 4.0], ["591", "614", 4.0], ["619", "627", 4.0], ["732", "789", 4.0], ["823", "829", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.wellbeing", "usage_freq": "daily", "text": "I use this screen in general to help me keep track of my screen time. Like most people, I tend to overuse my phone during the day for reasons outside of work and I have sought out to change this habit. This app and specifically this feature of the app has helped me a a huge way in terms of keeping this in check. I sent it for just over 3 hrs but lately have been staying far under this. The app has allowed me to be more mindful of device time in general and also substantially cut down on the amount of time I use my device. Without this app I would have never thought about doing this or even felt the need. It has helped me in terms of sleep, overall mood, and general well-being in a way that is hard to put into words and I am very thankful for this to be available in the first place.", "scenario_id": "MAS-R-6", "risks": [["57", "68", 1.0], ["109", "114", 1.0], ["434", "445", 2.0], ["520", "526", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.lensa.app", "usage_freq": "weekly", "text": "I can click on the add photos button to add a bunch of my pics, or the pics of someone dear and near to me. It usually asks 10 pics, but one could add upto 20 pics. Then, we can select the genre of what we would like to see ourselves to be, from the point of view of the AI. There are multiple genres to choose from, like fantasy, ancient, sci fi, so on and so forth. Once we select the genres that we want, there is a 5 genre limit in the app, we click on the done button, which would lead to the screen that would say to wait for a while for the AI to finish the processing. Once the process is complete, we would be shown a bunch of pics, 50 to be precise, from those genres we selected, imagining us to be in that scenario.", "scenario_id": "MAS-R-7", "risks": [["23", "29", 2.0], ["127", "131", 2.0], ["189", "194", 1.0], ["294", "300", 2.0], ["421", "432", 2.0], ["548", "550", 1.0], ["718", "726", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/pok%C3%A9mon-go/id1094591345/", "usage_freq": "weekly", "text": "To get information on a specific Pokémon, I would tap the Pokeball. Then, I would navigate to Pokemon, then click on the Pokemon I am interested in. On this screen, I have many useful options. First, I can see if the Pokemon can evolve to become better so I can use it to battle. I have the option to also transfer the pokemon to gain more candy to evolve similar Pokemon.  I can also check the pokemon's stars to if the Pokemon is of high quality and worthy of keeping. I can also check Pokemon to see where I caught them as a reminder of all the places I have been. For this, the app must track my location in order to let me know what area I was in when I caught the Pokemon. On this page, I can also offer a trade to my friends, which means the app would need access to my contacts. ", "scenario_id": "MAS-R-8", "risks": [["33", "40", 0.0], ["225", "252", "N"], ["319", "326", 0.0], ["340", "363", 0.0], ["405", "410", 1.0], ["503", "522", 3.0], ["540", "554", 3.0], ["555", "566", 3.0], ["600", "608", 3.0], ["670", "677", 0.0], ["724", "731", 4.0], ["777", "785", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.discord", "usage_freq": "daily", "text": "To open this screen, I have to log in to the app first. Then I have to click on the icon of the person waving on the bottom navigation bar. I use the friends screen to see which of my friends are online. When they are online, there is a green light next to their name. When they are idle, there is a half moon next to their name. When they are completely offline, there is a grey button next to their names. Then I can reach out to them using a direct message or chat with them on a server that we are both a member of. I can click on their name and see which mutual servers we are currently a member of. I can also use this screen to add new friends by searching for their usernames or phone number. I can also use this screen to remove friends. The app knows my list of friends and uses that information to populate this screen.", "scenario_id": "MAS-R-9", "risks": [["184", "191", 4.0], ["401", "406", 4.0], ["483", "489", 5.0], ["541", "545", 4.0], ["567", "574", 5.0], ["575", "600", 5.0], ["674", "683", 4.0], ["687", "699", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=tv.twitch.android.app", "usage_freq": "daily", "text": "I can talk to the streamer and the other people watching the stream with this chat. I can use emotes that Twitch provide you, or I can use emotes specific to the streamer if I decide to subscribe to the streamer. On desktop, I can download an extension that provides even more emotes that I can use. Chatters cannot see those emotes unless they also have the extension installed. If I ever get banned from the chat, my phone number will be permanently banned, and I'd have to create a new account in order to chat again. Twitch tracks how often people are active in each streamer's chats. They use such data to determine which ads to show non-subscribers. If you subscribe to a streamer, you also don't have to deal with video ads that play over the stream. The ads sometimes have links that you can click on which redirects you to another site.", "part2_false_pos1": "1", "scenario_id": "MAS-R-10", "risks": [["41", "47", 4.0], ["61", "67", 0.0], ["94", "100", 0.0], ["162", "170", 0.0], ["243", "252", 3.0], ["410", "414", 4.0], ["419", "431", 2.0], ["489", "496", 4.0], ["535", "587", 0.0], ["603", "607", 4.0], ["621", "654", 4.0], ["721", "730", 4.0], ["762", "765", 4.0], ["781", "786", "N"], ["840", "844", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/xbox-game-pass/id1374542474", "usage_freq": "weekly", "text": "I performed a search for classics only. By doing this I let the app know I am looking for classic games. A classic game is any game around ten years or older. I simply hit the search bar up top and chose one of the categories listed. A simpler way it could've been done is me just typing the name in the search bar instead. The App realizes that I searched for this genre, and is more likely to recommend these older games to me rather than the new ones whenever I am looking for a game to download on my Xbox directly from the app. The app uses this information to recommend me similar games in the future. I am highly likely to be recommended classics or games that I specifically search for using the search feature in the app. This makes it more likely I am going to play a game they recommend rather than ignore it.", "scenario_id": "MAS-R-11", "risks": [["127", "131", 0.0], ["215", "225", 1.0], ["292", "296", 2.0], ["304", "314", 1.0], ["366", "371", 1.0], ["417", "422", 0.0], ["645", "653", 1.0], ["704", "718", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=co.bytemark.riptawave", "usage_freq": "weekly", "text": "I use this screen to manage my payment methods for the bus. Sometimes I use my card, sometimes paypal. Money is often tight so I have to micromanage where the bus takes it out form. I don't use the bus enough for a pass, so it's all out of pocket. The app automatically draws from my preferred payment method here to pay for my fares. I use the trash can icon to delete payment methods when I cannot draw money from that account (and it's a safety precaution in case my phone is lost or stolen). Overall, the app does a good job managing my payments to help me achieve my goals. It's secure enough to where I feel comfortable using it, and I haven't run into any issues with identity or card info theft or anything of the sorts. You know - stuff that would cause me to delete the app instantly and pay bus fares with cash again!", "scenario_id": "MAS-R-12", "risks": [["79", "83", 2.0], ["103", "108", 2.0], ["198", "201", "N"], ["215", "219", "N"], ["294", "308", 2.0], ["328", "333", 0.0], ["370", "385", 2.0], ["405", "410", 2.0], ["421", "428", 2.0], ["541", "549", 2.0], ["675", "683", 3.0], ["687", "702", "N"], ["802", "811", "N"], ["817", "821", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/vivint/id734547946", "usage_freq": "daily", "text": "I use this screen more than 5 times a day. The app helps connect to my house alarm system to arm or disarm the system. It’s a feature makes life easier without needing to know if my house is secure or not secure. My goal is to make sure that I have the peace of mind that my house is secure from anyone or anything. The information that is used by the app is my address, name and birthdate to verify I am who I am. The app uses a lot of personal data but the data used is to verify who I am to make sure no one else can access my home. I feel that this is very necessary to a safe and efficient company. The app however can be accessed if my phone is unlocked Wich could compromise private information or give people scenarios to my home! ", "scenario_id": "MAS-R-13", "risks": [["71", "89", 3.0], ["176", "211", 2.0], ["275", "280", 2.0], ["362", "369", 4.0], ["371", "375", 3.0], ["380", "389", 3.0], ["405", "413", 2.0], ["437", "450", 3.0], ["530", "534", 1.0], ["682", "701", 3.0], ["717", "726", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instagram.android", "usage_freq": "daily", "text": "Well I wouldn't really use this screen for much. These settings act as the profile information to my instagram account. I usually use it whenever I want to change some personal information. For example, if I get a new email address then I would go to this page to update it. I would also change my phone number if I felt it was important for instagram to have that information. More general, I use the account history/personal information page to change aspects of my account that are about me. My name, username, privacy habits, etc are all located there. It also shows me my account history and general instagram usage information. I find this incredibly important for updating personal information and making it private if necessary. For me the less information I give the better. This goes not only for my friends on instagram but includes information given to the instagram platform itself. ", "scenario_id": "MAS-R-14", "risks": [["55", "63", 3.0], ["75", "94", 4.0], ["101", "118", 5.0], ["218", "231", 1.0], ["298", "310", 4.0], ["454", "461", "N"], ["468", "475", 4.0], ["481", "493", 3.0], ["498", "502", 4.0], ["504", "512", 5.0], ["514", "528", 2.0], ["577", "592", 5.0], ["605", "632", 5.0], ["680", "700", 5.0], ["810", "817", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=tv.twitch.android.app", "usage_freq": "weekly", "text": "This screens offers information about rewards and kickbacks I have earned over time by using twitch while connected to my Amazon Prime account. There are also direct look special by Amazon Prime itself as a kickback from Amazon Prime for connect it to Twitch. So you get kickbacks from both Amazon Prime itself, and Twitch, by connecting the two , while watching streamers. These kickbacks are typically directly related to the games those streamers are playing and you are obviously interested in. In game perks like premium time, free items, bonuses and boosters. You also get one free subscription to a streamer as a gift from Amazon Prime. So there is a lot of incentive to connect them and make full use of your viewing time within Twitch. Something most gamers do anyway out of curiosity and interest of the game they themselves are playing. Can also win giveaway through the streamer but I do not believe those are directly tied to Amazon.", "part2_false_pos1": "1", "scenario_id": "MAS-R-15", "risks": [["20", "31", 1.0], ["38", "45", 0.0], ["122", "142", 5.0], ["271", "280", 0.0], ["363", "372", 0.0], ["428", "433", 0.0], ["518", "530", 1.0], ["532", "542", 0.0], ["544", "551", 0.0], ["556", "564", 0.0], ["588", "600", 5.0], ["717", "729", 1.0], ["814", "818", 0.0], ["861", "869", 0.0], ["882", "890", 0.0], ["939", "945", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.paidtasks", "usage_freq": "weekly", "text": "After making a shopping trip to a location, you are then given the choice to verify you went to the location, and upload a receipt of some kind if you choose. You can choose from telling the app that it is mistaken and you did not visit the location; you visited but did not purchase anything; you made a purchase but do not have a receipt; you only have a digital copy of the receipt; skip the task altogether; or upload a copy of the receipt by taking a photo of it. After you take a photo, the app will upload a copy of it, and verify the information listed on the receipt. It will then save the date you went to the location and the total you spent at the location, and will reward you by giving you a payment in the form of a Google Play Balance, which can later be spent on digital purchases.", "scenario_id": "MAS-R-16", "risks": [["305", "313", 0.0], ["424", "428", 2.0], ["456", "461", 1.0], ["568", "575", 2.0], ["599", "603", 1.0], ["660", "668", 1.0], ["706", "713", 2.0], ["780", "797", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/homehawk/id1324939168", "usage_freq": "daily", "text": "I use this screen when I want to check out what my security camera has captured throughout the course of a day. The main goal I want to achieve is to filter out the videos that don't contain people in them. Another goal of this screen is to see the latest video that was captured in case I heard something I wasn't expecting. Lastly, I use this screen to keep track of my mail and package deliveries. There are a lot of thieves that like to steal packages and this screen helps me see my package before they do. I use this screen by tapping on the bubble that says \"Person\" which filters the list to only show videos with people detected in them. The information used by the app is the recordings it takes. Those recordings show up on this screen and I can view them from the list.", "scenario_id": "MAS-R-17", "risks": [["43", "110", 4.0], ["183", "200", 4.0], ["256", "261", 4.0], ["372", "376", 5.0], ["381", "399", 5.0], ["420", "427", 1.0], ["447", "455", 5.0], ["488", "495", 5.0], ["592", "596", 3.0], ["610", "616", 4.0], ["622", "628", 3.0], ["629", "645", "N"], ["713", "723", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/venmo/id351727428", "usage_freq": "daily", "text": "Every day I have to use Venmo as a payment provider for things that I sell online off various websites. The Venmo application assists me in providing several payment options for buyers that are interested in my products. The best part of Venmo is how quick I am able to withdraw funds through \"instant\" pay, with a small percentage fee tacked on, or through a no charge withdrawal to my bank account within three business days. Due to how low the fees are, I typically use the instant pay option as it pays out instantly force posting to my account. It can even be sent straight to my bank account as well within the three business days for free which is perfect. It's wonderful because not only can I use it with my debit card but I can also have it on my Venmo card in case I ever am out wanting to spend money without having to transfer. ", "part2_false_pos8": "1", "scenario_id": "MAS-R-18", "risks": [["35", "51", 1.0], ["158", "173", 0.0], ["178", "184", 1.0], ["211", "219", 0.0], ["279", "284", 0.0], ["303", "306", 0.0], ["387", "399", 0.0], ["489", "495", 0.0], ["541", "548", 0.0], ["623", "631", "N"], ["717", "727", 0.0], ["763", "767", 0.0], ["807", "812", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/shop-all-your-favorite-brands/id1223471316", "usage_freq": "daily", "text": "I shop online daily and often and use several different apps to buy. This screen is helpful it shows all incoming orders I have in one screen instead of me having to go into each app to track different deliveries. It logs into my email address to track when I get emails for shipping notifications from all of my different apps - such as Poshmark, eBay and Mercari. If a photo is available, it will also include that on the left side of each order so I'm not confused what is in that order. I can also have it connect to my Amazon account and it can track all the orders from there. I can get notifications on status updates and estimated delivery dates. This screen will also update once the package is delivered. It can be helpful when a package is getting delayed when I would otherwise probably not know without going to the specific app. ", "part2_false_pos5": "1", "scenario_id": "MAS-R-19", "risks": [["114", "120", 4.0], ["202", "212", 3.0], ["230", "243", 4.0], ["264", "270", 4.0], ["284", "297", 4.0], ["323", "327", "N"], ["338", "346", 2.0], ["348", "352", 2.0], ["357", "364", 2.0], ["371", "376", "N"], ["442", "447", 3.0], ["524", "538", 4.0], ["610", "624", 2.0], ["639", "653", 2.0], ["693", "700", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.topstep.fitcloudpro", "usage_freq": "daily", "text": "The goals here are to keep a low heart rate. I have a problem with my thyroid which gives me a higher than normal heart rate and this tells me about the average on each day. I check it more than daily to make sure I am not much higher than normal and usually in a 90-105bpm range so I don't need to contact my doctor. The information here is taken a few times a day and averaged to give that number shown per day. That being said, I check this daily and usually a few times a day to see what my heart rate is and if I need to do less strenuous things and relax or if I am ok to keep on working on what I am doing at that point in time. It is very helpful to have something like this tied to my watch where I can get a read out pretty much anytime I want to get my vitals looked at and not have to go to a doctor or anywhere like that. ", "scenario_id": "MAS-R-20", "risks": [["33", "43", 2.0], ["70", "77", 2.0], ["310", "316", 3.0], ["392", "398", "N"], ["764", "770", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.usatoday.android.news", "usage_freq": "daily", "text": "I use this page to see what the top stories are around the country and world. I generally stick to this screen and expect it to provide me with the most up to date and important events that are currently happening. I generally scroll through the first few pages of news stories to see what important things are happening. There are paid subscriber stories that pop up, and I am not a paid subscriber. Although some of them look interesting, I am not going to pay for free news I can obtain from any other websites. My goals are generally to keep up to date on important topics and news. I want to be aware of what is happening around the world. The information the app collects from me to support this screen is generally the information it takes to give me targeted advertising, I suppose. However it does collect location data that can help with weather information and stories localized to the area I am in. ", "part2_false_pos1": "1", "scenario_id": "MAS-R-21", "risks": [["23", "76", 1.0], ["153", "213", "N"], ["265", "277", "N"], ["285", "320", "N"], ["337", "347", 2.0], ["348", "355", "N"], ["570", "576", "N"], ["581", "585", "N"], ["617", "626", "N"], ["767", "778", 2.0], ["815", "828", 2.0], ["848", "867", 2.0], ["880", "903", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.miHoYo.GenshinImpact", "usage_freq": "daily", "text": "I use this screen to buy in game currency using my personal credit card information. I use this currency to buy wishes to get characters in game and progress further. The app requires my personal credit card information to do this. Buying this currency help me progress in the game and a get the items and characters that I want. I have bought each of the following packs at least once. I have bought the 0.99 one, the 4.99 one, the 14.99 one, the 25.99 one, and the 49.99 one. I don't know if I will buy anymore packs in the future since I made this purchase just to get started in this game. This app does not require a lot of personal infoamtion aside from payment if you wish to ever buy anything from the shop. I love the privacy and attention to detail of this app. I think more apps should respect my privacy.", "scenario_id": "MAS-R-22", "risks": [["28", "41", 1.0], ["51", "83", 2.0], ["96", "104", 2.0], ["112", "118", 1.0], ["140", "144", 1.0], ["296", "301", 1.0], ["306", "316", 1.0], ["366", "371", 1.0], ["629", "648", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/love-nikki-dress-up-queen/id1214763767", "usage_freq": "daily", "text": "This screen is where you recharge the currency used in the game for almost everything. You need diamonds to buy parts to make suits. The suits are then used to battle other players on the north american server. The server resets to give you a double order of diamonds for the same price, every 3-4 months. You also get V points, 1 per diamond normally. These accumulate into levels. I'm level 12. I believe you need to spend about $6000-$8000 in total on the game to get every level unlocked, but that is not factoring in that sometimes you get offered more V points than normal. I would like to be able to afford the largest $99 package since you do get an achievement for it, but I never have that much to spend on a game. I do the little spends over time, a few dollars here or there when I really want to buy an outfit, or beat an event that only comes around once a year. To buy from the app, it needs to know your apple ID, and login so that you can charge your apple account. It gets from apple, my name, address, but at least no credit card information. I hate giving out my credit card info, since it has been stolen too many times. In the box you'd be able to see how much I have spent on the game, along with my ID that you could use to band me from the game, or reward me, I feel unsure about giving it out, but you have to on the game's facebook page to get the rewards offered. It's also been pointed out to me that I should not fund or trust the game since it is from China, and you don't know what you're funding by feeding your game addiction. ", "scenario_id": "MAS-R-23", "risks": [["38", "46", 1.0], ["59", "63", 3.0], ["96", "104", 4.0], ["112", "117", 4.0], ["126", "131", 4.0], ["173", "180", 4.0], ["319", "327", 5.0], ["375", "381", 1.0], ["477", "482", 1.0], ["658", "669", 1.0], ["816", "822", 1.0], ["835", "840", 1.0], ["920", "928", 4.0], ["968", "981", 5.0], ["996", "1001", 4.0], ["1006", "1010", 3.0], ["1012", "1019", 5.0], ["1037", "1060", 5.0], ["1083", "1099", 5.0], ["1223", "1225", 3.0], ["1375", "1382", 0.0], ["1483", "1488", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.cozi.androidfree", "usage_freq": "weekly", "text": "With this app (and this screen) myself and my partner try and organize what items we need from various stores. Since not all the stores are always near us, we have multiple lists set up for simple excursions to the local stores and then other lists like bulk buy stores or specialty stores that are much further away. In interacting with this screen, I am able to put in items we need or want to look at the next time we are at one of the listed stores (granted there are other stores in the list below what is shown). With this, it helps us to remember what we need to get and not just buy off the cuff and wind up getting either things we don't need or forget to get things we actually do. It is VERY helpful in this regard as there have been many times that we have forgot things in the past or bought the wrong thing (ie baking soda instead of baking powder) on accident thinking we need one thing but actually needed another. The information used here is really rather simple. You can make a category and then fill in what you need or want in each category. This is just shopping, but the app also does things like appointments, a short to do list daily, and you can input many other things you need to remember and get alerts for.", "scenario_id": "MAS-R-24", "risks": [["76", "81", 1.0], ["129", "135", 1.0], ["243", "248", "N"], ["273", "289", 1.0], ["997", "1005", "N"], ["1120", "1132", 2.0], ["1225", "1231", "N"]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "I use this screen to keep track of what my daily activity is like.  I use it to see where I am for the day and to see if I need to get some extra activity going.  I use this screen to view my calories burned, see how active I have been, how many steps I have done so far.  I also like to use it when I go for longer walks because I like to get a certain amount of steps in for the day.  The app uses my health information like exercises and walks to show me how it equates to calories burned and such.  It also shows me where I need to improve and where I am lacking.  It helps me achieve my health goals by showing everything in one spot where I can get an overview of my activity for each day and adjust when needed.", "scenario_id": "MAS-R-25", "risks": [["35", "65", 1.0], ["84", "106", 4.0], ["118", "160", "N"], ["213", "235", 1.0], ["237", "270", 0.0], ["364", "369", 0.0], ["403", "421", 3.0], ["427", "436", 1.0], ["441", "446", 1.0], ["458", "475", "N"], ["476", "484", 3.0], ["520", "543", "N"], ["548", "566", "N"], ["592", "604", 3.0], ["673", "681", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.cfdrink", "usage_freq": "monthly", "text": "This screen helps you to organize all of the ingredients you have in your liquor cabinet, pantry, and fridge in order to maximize the amount of recipes you can make for cocktails and other drinks. In particular, this is sorting by most recently added ingredients, but they can also be displayed and sorted in other ways, as well, you can add other ingredients to your list through here. You can also remove ingredients one at a time (or all together with a single button press) once they are used or no longer available, and can search for different ingredients you own, or would like to add. You can also navigate from this page to the page that shows a virtual display of your cabinet, or to the page that lists recipes you can make with your ingredients (or can almost make if you gain one or two more for that particular drink). ", "scenario_id": "MAS-R-26", "risks": [["74", "88", 1.0], ["144", "151", 0.0], ["165", "178", 1.0], ["189", "195", 1.0], ["550", "561", 2.0], ["679", "686", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "This is the Heart Rate Daily Highlight Screen on my app.  This tracks my heart rate during my most recent work out. In an effort to describe the goals I want to achieve through this screen, I would say that I want to hit a certain average heart rate during my various work outs and I want to make sure that I am staying in that range and truly hitting my heart rate goals when I do a work out.  In turn, this screen helps me to see what my heart rate was during my work out in order to let me know that I was working hard enough.  My interactions with this screen in order to achieve this goal, is i use it after I work out and look at how my heart rate looked throughout the process.  THe information that is used by the app to support this screen is my biometric data, more specifically my heart rate.", "part2_false_pos1": "1", "scenario_id": "MAS-R-27", "risks": [["12", "22", 0.0], ["106", "114", 0.0], ["268", "277", 0.0], ["355", "371", 0.0], ["432", "473", 0.0], ["643", "653", 0.0], ["755", "769", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.twitter.android", "usage_freq": "daily", "text": "I use this screen when I am wanting to catch on what a particular person has tweeted. My entire feed can become a lot and be a lot to go through. When I want to catch up with a certain person or an issue they tweet about I will go to someone's profile page. I can then look at their tweets or their tweets and replies. Sometimes I realize I haven't seen a friend for a bit so I can see if they have been active lately. I might also look at that person's likes to see if they have been active and are alright. Once in a while, I will want to refer to something I remember someone posting. On this page, I can search by terms to try to locate an old tweet for a particular person. This screen will also show other people Twitter suggests I follow based on people I am already interested in.", "scenario_id": "MAS-R-28", "risks": [["48", "84", 4.0], ["96", "100", 3.0], ["198", "214", 4.0], ["244", "251", 3.0], ["299", "305", 3.0], ["356", "362", 4.0], ["560", "578", "N"], ["618", "623", 2.0], ["648", "653", 2.0], ["671", "677", 3.0], ["712", "718", 3.0], ["754", "787", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.fidelity.android", "usage_freq": "weekly", "text": "I use this screen to access and trade my dumb a** investments. From here I get a list from which I can keep an eye on each position, as well as an easy link to be able to sell them or buy more. By clicking on the green button indicating their value, I can also bring up more information regarding the position, and choose to display one of those instead. The default is the last price. But other options include the day's change, the current value, the gain or loss in total or for today. By using the tabs at the top, I can access stock watch lists I have created, as well as live market information including futures. The screen uses my investments and the money I have available on my account. I am especially uncomfortable showing my positions because I know institutions keep an eye on what people invest in in order to tank them.", "scenario_id": "MAS-R-29", "risks": [["81", "85", 3.0], ["243", "248", 3.0], ["301", "309", 4.0], ["379", "384", 3.0], ["453", "487", 4.0], ["532", "549", 2.0], ["582", "600", 2.0], ["611", "618", 1.0], ["639", "650", 4.0], ["659", "664", 4.0], ["688", "695", "N"], ["738", "747", 4.0], ["796", "809", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.chickfila.cfaflagship", "usage_freq": "weekly", "text": "This screen shows me how many points I have available to use, the items that I can redeem with those points, and how many points are required for each item. I like to redeem some rewards on each visit so that I can keep my costs down. It makes me happy to know that I have saved some money! I usually just look at how many points I have and then scroll through the screen to see if I have enough points for any of the items that I am planning on purchasing that day. I try to figure out which item is a better deal or will save me the most money with the least amount of points. To support this screen, the app knows my user information, my past purchase history, and my points redemption history. Also, my current points information is needed to show me what items I can redeem or not.", "scenario_id": "MAS-R-30", "risks": [["21", "60", 4.0], ["101", "107", 4.0], ["113", "155", 4.0], ["179", "186", 4.0], ["223", "228", 5.0], ["284", "289", 4.0], ["314", "336", 4.0], ["418", "423", 3.0], ["493", "497", 3.0], ["510", "514", 1.0], ["620", "636", 5.0], ["641", "662", 5.0], ["671", "696", 4.0], ["715", "733", 4.0], ["755", "785", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.fliff.fapp", "usage_freq": "daily", "text": "This screen is used so you can look over all of the different details that are tied to your account. It is useful because as people use the app they sometimes forget just how much info they have given it and this is a good reminder along with being easy to find. besides that you can also very easily get to this screen and change any info in the app. If for some reason i have moved or i want to add another address i can very easily do that with a tap and then also typing. Or if i decide one day that i want to delete my info or get a better idea of what the app has then i can go one screen back and request all info tied to my account be deleted. Everything is very simply changed on this screen with a bit of typing and tapping and i can also go back to other screens to get a more thorough look at my personal info and change it too.", "scenario_id": "MAS-R-31", "risks": [["62", "69", "N"], ["175", "184", "N"], ["409", "416", 2.0], ["524", "528", "N"], ["553", "569", "N"], ["632", "639", 2.0], ["808", "821", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/calorie-counter-mynetdiary/id287529757", "usage_freq": "weekly", "text": "On this screen, you can do many different things. First, each day you log your weight to give the app a recent update on how tracking your calories has gone. On this screen, you can also look at your weight history over time to see if you have made progress toward your goal and how much progress you have made. You can also scroll down to compare different weeks and see a forecast of your weight loss to see if you are staying on track and are expected to hit your goal. In order to do this, you must constantly enter your weight and give your current weight goal. The app also needs you to input your daily calorie total to ensure you are eating correctly to achieve your goal. One other thing this app needs is your height as it tracks your BMI based on your height and weight ratio. ", "scenario_id": "MAS-R-32", "risks": [["121", "156", 2.0], ["200", "214", 4.0], ["232", "274", 2.0], ["279", "310", 2.0], ["374", "382", "N"], ["391", "402", 3.0], ["467", "471", 2.0], ["525", "531", 3.0], ["554", "565", 3.0], ["610", "623", 3.0], ["720", "726", 3.0], ["745", "748", 3.0], ["774", "786", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/reddit/id1064216828", "usage_freq": "weekly", "text": "With this app, I mainly search passively for information that pertain to my interest based on the subreddit. As an example, the bmw subreddit is a sub of reddit that I frequently view. With this screen, posts are given in a sequential order based on current community engagement and interest of a specific post. Each post has a photo and also an indication of engagement by the number of comments associated with the post and the number of upvotes which signify popularity. Overall the forum gives one a way to learn about the topic without searching for a specific interest in the topic to learn about. The information that is used by the app to support the screen doesn't necessarily depend on the user as I use this app while logged out. However the app can pull data from the user in order to create the order in which the posts are given in real time.", "scenario_id": "MAS-R-33", "risks": [["76", "84", 1.0], ["98", "107", 1.0], ["154", "160", 1.0], ["258", "278", 1.0], ["328", "333", 1.0], ["360", "370", 1.0], ["378", "387", "N"], ["388", "396", 1.0], ["417", "421", 1.0], ["440", "447", 1.0], ["462", "472", 1.0], ["486", "491", 1.0], ["527", "532", 1.0], ["780", "784", 4.0], ["827", "832", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "This is the activity summary page on my apple health application on my iphone.  In an effort to describe the goals I want to achieve through the screen, I would state that I use this screen to get an overview of what my activity and movement trends have been over varying lengths of time.  In this particular screen shot, the duration of time depicted is one week.  My goal is to move a certain amount each day over the course of a month or week My interactions with this screen to acheive my goals is that I use it to track my progress and make sure that I am staying on track and staying active with workouts each day.  The information used by the app to support this screen includes several things including biometric data such as heart rate, my work outs and activities, and my logged excersizes that are not caught with biometric data.", "part2_false_pos1": "1", "part2_false_pos2": "1", "part2_false_pos3": "1", "part2_false_pos4": "1", "part2_false_pos5": "1", "part2_false_pos6": "1", "part2_false_pos7": "1", "part2_false_pos8": "1", "part2_false_pos9": "1", "part2_false_pos10": "1", "scenario_id": "MAS-R-34", "risks": [["12", "28", 1.0], ["212", "279", 1.0], ["283", "287", 1.0], ["528", "536", 1.0], ["602", "610", 1.0], ["711", "725", 1.0], ["734", "744", 1.0], ["749", "758", 1.0], ["763", "773", 1.0], ["782", "799", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/paceline-rewards-for-exercise/id1491824216", "usage_freq": "weekly", "text": "The goals that I wish to achieve through this screen are to exercise at least 150 minutes a week and at least 5 days out of the week.  This screen in the screen shot shows my progress in meetiing this goal.  I use this screen and interact with it so that I can track my progress and understand what I have done to meet my ultimate goals at this point within the week. I check it to make sure that I am making steady progress towards the direction of my ultimate weekly goal.  The information that is used by the app to support this screen would include my workouts, my biometric data (such as my heart rate), my activity, my number of steps, my type of work out and my personal information such as date of birth, height, weight, and gender that I identify as.  It is helpful", "part2_false_pos11": "1", "scenario_id": "MAS-R-35", "risks": [["270", "278", 2.0], ["294", "310", 2.0], ["314", "336", 2.0], ["556", "564", 2.0], ["569", "583", 2.0], ["596", "606", 2.0], ["612", "620", 2.0], ["625", "640", 2.0], ["645", "661", 2.0], ["669", "689", 2.0], ["698", "702", 2.0], ["713", "719", 2.0], ["721", "727", 2.0], ["733", "739", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/frost-bank/id605494138", "usage_freq": "weekly", "text": "I use this screen to look through my recent transactions and track my spending. I've recently had a lot of impulsive purchases, and the tools provided allow me to see just how much I'm spending instead of hiding it. Money can be hard to manage, and when it comes to tracking just how much you're really spending, it's easy to hide and justify purchases in the moment, but here it's all laid out for you; no frills or sugar coating it. I open the app, enter my passcode, and it takes me to this screen. Once I reach it, I can scroll down and view details of my recent purchases. Money is rather important to me, and I try my best to spend it wisely. It takes my financial information from the cards and bank account I use and logs the transactions in an easy to navigate, cleanly organized personal ledger.", "scenario_id": "MAS-R-36", "risks": [["70", "78", 4.0], ["172", "193", 3.0], ["280", "311", 3.0], ["460", "468", 5.0], ["546", "553", 2.0], ["567", "576", 4.0], ["578", "583", 4.0], ["661", "682", 4.0], ["692", "697", 4.0], ["702", "714", 5.0], ["734", "746", 4.0], ["789", "804", "N"]]}, {"app_url": "https://apps.apple.com/us/app/govee-home/id1395696823", "usage_freq": "daily", "text": "This is where i go to when i want to shutdown or put on my devices. Most of them are set on automatic but sometimes i want to turn them off and on manually depending ifi  am at home or leaving the house. Its well laid out and is grouped in a way that i don't have to go through a bunch of screens to get to the right device i want to control. The screen is very intuitive and lets me choose between devices very easily and fluid. Sometimes but rarely do i need to switch from this screen and if i do its mostly to like change the color or something that my lamps and bulbs would fit with the ambience i want to experience. Sometimes on this screen i disable items that i don't think i would be using for a very long time  on end.  ", "scenario_id": "MAS-R-37", "risks": [["59", "66", 2.0], ["317", "323", 2.0], ["530", "535", 1.0], ["658", "663", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/pok%C3%A9mon-go/id1094591345", "usage_freq": "daily", "text": "To log my health benefits for the current day, I open the app and choose my profile page. Next, I tap on the ME tab under my profile page. The app can collect the movement and data from the health app of my phone. The app also uses my location to track distance. I can also keep track of how many steps and calories burned in a week. Also, the app shows my most recent walks, runs, and rides under the WEEKLY PROGRESS section. This page also keeps track of different in game rewards for hitting distance goals for 5km, 25km, and 50km each week. I can see  different landmarks, counties, cities, and towns visited with badges under the Medals section. I can view present level and advancement to the next level. I can tap to find out if any chores are needed to advance levels. I'm able to view every Pokémon I've ever designated as my buddy, tap. This page shows recent activities, including Pokémon I've captured and victories in battles. I can modify the appearance and attire of my avatar. Overall Activity for the course of my account's existence.", "scenario_id": "MAS-R-38", "risks": [["10", "25", 3.0], ["125", "132", 4.0], ["163", "171", 3.0], ["176", "180", 3.0], ["235", "243", 4.0], ["253", "261", 3.0], ["288", "332", 2.0], ["369", "374", 2.0], ["470", "482", "N"], ["495", "509", "N"], ["566", "575", 3.0], ["577", "585", 3.0], ["587", "593", 3.0], ["599", "604", 3.0], ["618", "624", "N"], ["635", "641", "N"], ["680", "691", "N"], ["704", "709", "N"], ["733", "775", "N"], ["835", "840", "N"], ["870", "880", "N"], ["892", "899", "N"], ["957", "967", "N"], ["972", "978", "N"], ["985", "991", "N"], ["1001", "1009", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.fitness", "usage_freq": "daily", "text": "Google Fit is an app designed to help people reach their fitness goals. It allows users to track their daily physical activity, such as walking, running, cycling, and swimming, as well as record their weight and calorie intake. Through the app, users can set goals for themselves, monitor their progress, and receive personalized advice and insights to help them reach their goals.  To use the app, users first need to enter their personal information and activity goals. Then they can start tracking their progress by logging their activities, calories burned, and other relevant data. Additionally, Google Fit allows users to connect with third-party apps and devices, such as Fitbit and Strava, to receive real-time updates on their progress.  Google Fit uses data collected from users’ activities, like steps taken and calories burned, to create personalized insights and advice based on their fitness level, activity goals, and physical condition. This data is then used to generate personalized fitness plans tailored to the user’s individual needs. The app also features a dynamic home screen that allows users to quickly view their progress and upcoming activities.", "scenario_id": "MAS-R-39", "risks": [["57", "70", 1.0], ["109", "126", 2.0], ["201", "207", 1.0], ["220", "226", 2.0], ["330", "336", 2.0], ["341", "349", 2.0], ["375", "380", 0.0], ["431", "451", 3.0], ["533", "543", 0.0], ["545", "553", 1.0], ["662", "669", 2.0], ["736", "744", 1.0], ["763", "767", 2.0], ["783", "788", 2.0], ["807", "812", 1.0], ["850", "871", 2.0], ["898", "911", 0.0], ["913", "927", 1.0], ["933", "951", 1.0], ["1001", "1014", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/qmee-paid-surveys-for-cash/id1107954624", "usage_freq": "weekly", "text": "Qmee is an app where you can do surveys for money. This screen is an optional way to add \"filters\" to the surveys. If I input personal information in this screen, the app will automatically add it into the surveys I take and auto-qualify or deny me from a survey so I don't have to keep adding the information in myself. For example, a survey may want males that are 20-30 years old. And since I don't meet that demographic, it would automatically close the survey for me and I don't waste time filling out all my information into that survey. \r\n\r\nThis area of the app you're able to add in basic information like birthday, gender, religion. But it also goes more in depth, with 12 other sub-sections. For example, home area asks about how many people live in my home, household income, pets, renting/owning status, etc. There are broad questions such as \"What is your employer's industry?\" all the way to more in depth questions like \"Do you own a motorcycle?\" You're giving the app a lot of personal information, but it's designed to streamline the surveys you take.", "part2_false_pos9": "1", "scenario_id": "MAS-R-40", "risks": [["256", "262", "N"], ["614", "622", 0.0], ["624", "630", 0.0], ["632", "640", 0.0], ["736", "767", 1.0], ["769", "785", 1.0], ["787", "791", 0.0], ["793", "801", 1.0], ["801", "807", 1.0], ["808", "814", "N"], ["856", "888", 0.0], ["949", "959", 0.0], ["993", "1013", 2.0], ["1051", "1058", "N"]]}, {"app_url": "https://apps.apple.com/us/app/cash-app/id711923939", "usage_freq": "daily", "text": "I use this screen to gauge where I am in terms of my weekly buy and sell limits when using CashApp to buy or liquidate bitcoin holdings. CashApp has very competitive rates for bitcoin, and update instantaneously when the price of bitcoin shifts allowing me to get good fills on most of my buys and sells. Sometimes I use up to the buy limits to take advantage of arbitrage, and make a few percent off of just buying and holding for a few minutes before selling my recent buy. I do not always have cash available to spend in my bank account so I will sometimes sell small amounts of bitcoin that I have on the blockchain to pay for small expenses, or set aside a few thousand dollars worth of bitcoin when it is trending up to make a few percentage points whic ends up covering bills and expenses. Knowing where I am in terms of my limits ensures that I will not get stuck with more bitcoin than I am able to withdraw, which can lead to losses suffered if forced to hold for some days during a strong downtrend in price. This page updates with every bitcoin transaction, and resets once a week to give you the full limits again, so it is important that I visit this page before and after every bitcoin transaction. The app has to keep track of my transactions and the btc/usd conversion rate during the time of each transaction in order to be able to accurately report the limits. ", "scenario_id": "MAS-R-41", "risks": [["27", "37", 2.0], ["68", "79", 2.0], ["119", "135", 3.0], ["166", "171", 1.0], ["221", "226", 1.0], ["289", "293", 1.0], ["331", "341", 3.0], ["497", "501", 2.0], ["527", "539", 3.0], ["582", "589", 2.0], ["777", "782", 2.0], ["787", "795", 2.0], ["1049", "1068", 2.0], ["1246", "1258", 1.0], ["1315", "1326", 1.0], ["1372", "1378", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.venmo", "usage_freq": "yearly", "text": "I use this page to check on the status of my money and who I have paid.  From here I can navigate to my home page where I can see my payments and who has paid me.  I can see which banks and cards I have on file and which ones I want to use to pay people.  I can change or delete my bank account information here.  I can access my crypto payments here if I want to.  I use this page to manage what I want to do.  Sometimes I will delete credit card or bank account information that I do not want other people seeing.  I can control who I have as a friend here and I can either delete or add friends on to my account from this page.  I like to keep track of people here for payment purpose.  ", "scenario_id": "MAS-R-42", "risks": [["32", "38", 1.0], ["45", "50", 3.0], ["55", "70", 2.0], ["133", "141", 1.0], ["146", "161", 1.0], ["174", "210", 3.0], ["215", "253", 2.0], ["330", "345", 3.0], ["436", "447", 3.0], ["451", "475", 3.0], ["531", "553", 1.0], ["590", "597", 1.0], ["607", "614", 3.0], ["656", "662", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/timehop-memories-then-now/id569077959", "usage_freq": "weekly", "text": "This app allows me to see what I am doing every day for years. I want to see what I am doing on this day in pervious years. I would click into each interaction or post to see the details. I can also save and share this screen with others to create a community. This would allow me to engage with others around what I am doing on this day. Next i can click the buttons by scrolling down on the bottom that allow me to share. \r\nI see my twitter handle on top which is private. This shows what my twitter name and picture is - this could be something i do not want to share as it is a private account. I also see the date that it was originally posted and the link to the expecifc post. I can also go to the settings to control what accounts are linked ", "scenario_id": "MAS-R-43", "risks": [["26", "61", 2.0], ["77", "107", 3.0], ["117", "122", "N"], ["148", "159", "N"], ["250", "259", "N"], ["320", "337", 2.0], ["435", "449", 1.0], ["494", "501", "N"], ["502", "506", 1.0], ["511", "518", 4.0], ["590", "597", 2.0], ["614", "618", 2.0], ["678", "682", 2.0], ["725", "749", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.myfitnesspal.android", "usage_freq": "daily", "text": "In the beginning, I thought it was necessary for me to take a fitness class because I wanted to lose weight.So i want Gain my weight Install the app and SIGNUP my Account Use To every day scedule for gain my weight purpose log my lunch in the diary for the current day, I open the app and choose the Goal page. Next, I click on ADD FOOD in the Lunch section. The app can scan the meal or barcode to enter food items. Also, the app shows my most recent food items, meals, and recipes from the app history. I can choose an item from the app history or manually enter a new food item by clicking the Quick Add button.\r\nApp shows food calories i can easily achieve My goal was to gain my weight to expected kilograms. And get quickly gain my weight & physical healthy fitness. and easily access MYFITNESSPAL Application.", "scenario_id": "MAS-R-44", "risks": [["62", "75", 0.0], ["101", "107", 1.0], ["230", "235", 2.0], ["380", "384", 1.0], ["388", "395", 2.0], ["405", "415", 1.0], ["464", "469", 1.0], ["475", "482", 0.0], ["492", "503", 3.0], ["521", "525", 2.0], ["571", "580", 1.0], ["626", "639", 0.0], ["703", "712", 1.0], ["764", "771", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=imoblife.memorybooster.lite", "usage_freq": "daily", "text": "I can use this screen to determine how the resources within my phone is divided and used between various apps, at various times. I can pick and choose to start or force stop a particular app and i can choose to limit the RAM that is allocated to any app as i please. It helps me to optimize my device resource usage, especially the RAM and memory. I can clear apps if they are draining too much resources and i can choose to clear those chunks of data that is clogging up the memory that is available within my device. The most important benefit of this app is that it gives me real time data, which enables me to take real time decisions with regards to the apps that are running in the foreground and the background, and if i need to release a good amount of resources, i could do it.", "scenario_id": "MAS-R-45", "risks": [["63", "68", 3.0], ["105", "109", 2.0], ["221", "224", 1.0], ["250", "253", 1.0], ["294", "315", 1.0], ["340", "346", 1.0], ["395", "404", 1.0], ["447", "451", 1.0], ["511", "517", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.maps", "usage_freq": "monthly", "text": "When I'm accessing this screen, it's usually because I forgot to bring my GPS when traveling.  However, there have been some instances when my GPS was malfunctioning or otherwise not providing the ideal or preferred route for my destination.  In those cases, I open Google Maps.  This particular screen can be reached by opening the app, pressing \"Go\", and then the blue icon with an arrow.  Once on the screen, I simply enter my location and chosen destination and the app will provide directions.  From there, I just follow them step-by-step en route.  To my knowledge, the app uses my location to be able to allow for these directions.  I believe that it also records my app activity when using it.  The app may also be collecting App info and performance but I'm not entirely sure.  In any case, I have to allow for these permissions to get the directions.", "scenario_id": "MAS-R-46", "risks": [["74", "77", "N"], ["229", "240", 3.0], ["273", "277", 3.0], ["430", "438", 3.0], ["674", "686", 3.0], ["734", "742", 3.0], ["747", "758", "N"], ["826", "837", 2.0], ["849", "859", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.microsoft.teams", "usage_freq": "weekly", "text": "To set up and organize a team on teams, I navigate to the Teams tab from the Teams main menu. Next, I click the Create team button, this will start the process of creating a new team. I choose the team type; I can choose from an Existing Office 365 Group or a New team. I then enter the team name and description. Next I will need to go to privacy settings and choose from \"Private\" (only members can see the team and its content) or \"Public\" (anyone in the organization can see the team and its content). I will then Add team members. I can add members by searching for them in the Teams directory, or by entering their email addresses. Once you've entered all the required information and added team members, click the \"Create\" button to create the team. Your new team will now appear in the Teams tab and will be ready for use.", "part2_false_pos1": "1", "part2_false_pos2": "1", "part2_false_pos3": "1", "scenario_id": "MAS-R-47", "risks": [["25", "29", 0.0], ["33", "38", 0.0], ["58", "63", 0.0], ["197", "206", 3.0], ["249", "254", 4.0], ["287", "296", 4.0], ["301", "312", 1.0], ["340", "356", 5.0], ["422", "429", 4.0], ["522", "534", 5.0], ["546", "553", 5.0], ["621", "636", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.garmin.android.apps.connectmobile", "usage_freq": "daily", "text": "I use the screen to see my sleep data which is collected nightly. I wear my Garmin Instinct watch 24-hours a day, every day. My goal is to sleep at least 5-hours per day (or at a minimum, an amount that facilitates me staying alert throughout the day.) The data transmits via Bluetooth whenever I open the app on my phone. My sleep data is shown as a bar chart and breaks down the data into light sleep, deep sleep, and REM. I am able to view my data for 1-day as well as for a 7-day period. I am also able to access past data in perpetuity via the calendar built into the app. This allows me to track any trends in my sleep patterns and make lifestyle adjustments accordingly, e.g. I have found time and time again, if I drink caffeine from late afternoon onward, I am bound to have difficulty falling asleep and staying asleep. This graphical information makes my behavior patterns -- and their effects -- tangible without guessing.", "scenario_id": "MAS-R-48", "risks": [["326", "336", 2.0], ["351", "360", 2.0], ["397", "402", 2.0], ["446", "450", 2.0], ["549", "557", 2.0], ["606", "612", 2.0], ["619", "633", 2.0], ["643", "652", 2.0], ["728", "736", 1.0], ["866", "883", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.facebook.orca", "usage_freq": "weekly", "text": "I use this screen to do many things.  One of the things that I do here is choose if I want to display as active or not.  For the most part I do not like showing as active. The reason for this is I do not like people knowing whether or not I am on the app and actively using it.  Sometimes if this is the case then people I know will message me to start a conversation and I do not have time to do that but don't want to be rude.  So sometimes I find myself in a hard spot with that. I can also use this page to set the app to sync with my contacts in my phone.  This way I can connect with people on messenger who are contacts in my phone. I can also control the notifications I get.  ", "scenario_id": "MAS-R-49", "risks": [["81", "118", 3.0], ["239", "246", 2.0], ["355", "367", 2.0], ["554", "559", 2.0], ["590", "596", 1.0], ["600", "609", 3.0], ["618", "626", 1.0], ["663", "676", 3.0]]}, {"app_url": "https://apps.apple.com/sa/app/efhub-23-peshub/id1591724001", "usage_freq": "weekly", "text": "So basically what you see here are players of the week for the second week of February 2023. These are players I am currently aiming to obtain. By searching these players up, the app sees I am interested in these types of players and would probably promote them more on my homepage in the future. This is how they grab their usage data from me. They look up what I look for, and the packs that I search for and keep that information for future updates of the app. To better implement features they rely on me being able to use the app my way and search up players I am interested in. For example, if I am only looking for current POTW players like in this screenshot, the app would cater to that in the future and only promote POTW players to me in the home page screen from now on.", "part2_false_pos4": "1", "part2_false_pos5": "1", "scenario_id": "MAS-R-50", "risks": [["103", "110", 0.0], ["325", "335", 0.0], ["358", "373", 0.0], ["383", "388", 0.0], ["444", "451", 0.0], ["484", "492", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.youtube", "usage_freq": "daily", "text": "I open the app for the purpose of the entertainment. The educational information available on Youtube is mind blowing. usually I watch youtube because I like the content and games that certain youtubers put out, sometimes when I just have nothing to do and I just need a way to pass the time, I just hop straight on to youtube and find it easy to use a couple of hours just watching some usesfull videos. If I go to youtube and search about any topic, I will get videos that allow me to choose what happens. If i search music, I will get tons of music. like if i search anything that isn't just pounding the keyboard i will get a multitude of videos. Whenever I have had a bad day or just feel down, I just hop straight on to youtube a watch some funny videos to laugh and make my day better.", "scenario_id": "MAS-R-51", "risks": [["162", "169", 4.0], ["174", "179", 2.0], ["445", "450", 4.0], ["520", "525", 2.0], ["643", "649", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.getdailyagape", "usage_freq": "daily", "text": "Every day the application sends me and my partner a personal question, we both answer the question and then we see the answer of the other, by giving our name and email it keeps track of the days we have been answering and makes the questions more realistic (I suppose ) in addition to notifications before losing our streak of days responding.\r\n\r\nHow we achieve this is when we enter we click on the button that says you answer the question which takes us to another part of the app where we see the question and if the other person answered first we will see their answer but blurred. You will not be able to read the other person's question until you write the answer.\r\n\r\nThe app offers more benefits such as sexual advice, more intimate questions, and surveys to get to know each other better but we still do not feel comfortable with that level of commitment to our personal information.", "scenario_id": "MAS-R-52", "risks": [["42", "49", 4.0], ["52", "69", "N"], ["154", "158", 1.0], ["163", "168", 3.0], ["187", "218", 0.0], ["286", "299", 4.0], ["567", "573", "N"], ["635", "643", "N"], ["712", "725", "N"], ["741", "750", "N"], ["756", "763", 4.0], ["871", "891", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.reddit.frontpage", "usage_freq": "daily", "text": "This specific screen allows me to review all of my past activities on the Reddit platform. Through this screen, I can also view all of my Karma points, how long I have had an account on the Reddit platform as well as all of the past posts and comments I have written. Under my About tab, I can also see what Reddit Trophies I have accumulated and won over the years. I can also see how much of my Karma points come from the posts I have made and how much of it comes from comments I have made on the posts of other users. I can also see who my followers are and how many Karma points each of them have individually. Finally, from this screen I can edit any of my many profile details as well as my avatar and all of the different bling he has earned or I have bought for him over the years.", "scenario_id": "MAS-R-53", "risks": [["56", "66", 3.0], ["138", "150", 3.0], ["197", "205", 3.0], ["224", "232", 4.0], ["252", "266", 3.0], ["303", "342", 3.0], ["347", "350", "N"], ["360", "365", "N"], ["424", "429", 4.0], ["446", "471", "N"], ["472", "480", 3.0], ["488", "514", 3.0], ["515", "520", 2.0], ["537", "557", 4.0], ["562", "614", 4.0], ["668", "683", 3.0], ["698", "704", 2.0], ["730", "735", 2.0], ["736", "759", "N"], ["775", "789", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.hecorat.screenrecorder.free", "usage_freq": "daily", "text": "This is where all the videos i make show up. These videos are important to what i do for work. I need to record many different things while using my phone. It could be a game or a website or a battery of tests so i need a reliable recorder. It helps me complete the tasks and videos i need to earn an income. It has a very simple but effective layout and i do not believe that it incorporates any personal information, unless you willingly send it through. I did not have to give it any odd permissions like accessing your calender or contacts or things like that. I think that it is one of the safer ones to use and is not just a farm to get information like a lot of apps that are out there now. I really do not like any app to have any information. ", "scenario_id": "MAS-R-54", "risks": [["51", "57", 1.0], ["170", "174", 1.0], ["266", "271", 1.0], ["344", "350", 1.0], ["397", "417", 5.0], ["491", "502", 5.0], ["523", "531", 5.0], ["535", "543", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.infoscout.receipthog", "usage_freq": "weekly", "text": "Through this screen, my goal is to earn cash through earning coins by scanning shopping receipts. I upload and scan pictures of my receipts to earn coins from this app.  The app rewards coins to me according to the amount of the receipt scanned, the higher the receipt amount, the more coins will be earned. For example, 5 coins are rewarded to a receipt that is less than $10, and in a progressive scale, a maximum of 20 coins are rewarded for a receipt that is $100 and up. Another way to earn coins from this app is to connect my online accounts such as Amazon and Walmart when prompted to do so. I also take surveys to earn coins. What is more exciting is that I can earn bonuses by doing spins on the Hog Slots. The app also has monthly sweepstakes for the members to participate to earn extra coins. The minimum amount of coins required to redeem cash from the app is 1000 coins for $5.", "scenario_id": "MAS-R-55", "risks": [["40", "44", 2.0], ["79", "96", 2.0], ["116", "124", 2.0], ["131", "139", 2.0], ["229", "236", 2.0], ["261", "275", 1.0], ["533", "548", 4.0], ["612", "619", 1.0], ["676", "683", 1.0], ["762", "769", "N"], ["799", "804", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.andrewshu.android.redditdonation", "usage_freq": "daily", "text": "This is the Reddit homepage that I usually land on when I first open the app. My goal for this page is to enjoy and distract myself by scrolling the top posts for the day.  I usually scroll the titles and any thumbnail (if available) to see if there's anything that will interest me. When something does interest me, I click on it to learn more and to read people's comments about the post. I upvote comments that I like and downvote ones that I don't like. Sometimes I leave a comment of my own. The information used by the app for the screen is my username that is tied to my email. They collect information about my interactions to specific posts to gather what kinds of ads they should serve me. Like any social media page, Reddit collects user data in order to determine what ads to serve the specific users.", "scenario_id": "MAS-R-56", "risks": [["153", "158", 3.0], ["194", "200", 3.0], ["252", "279", 4.0], ["385", "389", 3.0], ["400", "408", 3.0], ["478", "485", 4.0], ["550", "558", 5.0], ["578", "583", 5.0], ["598", "609", 4.0], ["619", "631", 3.0], ["660", "698", 5.0], ["716", "721", 5.0], ["744", "753", 5.0], ["781", "812", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/cronometer-calorie-counter/id1145935738", "usage_freq": "daily", "text": "I use this screen to track my meals for each day. I use it for a reference often to see how many calories I've eaten that day, how many more calories I can have for the day, and how close I am to target for my protein goals. I use it as a tool to make sure I'm not consuming too many carbs and I try to use it to keep an eye on my fat intake so I don't exceed my daily allotment. I click on the orange + often to log my foods. Sometimes I click on the Foods option to add custom recipes so I can easily track my food daily. If I swipe right at the top where it shows my macros, I can better see the micro nutrients for the day and make sure that I'm on track for everything there as well. I find it helpful to see my energy and weight on this screen.", "scenario_id": "MAS-R-57", "risks": [["30", "35", 0.0], ["88", "125", 0.0], ["127", "172", 0.0], ["178", "223", 0.0], ["284", "289", 0.0], ["331", "341", 0.0], ["420", "425", 0.0], ["452", "457", 0.0], ["479", "486", 0.0], ["512", "516", 0.0], ["570", "576", 0.0], ["599", "614", 0.0], ["717", "723", 0.0], ["728", "734", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/macros-calorie-counter/id1216666985", "usage_freq": "daily", "text": "I use this app to log my meals for the day. To log my breakfast and lunch I open up the app and go to meals. Then, I click on Add food underneath the appropriate heading like Breakfast, search for the food I want and adjust the quantities as needed. I repeat this process until I have entered everything for that meal. I then do the same thing for lunch, dinner, snacks and water consumption. The app is great because it allows me to see what I have consumed for the day and how close I am to my target caloric goal. It also has a large library of foods from various suppliers so I can usually get the correct items especially if they are prepackaged. The app also gives me a breakdown of my carbs, protein fat versus what it thinks I should be trying to hit for the day which helps me stay on track and adjust my diet as need be.", "scenario_id": "MAS-R-58", "risks": [["54", "63", 2.0], ["68", "73", 2.0], ["102", "107", 3.0], ["201", "205", 2.0], ["228", "238", 1.0], ["313", "317", 2.0], ["355", "361", 2.0], ["363", "369", 2.0], ["374", "391", 1.0], ["438", "470", 2.0], ["475", "515", 3.0], ["548", "553", 2.0], ["567", "576", "N"], ["610", "615", 1.0], ["692", "697", 2.0], ["699", "710", 1.0], ["718", "770", 2.0], ["814", "818", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.ubercab", "usage_freq": "weekly", "text": "I use this screen to input my pickup and drop off information. I use this screen to let the drivers know where I want to be picked up/am currently located. I can find the price of my trip after I input this information and determine if I want to go ahead with the ride or not. \r\n\r\nMy main goal on this screen is to input and finalize my ride information.  I like to know how much I will have to pay before the trip and this is where I find that out. I can also cancel a ride after I have one selected and follow along with the driver as they travel towards my destination. The major information that is utilized by the app to support this screen is my location, the driver's location, my destination and the availability of drivers. The availability of drivers impacts the price and the wait time for pickup.", "scenario_id": "MAS-R-59", "risks": [["105", "154", 4.0], ["183", "187", 4.0], ["233", "275", 3.0], ["337", "353", 3.0], ["371", "414", 2.0], ["470", "474", 3.0], ["527", "533", 1.0], ["675", "683", 4.0], ["688", "699", 3.0], ["724", "731", 2.0], ["773", "778", 2.0], ["801", "807", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instacart.client", "usage_freq": "weekly", "text": "As a shopper on the app named Instacart, I have subscribed to some that that is called Instacart Plus. It costs a monthly fee for me to remain subscribed to it, but it comes with a lot of benefits for me as a shopper, with things like discounts, free delivery, and that I am also able to get priority scheduling on my orders over others who do not subscribe to it when there are a little bit of available shoppers. I come to this screen to see how much I have saved, what benefits are currently available to me, and I then apply whatever, if any, benefits are available to me at the moment. Once I select something, I then continue with placing the order, and the app takes what I have applied from this page to that order, including my full name, my applied benefits, and my address. It is then completed by delivering my order to me.", "scenario_id": "MAS-R-60", "risks": [["122", "125", "N"], ["235", "244", 5.0], ["251", "259", "N"], ["318", "324", 3.0], ["444", "465", 0.0], ["467", "510", 2.0], ["717", "722", 3.0], ["737", "746", 4.0], ["759", "767", 2.0], ["776", "783", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.headcode.ourgroceries", "usage_freq": "weekly", "text": "My family uses this app to keep track of groceries and other items that we need to buy. Any of us can add anything to the list and we can all see what is needed. My goal is to have everything on the list organized into sections so that we can get our shopping done fast and efficiently. When I go to the grocery store, I set my phone in the cart and then I open this app so that I can see what I need to buy. I am still in the process of categorizing everything, but I hope to have everything categorized so I can more easily focus on what I need to buy in each section of the grocery store. When I put something into my cart, I tap the screen and it crosses off the item from my list. The app uses the information that I put in to keep track of our groceries. The app also uses my email address for my account and I assume has some information for each of my other family members so that we can share the list.", "part2_false_pos10": "1", "part2_false_pos14": "1", "part2_false_pos15": "1", "scenario_id": "MAS-R-61", "risks": [["61", "66", 3.0], ["181", "191", 3.0], ["219", "227", 3.0], ["251", "259", "N"], ["341", "345", "N"], ["535", "569", 3.0], ["577", "590", "N"], ["667", "671", 3.0], ["680", "684", 3.0], ["750", "759", 3.0], ["782", "795", 5.0], ["803", "810", 5.0], ["833", "865", 5.0], ["866", "872", 3.0], ["873", "880", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.snapchat.android", "usage_freq": "daily", "text": "My goal when using the geolocation screen is to find friends, family and other people who are near me or in the same area. To do this, I use the geolocation feature to pinpoint my exact location, as well as to search for people who are in the same area. The geolocation screen on my Snapchat app allows me to share my current location with my friends, family, and other contacts. Through this screen, I can share my whereabouts with them, which helps me stay connected with people in my life. When I open the geolocation screen, I am presented with a map of my current location, as well as a list of nearby places that I can choose from. This allows me to quickly and easily share my exact location with anyone I choose. Additionally, the app uses GPS technology to provide accurate and up-to-date information about my location. This helps ensure that my contacts are always aware of where I am. The geolocation screen is an invaluable tool for staying connected with those who matter to me.", "scenario_id": "MAS-R-62", "risks": [["53", "60", 5.0], ["117", "121", 3.0], ["228", "252", 3.0], ["326", "334", 4.0], ["352", "358", 5.0], ["416", "427", 4.0], ["474", "480", 4.0], ["551", "554", 5.0], ["607", "613", 3.0], ["684", "689", 4.0], ["748", "751", 5.0], ["855", "863", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/macros-calorie-counter/id1216666985", "usage_freq": "daily", "text": "To keep track of the foods that I have consumed for all time and to easily reference how much of something I usually consume I go to the Foods section of the app to regularly check what I have consumed over the past few days, weeks or even months. It also can add a specific food that isn't listed and add that to the list. The best part is that if I click on any specific item it will give me a complete breakdown of the nutritional components of said item which allows me to better understand what I am consuming and where cut back or possibly where I might be deficient in. The app also gives me a handy breakdown via a pie chart at the top of the screen of the percentage breakdown between carbs, protein and fats which allows me to quickly and easily ascertain if those specific foods are helping or hurting my fitness goals in both the short and long term.", "part2_false_pos3": "1", "part2_false_pos13": "1", "scenario_id": "MAS-R-63", "risks": [["85", "124", 3.0], ["181", "224", 4.0], ["275", "279", 3.0], ["373", "377", 2.0], ["422", "444", 2.0], ["495", "514", 4.0], ["519", "533", 3.0], ["546", "575", 4.0], ["623", "632", 1.0], ["694", "699", 2.0], ["701", "708", 2.0], ["713", "717", 2.0], ["784", "789", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.myfitnesspal.android", "usage_freq": "daily", "text": "The app was amazing to use personally I felt this is save to maintain my personal detail. When I entered into the app that asked my personal detail like my age, date of birthday gender and the second thing ill give my physical detail like my height weight etc., specially of this app that's was shocked tracking the body mass index of my feature its was really amazing I never saw thus feature previously  in any other app more over that the app was easy to handle and using app without any other support but in some usage was so difficult here it make me easy. I share the detail about this app with my friends first they are shocked after, I explain the details they are aldo very happy about it. And finanly I thank to giving this opportunity for me. its was so help me to maintain my physical health. and fitness on track", "scenario_id": "MAS-R-64", "risks": [["132", "147", 1.0], ["156", "159", 1.0], ["161", "165", 1.0], ["178", "184", 1.0], ["218", "233", 1.0], ["242", "255", 1.0], ["316", "331", 1.0], ["338", "345", "N"], ["574", "580", "N"], ["604", "611", 2.0], ["656", "663", "N"], ["788", "803", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.reddit.frontpage", "usage_freq": "daily", "text": "This \"browse communities\" feature pulls a frequently visited community from my history and shows me newest and hottest topics. It uses my personal information - my history - to filter information and topics that would ideally appeal to me. It prevents me from having to scroll through an extensive feed.\r\n\r\nAll I have to do with this is visit the sidebar, select \"browse communities\", and it gives me the highlights. It's a series of very simplistic interactions that streamline my entire process of drilling down to discussions and debates that appeal to me. Lately it's been heavy on the Final Fantasy 14 front due to re-subscribing to that game and following the latest hardcore raiding events. \r\n\r\nThe only information required by the app seems to be browsing history. Nothing else is really required. I am okay with providing this information since it benefits me directly and, even if I get the occasional ad, it is so non-invasive that the pros vastly outweigh the pros.", "scenario_id": "MAS-R-65", "risks": [["61", "70", 1.0], ["119", "125", 1.0], ["138", "158", 3.0], ["164", "171", 2.0], ["184", "195", "N"], ["226", "232", "N"], ["298", "302", 2.0], ["364", "382", 1.0], ["450", "462", "N"], ["517", "528", 2.0], ["533", "540", 2.0], ["590", "606", 1.0], ["643", "647", "N"], ["682", "696", "N"], ["755", "763", 2.0], ["912", "914", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.android.chrome", "usage_freq": "daily", "text": "I use Chrome on my Android phone, primarily, to download apps and other files I may need to use when working on it.  I mostly use my cell phone for work and so that is what's most crucial for me.  I say that because I often need to test apps and software as part of my job entails user testing.  Due to this, I find myself opening and utilizing the downloads screen when using Chrome quite often.  In this way, I can revisit and access recent downloads so they can be managed.  I can open and install them as well as delete apps I no longer need.  I can also ensure that there are no extraneous downloads in the folder for security purposes.  In addition to simply viewing the screen, I can also open/install apps by clicking them.  The information used by the app to support this screen would be my App activity.", "scenario_id": "MAS-R-66", "risks": [["27", "32", 3.0], ["72", "77", 2.0], ["133", "143", 3.0], ["246", "254", 2.0], ["281", "285", 2.0], ["595", "604", 1.0], ["612", "618", "N"], ["709", "713", 2.0], ["800", "812", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/t-mobile/id561625752", "usage_freq": "daily", "text": "This screen of the app tells me which cellular service my Fixed Wireless Home Internet is using.  I can use this information to determine if the placement of the tower is optimal.  I can change the location of the terminal and measure the performance of the changed position.  My goal is to maximize the performance of the wireless system to provide internet service to my home.  The app uses my location, the location of T-Mobile towers, the signal strength being received, and the band of the signals being used.  I can use the information from this screen to contact customer service and identify the T-Mobile tower being accessed.  T-Mobile and change the tower that is being accessed remotely which will allow for better and improved signal quality for my device.  The information also will allow for trouble-shooting activities for issues other than signal band/quality.", "scenario_id": "MAS-R-67", "risks": [["38", "54", 0.0], ["145", "167", 0.0], ["198", "206", 5.0], ["214", "222", 0.0], ["239", "250", 0.0], ["266", "274", 0.0], ["323", "331", 5.0], ["350", "366", 0.0], ["373", "377", 5.0], ["431", "437", 0.0], ["443", "458", 0.0], ["459", "464", 0.0], ["483", "487", 0.0], ["491", "502", 0.0], ["570", "586", 0.0], ["613", "624", 0.0], ["660", "665", 0.0], ["739", "753", 0.0], ["856", "867", 0.0], ["868", "875", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.discord", "usage_freq": "weekly", "text": "This screen has profile information. You can add a few words to it and personalize it with an image at the top. It's useful so other people can get a quick idea about who you are. The most pertinent information is in the connections section. Here, you link to other apps. It's supposed to make it easy to find you on other apps. For the most part, I really like this feature, but there are a few people I would rather not know these things. Unfortunately, it's either all or nothing. Seeing as Discord is a social app, meant to connect people, it makes sense, but sometimes it feels like a breach of privacy. The benefits, however, seem to outweigh the negatives. I'm not sure how much information Discord has access to, I know that some of their connections allow them to display your activity on your profile, so they must have some degree of access to my accounts. I don't think they can see username/password information though. And for the most part, I trust Discord. It's been a fine app and I've used it for many years!", "scenario_id": "MAS-R-68", "risks": [["16", "35", 4.0], ["55", "60", 1.0], ["94", "99", 1.0], ["133", "139", 2.0], ["266", "270", 2.0], ["367", "374", 1.0], ["747", "758", 2.0], ["786", "794", 3.0], ["803", "810", 2.0], ["858", "866", 4.0], ["895", "903", 4.0], ["904", "924", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.chess", "usage_freq": "weekly", "text": "I have a chess rating that I am trying to get to, which, for now is to reach 500 in Blitz. I can use this screen here to monitor my progress to getting to that rating. Specifically, I can see my Blitz rating here, along with my other ratings in the app across all the categories of competition. I can also keep track of the number of games I have played in total, which isn't necessarily all that helpful, but it is interesting to know. The interactions here on this screen are limited to my viewing of the information, as there is no information to input here, but I can also see the red numbers below some of the ratings, which tell me how much I have improved in that specific rating, which is fun to see and motivating. For example, I improved 216 points in Blitz from my low point in rating. For information that the app uses to support this screen, the app keeps track of the games that I play and this is a storing place for the accumulated rating points that I have earned from beating opponents in the app. It is like a record book to keep track of what I have won. Each victory adds points and each loss takes them away. This is where all the totals end up.", "scenario_id": "MAS-R-69", "risks": [["9", "21", 3.0], ["132", "140", 3.0], ["195", "207", 3.0], ["234", "241", 3.0], ["268", "278", 2.0], ["282", "293", "N"], ["589", "596", 3.0], ["638", "686", 3.0], ["752", "758", 3.0], ["789", "795", 3.0], ["882", "887", 3.0], ["948", "961", 3.0], ["1029", "1035", 3.0], ["1058", "1073", 3.0], ["1080", "1087", 3.0], ["1109", "1113", 4.0], ["1153", "1159", 4.0]]}, {"app_url": "https://apps.apple.com/us/app/chase-mobile-bank-invest/id298867247", "usage_freq": "daily", "text": "This is the screen that you use to keep your information for Chase up to date. Here is where you can make changes as you need. Like if your phone or email changes. It is good for you bank to have this type of information up to date because your bank for example needs to get in contact with you or needs your name or income. Without it they cannot contact you or verify you. This is crucial information for your bank to have because your bank is essential to you. Without your bank you are almost nothing. There are also less serious things like choosing language or how much they should email you. That is just preference type of things that aren't as important but could be helpful for you and make navigating the app a whole lot easier or keeping your email inbox clutter free. It is all about how you want it. ", "scenario_id": "MAS-R-70", "risks": [["45", "56", 4.0], ["61", "66", 5.0], ["140", "145", 5.0], ["149", "154", 3.0], ["309", "313", 5.0], ["317", "323", 5.0], ["438", "442", 5.0], ["555", "563", 0.0], ["567", "597", "N"], ["755", "766", 4.0]]}, {"app_url": "https://apps.apple.com/us/app/heartline-study/id1496449684", "usage_freq": "daily", "text": "I use this screen to keep track of my daily activity levels. I can track indoor/outdoor activity, workouts, and stand time.  I can participate in short studies.  I can amass points to redeem for monetary prices.  I can see a log of my daily activities and my body's response to them in the app.  I can compare my activities and my body's response to others.  It allows me to participate in a national study that evaluates the risk of atrial fibulation among the populace of the United States in those 65 and over whether diagnosed or not.  It is a nice way to contribute to the general knowledge of cardiologists and general healthcare specialists as well as those who engage in geriatric care.  It makes me feel that my health is important in a larger sense and that I am contributing to something that matters.", "scenario_id": "MAS-R-71", "risks": [["44", "59", 0.0], ["88", "96", 0.0], ["152", "159", 0.0], ["174", "180", 0.0], ["225", "231", 0.0], ["259", "265", 0.0], ["313", "323", 0.0], ["331", "335", 0.0], ["401", "406", 0.0], ["422", "457", 0.0], ["478", "491", 0.0], ["599", "612", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instagram.android", "usage_freq": "daily", "text": "To access my close friends list, I need to navigate to the menu bar (3 horizontal lines in the top right corner on my Instagram profile and then select close friends. The goal of using this screen is to include people in an exclusive list who will be able to view more of my personal story posts on Instagram. This is done by typing their username in the search bar and then checking their username in order to add them to my exclusive list of close friends. Additionally, I can remove friends who I do not longer want to be on my close friend's list by unchecking a username that is already on this list. After I add and remove users on this page, I can save my changes to finalize the choices I have made and allow my users to see my more exclusive story posts. In order to support this screen, the Instagram app uses a database of users on the platform that is linked to the search bar in order to allow you to find and choose people you want to add on your close friend's list which can also be edited by checking or unchecking the box next to each user.", "part2_false_pos2": "1", "part2_false_pos6": "1", "part2_false_pos7": "1", "part2_false_pos9": "1", "part2_false_pos10": "1", "part2_false_pos12": "1", "part2_false_pos14": "1", "scenario_id": "MAS-R-72", "risks": [["13", "31", 5.0], ["64", "67", 4.0], ["118", "135", 1.0], ["152", "165", 5.0], ["284", "295", 2.0], ["436", "440", 4.0], ["486", "493", 4.0], ["567", "575", 1.0], ["663", "670", 4.0], ["720", "725", 3.0], ["878", "888", 4.0], ["930", "936", 3.0], ["961", "973", 5.0], ["1053", "1057", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.biloholdings.mywinndixie.prod", "usage_freq": "weekly", "text": "I use this screen as a landing page for my usage of this app. From here, I can easily see what deals are available or how many rewards points I have. The app stores my account information and greets me as you can see on the top. I get personalized deals because they track my account information to see what items I usually buy. If I click on savings at the bottom, I get sent to a screen showing me which coupons are available to me. I can also scroll down and see the prices of things in my shopping list under Picked for you deals. I can add items to my shopping list by searching them with the Search icon at the top right. Then, they show up on my homepage, which allows me to easily see when items I like to frequently purchase are on sale. If I press on the Winn-Dixie wallet tab, it scrolls up to show a barcode which I can scan during checkout to make sure the deals are being applied while I'm in-store.", "scenario_id": "MAS-R-73", "risks": [["90", "114", 2.0], ["118", "148", 5.0], ["276", "295", 5.0], ["303", "327", 4.0], ["406", "413", "N"], ["414", "433", "N"], ["470", "476", 1.0], ["480", "486", "N"], ["528", "533", "N"], ["545", "550", "N"], ["557", "570", 2.0], ["693", "703", "N"], ["711", "745", "N"], ["812", "819", "N"]]}, {"app_url": "https://apps.apple.com/us/app/community-first-cu-of-florida/id768808164", "usage_freq": "daily", "text": "To log into my  Community First Checking Account, I open the app and then put in my password. I am then taken to the main screen where all of my accounts are able to be accessed. I click on my checking account from the main screen menu and I am able to see all of my recent transactions in a list. I can see the time and date of the transaction along with the amount of money that was taken from my account, and how much money was left in the account after that transaction. In order to get more information on the transaction, I can click on details and settings and then I can find out if there are any more details that the bank was given when that transaction was made. I can also check the ID of the transactions in case there is not an identifiable name on there.", "scenario_id": "MAS-R-74", "risks": [["41", "48", 4.0], ["84", "92", 4.0], ["145", "153", 4.0], ["193", "209", 4.0], ["274", "286", 4.0], ["312", "316", 4.0], ["321", "344", 4.0], ["356", "406", 4.0], ["412", "473", 4.0], ["515", "526", 4.0], ["555", "563", 4.0], ["588", "672", 4.0], ["695", "697", 4.0], ["755", "759", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.duolingo", "usage_freq": "daily", "text": "Getting to this screen is pretty simple you just navigate to your profile and you can see your friends and followers there. From there you can get to this account screen with the gear and i can change a lot of different things about my account. Changing everything is pretty easy you just tap it once and you can then type out your desired changes pretty simply. Along side that you can save or not save the details and you can also change accounts if lets say you had a friend that wanted to log in and learn while they were using your device. Besides that you can also change how you share info with your friends and anyone that follows you and choose just how much they can see also. The screen allows you to do a lot with very little effort and it is rather helpful and useful because of that.", "scenario_id": "MAS-R-75", "risks": [["66", "73", 1.0], ["107", "116", 2.0], ["155", "162", 1.0], ["440", "448", "N"], ["471", "477", 1.0], ["607", "614", 1.0], ["659", "680", "N"]]}, {"app_url": "https://apps.apple.com/us/app/fetch-have-fun-save-money/id1182474649", "usage_freq": "weekly", "text": "Through this screen i want to sign into my online accounts so fetch can pull and review my e receipts. They take these receipts and give me points from them. i can redeem these points for gift cards. I click connect and from there sign into each account. they use my sign in to review all of my receipts. The more receipts i have the more points o get for what i bought. I try to do this once a week sometimes more often. They have special point bonuses for certain items. I reach a certain point amount and go to the redeem tab and choose from many different rewards options, i usually just redeem amazon gift cards because they are ge easiest to use i can refill my amazon account with them. You can build up points pretty quick by sharing your logins because it does all the work for you. ", "scenario_id": "MAS-R-76", "risks": [["43", "58", 0.0], ["91", "101", 0.0], ["119", "127", 0.0], ["246", "253", 0.0], ["356", "369", 0.0], ["440", "453", 0.0], ["466", "471", 0.0], ["491", "503", 0.0], ["560", "575", 0.0], ["606", "616", 0.0], ["668", "682", 0.0], ["711", "717", 0.0], ["747", "753", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "This is the home page where the number of steps that I have taken that day are recorded and then shared with me.  In an effort to describe the goals I want to achieve through this screen, I would say that I use this screen in order to better understand my daily movement and make sure that I am reaching my goal of taking at least 7,000 steps each day.  My interactions with this screen in order to achieve my goals is to look at it and see how many steps that I have taken that day.  I can also use the other toggles at the top to see the number of steps that I have taken that week, month, or even in that year.  The information that is used by the app to support this screen is my movement, biometric data such as heart rate, and my steps.", "scenario_id": "MAS-R-77", "risks": [["28", "74", 0.0], ["262", "270", 0.0], ["441", "482", 0.0], ["536", "584", 0.0], ["694", "708", 0.0], ["717", "727", 0.0], ["736", "741", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.amazon.mShop.android.shopping", "usage_freq": "weekly", "text": "Often when I am shopping I save an item for considered later purchase. Sometimes I purchase these items, in which case they disappear from the Saved for Later section, and sometimes I don't purchase them, in which case they remain on the list until I do purchase them or I manually delete the objects. I manually added these items to my list, and so I can't say that I didn't mean to save them or that Amazon saves them automatically. I will periodically revisit this screen to assess whether I still want to buy the object, and / or whether the item is still available (the topmost item is not currently available from the seller). I would not want to share this list except with people I knew and trusted. I don't want everyone to know what items I am considering purchasing on Amazon or what items I am planning to purchase. ", "scenario_id": "MAS-R-78", "risks": [["61", "69", 4.0], ["293", "300", 3.0], ["325", "330", 3.0], ["517", "523", 3.0], ["546", "550", 3.0], ["551", "569", 2.0], ["738", "786", 4.0], ["790", "826", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.zhiliaoapp.musically", "usage_freq": "weekly", "text": "The videos I see on this feed are recommended to me based on how I use the app. The type of content I post affects what I see. The channels I already follow affect what I get recommended. I can discover more channels to follow through this feed. The videos I see match my tastes the more I interact with them. TikTok has a number of different ways to monitor your usage to give you videos that match your taste better. TikTok is known for having a unique algorithm that works better than other apps. They are very good at showing you content that you should be interested in. They have multiple categories for videos to better organize the content. The content you post can also be found if you search for the audio in it. They monitor a video's views to figure out whether more people would want to watch it. ", "scenario_id": "MAS-R-79", "risks": [["4", "10", 2.0], ["84", "91", "N"], ["115", "125", 1.0], ["208", "216", 1.0], ["272", "278", 0.0], ["364", "369", 1.0], ["400", "410", 0.0], ["595", "605", "N"], ["640", "647", 1.0], ["710", "715", "N"], ["738", "743", 1.0], ["746", "751", "N"], ["766", "791", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=gbis.gbandroid", "usage_freq": "weekly", "text": "From this screen I can do all sorts of actions starting with clicking on the search bar to update my current location or to put in an address of my choosing in order to search for nearby gas stations. I can also tap on the map itself in order to move the map around and manually search for locations. The map shows me stations on the map indicated by pins that have small icons on the pin to show station names, the price of regular gas at that station, and whether they have any deals for gas. If I click on the pin itself it will bring me to a seperate listing for the gas station that gives me additional information like services offered by the station, what types of products it sells, the prices for different grades of gas, and even customer reviews of the station. I can also leave reviews myself on this page. Additionally i can switch to a list view of nearby stations by clicking the list button in the upper right.", "scenario_id": "MAS-R-80", "risks": [["77", "87", 2.0], ["109", "117", 1.0], ["134", "141", 1.0], ["187", "199", 1.0], ["290", "299", 1.0], ["318", "326", 1.0], ["334", "337", 2.0], ["397", "410", 1.0], ["412", "436", 0.0], ["437", "452", 1.0], ["458", "493", 1.0], ["555", "562", 1.0], ["571", "582", 0.0], ["625", "633", 1.0], ["649", "656", 1.0], ["658", "689", 0.0], ["695", "701", 0.0], ["716", "722", 1.0], ["740", "756", 1.0], ["790", "797", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.fitness", "usage_freq": "daily", "text": "My goal in using the Google Fit journal screen is to keep track of my physical activities and monitor my progress over time. I use this screen to see the list of all the exercises I have done on a given day or over a certain period.\r\n\r\nI can scroll through the list of activities to see the details, including the type of exercise, duration, and calories burned. Additionally, if the fit missed and exercises I can add them with the plus in the bottom right corner.\r\n\r\nThere are several pieces of information that Google Fit Journal page likely uses. It uses location information from the GPS along with velocity for workouts to track where and how fast I am moving for my cardio workouts. Google fit also integrates with my smartwatch which additionally has a heart rate monitor. This heart rate information is available for me to view from google fit directly.", "scenario_id": "MAS-R-81", "risks": [["70", "89", 3.0], ["105", "113", 2.0], ["180", "206", 4.0], ["210", "231", 4.0], ["269", "279", 3.0], ["314", "330", 3.0], ["332", "340", 3.0], ["346", "354", 3.0], ["399", "408", 3.0], ["559", "579", 5.0], ["589", "592", 5.0], ["604", "612", 3.0], ["617", "625", 3.0], ["645", "688", 3.0], ["725", "735", 3.0], ["761", "779", 3.0], ["786", "796", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/fetch-have-fun-save-money/id1182474649", "usage_freq": "weekly", "text": "This screen helps me keep track of my progress toward earning gift cards. When I interact with this screen, I am looking for how many points have I accumulated so far. I am also able to upload additional receipts in order to earn more points. I can also quickly view how many more points I need to accumulate before I can earn a gift card of my choosing. This app uses the information above in order to contact me with updates and other offers. It helps me keep track of my progress toward my goal.  From this screen I am also able to look up additional offers that might be available to me to maximize my savings with purchases online.  From this screen I am also able to interact daily with this app in order to win bonus points. No purchase is necessary to play the bonus points game, you must simply log on and spin the wheel.", "scenario_id": "MAS-R-82", "risks": [["62", "72", 1.0], ["125", "166", 1.0], ["204", "212", 4.0], ["235", "241", 1.0], ["267", "308", 1.0], ["329", "338", 3.0], ["419", "426", 2.0], ["474", "482", 1.0], ["554", "560", 0.0], ["619", "628", 4.0], ["735", "743", 4.0], ["769", "781", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "It's important to me that I am not sitting for too long throughout the course of the day.  This screen tells me how many hours i was able to stand throughout the course of the day and/ or the course of the week.  The goals that I want to achive through this screen are to use the app in order to track my time spent standing over the course of the day.  I can also use it to examine trends over the course of a week and examine why certains days were better than others for me.  My interactions with this screen in order to achieve these goals, is I use it in order to gain insight and snap shots into how often I stand throughout the day and make sure that I am meeting my goals.  The information that is used by this app in order to support this screen includes biometric data such as body movement and body position.", "part2_false_pos2": "1", "part2_false_pos3": "1", "part2_false_pos6": "1", "part2_false_pos7": "1", "part2_false_pos8": "1", "scenario_id": "MAS-R-83", "risks": [["112", "168", 0.0], ["172", "179", 0.0], ["188", "210", 0.0], ["302", "351", 0.0], ["383", "389", 0.0], ["428", "440", 0.0], ["441", "445", 0.0], ["446", "469", 0.0], ["602", "638", 0.0], ["764", "778", 0.0], ["787", "800", 0.0], ["805", "818", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.youmail.android.vvm", "usage_freq": "daily", "text": "I access this screen to take note of the number of spam/robocalls that were blocked on my phone.  This tells me how many calls were blocked, how many spammers are in the database, and how many numbers are in my block list.  In this way, I get a good idea of how well the app is protecting me and how I might want to react to block unwanted calls.  For this particular screen, I don't have to do much other than observe it.  However, I can click on the \"Block List\" section to add more numbers.  I can also click on the \"Blocked Calls\" section to see what robocalls have been blocked.  The information used by the app would be the calls that have been blocked as well as the number of known spammers in their database.  That's what the app uses to know if a call should be blocked or not (generally).", "scenario_id": "MAS-R-84", "risks": [["41", "95", 4.0], ["112", "139", 3.0], ["141", "178", 2.0], ["184", "221", 4.0], ["296", "339", 3.0], ["340", "345", 4.0], ["453", "463", 3.0], ["485", "492", 4.0], ["528", "533", 4.0], ["550", "582", 3.0], ["626", "658", 4.0], ["670", "716", 2.0], ["752", "786", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.starbucks.mobilecard", "usage_freq": "weekly", "text": "If I find myself in an area where I am not as familiar I refer to this app to show me the closest Starbucks in the immediate area. I can pre-order using the app and even earn extra points for ordering ahead! The app stores my frequent orders so that I don't have to hunt and search and saves me valuable time so I can pay more attention to the road. I can get the address and place it in my GPS so it will get me directly to the store and pick up the order. This is my fav app for many delicious reasons and I can even get extra points for purchasing gift cards for family and friends for birthdays and holidays. Additionally, they have special days where if you purchase a special drink or order ahead 3 days in a row and double your points for free drinks and menu items.", "scenario_id": "MAS-R-85", "risks": [["98", "107", 1.0], ["125", "129", 4.0], ["226", "234", 1.0], ["235", "241", 0.0], ["364", "371", 0.0], ["391", "394", 1.0], ["429", "434", 2.0], ["451", "456", 0.0], ["551", "561", 1.0], ["577", "584", 4.0], ["682", "687", 0.0], ["735", "741", 1.0], ["751", "757", 0.0], ["762", "772", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=us.zoom.pwa.twa", "usage_freq": "monthly", "text": "I can use this page to see new messages that have been sent to me from people who I have met with.  I can schedule meetings on a calendar and keep track of them.  I can use this page to link with my contacts so that I can contact them directly from the Zoom app.  I can choose to pull up  a chat box to chat with others and not do a face to face meeting.  By using this app I am able to have virtual meetings with other people around the world.  I am able to contact people face to face and talk with them.  I am able to show others important events that may happen in my life because I can send them a link and they can join a meeting that I am hosting.  I can stay connected with others.  ", "scenario_id": "MAS-R-86", "risks": [["31", "39", 1.0], ["71", "77", 2.0], ["89", "92", 1.0], ["129", "137", 2.0], ["199", "207", 2.0], ["291", "299", 1.0], ["400", "408", 0.0], ["533", "568", 0.0], ["572", "576", 2.0], ["603", "607", 2.0], ["628", "635", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/myfitnesspal-calorie-counter/id341232718", "usage_freq": "daily", "text": "I use this screen to remind myself of my starting point when I made my most recent weight loss goal. I consider both my long term goal of my goal weight as well as my weekly goal of losing one pound a week. I update the information on this screen as it changes to reflect my progress. I can click on each item and change the information manually. The app uses information that I have entered on my profile as well as explicitly on the goal setting screen for this information. Other information is data that I enter that I have taken myself. I use this screen to keep track of where I am along the way to reaching my goal and to reassess it as I go along. When my weight has changed I reenter the current data and possibly readjust my weekly goal to alter the pace of my weight loss. I also change the information reflecting my activity level when my activity level has changed or I expect it to change. I have previously subscribed to premium features on this screen and used it to track more granular nutritional goals such as macronutrient intake and workouts.", "part2_false_pos1": "1", "part2_false_pos4": "1", "part2_false_pos6": "1", "part2_false_pos8": "1", "part2_false_pos10": "1", "part2_false_pos11": "1", "part2_false_pos15": "1", "part2_false_pos16": "1", "scenario_id": "MAS-R-87", "risks": [["50", "55", 2.0], ["83", "99", 2.0], ["146", "152", 2.0], ["193", "198", 2.0], ["275", "283", 2.0], ["305", "309", 2.0], ["398", "405", 2.0], ["435", "447", 2.0], ["577", "587", 3.0], ["602", "621", 2.0], ["705", "709", 2.0], ["742", "746", 2.0], ["771", "782", 2.0], ["828", "842", 1.0], ["944", "952", 2.0], ["994", "1002", 2.0], ["1003", "1020", 1.0], ["1029", "1042", 1.0], ["1043", "1049", 2.0], ["1054", "1062", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.postmates.android", "usage_freq": "weekly", "text": "The primary goal on this part of the app is to check whether I have earned any vouchers for future orders based on what I have bought in the past or just gift discounts from the company itself. If I am able to see a voucher, I can apply it right then and there, and I can also complement the voucher with the payment info that I have on file in the payment methods area. I do this by clicking on one of the payment methods, right after clicking on the vouchers section, depending on what is currently available to me. The app then uses my payment information, which it uses in combination with my full name that I already have on the profile section, and my address right before I am to place the order. It is then completed once the delivery of the food to me address is finished.", "scenario_id": "MAS-R-88", "risks": [["53", "98", 4.0], ["99", "105", 3.0], ["115", "145", 3.0], ["154", "192", 5.0], ["292", "299", 5.0], ["309", "321", 5.0], ["407", "422", 5.0], ["452", "460", 5.0], ["539", "558", 5.0], ["597", "606", 4.0], ["634", "641", 4.0], ["658", "665", 5.0], ["697", "702", 3.0], ["750", "754", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=sp0n.citizen", "usage_freq": "weekly", "text": "On this recent incidents screen, I want to see what criminal and dangerous incidents have been happening in an area. I usually check in my home neighborhood and also other areas when I'm out and curious. To see what has been happening, I click on the red, yellow, or gray circles. The yellow circles. A red circle means it's a major incident that happened under 2 hours ago. Yellow circles are not as serious but also happened under 2 hours ago. Gray circles are incidents that happened over 2 hours ago. When I click on one of the circles, a popup appears giving me a timeline of the incident. The incidents can vary from \"man reported carrying a weapon\" to \"major collision involving 2 vehicles\". Sometimes there is even video available that was taken by another user of the app. The app uses my location to populate the screen with incidents.", "scenario_id": "MAS-R-89", "risks": [["47", "115", "N"], ["144", "156", 4.0], ["225", "234", "N"], ["327", "355", "N"], ["494", "499", "N"], ["569", "577", "N"], ["624", "627", "N"], ["648", "654", "N"], ["666", "675", "N"], ["688", "696", "N"], ["723", "728", "N"], ["798", "806", 4.0], ["835", "844", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=org.lds.ldssa", "usage_freq": "weekly", "text": "I use this screen to navigate to different parts of the app to look up other members.  I go around in here to find people that I need to get in contact with.   There are many people who I will need to look up an address or phone number for and I can find that information here.  I use this page very regularly.  I like to use this page to find out who are members of my church also.  Sometimes I will need to find out if a new person moved into my area and this app can help me do this.   It will show who is new in the are and where I can find them.  It also gives information on how long they have been around and where they are living.  I use this feature a lot.  ", "scenario_id": "MAS-R-90", "risks": [["77", "84", 2.0], ["115", "121", 2.0], ["212", "219", 3.0], ["223", "235", 3.0], ["348", "376", 1.0], ["427", "439", 3.0], ["448", "452", 2.0], ["502", "523", 2.0], ["528", "549", 2.0], ["581", "611", 1.0], ["616", "637", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.turner.tnt.android.networkapp", "usage_freq": "monthly", "text": "This is the sign in page for the TNT app. It allows you to log in with your TV provider to watch the TNT channel on your mobile phone. To do this, you would click on the sign in button on the top left and then choose from a list of cable providers. If you have xfinity, for example, you would pick that and it would automatically log you in. There are various options that you can configure to address privacy settings, with regards to data usage. If you do not want to share data with third parties, you would toggle that off. Keep in mind that this is enabled by default, as most people do not navigate down to disable it. On this page, there is also the option to use mobile phone data (as opposed to wifi data). If has a mobile data cap, then this option must be toggled off.", "part2_false_pos4": "1", "scenario_id": "MAS-R-91", "risks": [["76", "87", 5.0], ["101", "104", "N"], ["232", "247", "N"], ["402", "418", 3.0], ["436", "446", 5.0], ["476", "480", "N"], ["671", "688", 5.0], ["725", "740", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=org.ridemetro.qticketing", "usage_freq": "weekly", "text": "I use this screen to keep payment methods available for me to buy tickets in the app. My goal with this is to travel around town for an affordable price in a sustainable way. By using this app and keeping my cards in it, I can pay on the fly as needed. Being able to pay through just the app, I don't have to worry about carrying cash or loading up a card. I also don't have to worry about handling dirty money, nor about tapping a card onto the scanner thingy. I just pay directly from my cards using the app, then I can show my ticket to the bus driver with the app, and I get to go on the bus or the light rail. If you notice, it also has google pay available, which provides the fastest and most convenient method of payment, and goes directly to my bank account.", "scenario_id": "MAS-R-92", "risks": [["26", "41", 3.0], ["66", "73", 2.0], ["147", "152", 1.0], ["208", "213", 4.0], ["330", "334", 3.0], ["405", "410", 2.0], ["432", "436", 3.0], ["530", "536", "N"], ["544", "547", 2.0], ["642", "652", 3.0], ["754", "766", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/tiktok/id835599320", "usage_freq": "daily", "text": "I use this screen in order to see how much time I have been delving into this app. I know it is an entertainment app and not a medical-type app, but this is the app I use mostly through out the day. This app keeps my sanity specially through a very toxic day at work. During work breaks, I use this app and watch little video snippets of people or sometimes animals that make me laugh. I scroll through this app a lot and sometimes I loose track of time and be late to get back to my tasks at work. That is why I need to track my screen time in order to stay at pace with my reality both at work and my realities at home. I would love also if this option is available right at the front screen so I may know how much time I have spent on this app right away.", "scenario_id": "MAS-R-93", "risks": [["38", "67", 3.0], ["275", "279", 3.0], ["320", "334", 3.0], ["338", "344", "N"], ["358", "365", "N"], ["484", "489", "N"], ["530", "541", 3.0], ["575", "582", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.maps", "usage_freq": "weekly", "text": "I use it to find out anything cool happening in my area. It can be a local event, a business promotion, or just interesting locations I may be interested in. I use the feature when I'm bored of being in my house and want something interesting to do. If I see something interesting I'll click on it and sometimes I'll even follow the person or business. I can use it to find directions to a location or even make a call. I also enjoy looking at pictures and videos. People are always uploading cool images from these locations. I can also save them in my contacts if I want to contact them later. It mostly uses my location information. It also makes use of my contact information. Since it's linked to my Google account it may make use of my search history or general interests. I can't be totally sure of that though.", "scenario_id": "MAS-R-94", "risks": [["51", "55", 2.0], ["75", "80", 1.0], ["84", "102", 1.0], ["168", "175", 1.0], ["333", "339", 2.0], ["343", "351", 1.0], ["374", "384", 2.0], ["390", "398", 4.0], ["444", "452", 3.0], ["457", "463", 3.0], ["498", "504", 3.0], ["516", "525", 4.0], ["554", "562", 4.0], ["614", "634", 4.0], ["660", "679", 4.0], ["705", "719", 3.0], ["742", "756", 5.0], ["760", "777", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.facebook.katana", "usage_freq": "daily", "text": "I can see and change my Facebook profile picture using this screen. I can see my profile details also I can edit my profile details including full name, address, relationship status, work, and education details, Date of Birth, and family members who are using Facebook. I can also set privacy details as to who can see my data by only me/public/friends like this. I can see my friends on Facebook also I can unfollow or unfriend them. I can see the news feeds using this screen. I can see the groups I follow on Facebook. I can see the marketplace where I can buy or sell products. I can see my Facebook memories. I can also see saved posts and I can remove the posts I previously saved. I can see the Facebook pages I liked and follow. I can see Facebook reels also. I can see the events. I can use Facebook help & support using this screen.", "scenario_id": "MAS-R-95", "risks": [["24", "48", 1.0], ["116", "131", 2.0], ["142", "151", 3.0], ["153", "160", 5.0], ["162", "181", 2.0], ["183", "187", 3.0], ["193", "210", 3.0], ["212", "225", 4.0], ["231", "245", 5.0], ["285", "300", 5.0], ["311", "326", "N"], ["377", "384", 2.0], ["449", "459", 0.0], ["493", "499", 3.0], ["536", "547", 1.0], ["572", "580", 1.0], ["595", "612", 0.0], ["662", "667", 1.0], ["702", "716", 1.0], ["747", "755", "N"], ["782", "788", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.amazon.mShop.android.shopping", "usage_freq": "weekly", "text": "When I check this screen I often am using it to confirm that my order has shipped or arrived or to try and get a refund/return if there is a problem with the product. I interact with the screen by clicking on the little person avatar at the bottom of the screen to arrive on this page and then I use my finger to swipe up if I need to scroll further down to find my product. I think tap on the product I want to interact with and the page loads information about only that product. On the new page I can see when the item was delivered or when it will be delivered/track package, get help with the product, view details of the purchase (payment information), and write a review. The information the app uses is my login information, my purchase history and my payment information. The app would be useless without following that personal information and I would fully expect it to have that access. ", "part2_false_pos2": "1", "scenario_id": "MAS-R-96", "risks": [["64", "69", 2.0], ["227", "233", 1.0], ["366", "373", 1.0], ["508", "535", 2.0], ["539", "578", 2.0], ["627", "635", 2.0], ["671", "677", 1.0], ["714", "731", 4.0], ["736", "752", 4.0], ["760", "779", 4.0], ["829", "849", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instacart.client", "usage_freq": "weekly", "text": "This is the place I go to when I am ready to start an order. I can apply benefits through here that I have earned in order to save some money on the order that I am about to place. I do so by selecting a voucher or a promo code offer that is ongoing. The main interactions on this screen are selecting my credit card information after choosing my items, and then the app takes that payment info and credit card that I have set up on this page at the top, applies any potential discounts that I may have added, takes my name, and uses my address. The app uses this information in order to know where to deliver it to, what to cards to charge, how much to charge each of them, and it then gives my full name and delivery address to the delivery driver for completion.", "scenario_id": "MAS-R-97", "risks": [["73", "81", 3.0], ["136", "141", "N"], ["149", "154", 3.0], ["204", "211", 5.0], ["217", "227", 5.0], ["228", "233", 5.0], ["305", "328", 5.0], ["347", "352", 3.0], ["382", "394", 5.0], ["399", "410", 5.0], ["477", "486", 3.0], ["519", "523", 4.0], ["537", "544", 5.0], ["617", "640", 5.0], ["696", "705", 4.0], ["710", "726", 5.0], ["734", "749", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.kms.free", "usage_freq": "weekly", "text": "This is the screen that's generated after I update the databases and run the antivirus scan.  I use this screen to detect and determine if there is any malware on my cell phone.  My goal is to ensure that the phone isn't compromised in any way.  To do this, all I need to do is wait for the scan to complete (I have it set to run automatically when I open the app) and take notice of the screen.  There is a lot of information used by the app to support this screen.  For it to run properly, I need to approve several different permissions including allowing it to \"run on top\" of the other apps on my phone.  I choose full scan so it scans the entire phone and needs access to contacts, call history, and really the entire phone.  I don't feel entirely comfortable with all of those permissions but it's required and I think antivirus apps are a must these days.", "scenario_id": "MAS-R-98", "risks": [["55", "64", 4.0], ["136", "176", 3.0], ["528", "539", 3.0], ["591", "595", 2.0], ["652", "657", 3.0], ["678", "686", 4.0], ["688", "700", 4.0], ["826", "835", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=me.bukovitz.noteit", "usage_freq": "weekly", "text": "Every Saturday my partner and I each make a drawing that we send to the other, for that we enter the App then we click on \"respond\" to enter the drawing section (it brings several tools that help to make different drawings) after that we click send, I can see the drawings I receive by clicking on the drawing timeline section.\r\nWhen finished, he asks me if I want to share the drawings with my contacts or on my social networks.\r\n\r\nThe reason why we use this app is to achieve a more intimate connection that is creative and fun at the same time, it doesn't take much time to draw and it gives us an icebreaker activity on the weekend.\r\n\r\nThe app itself does not use much of our personal information beyond our names, connections and social networks. We still find it uncomfortable to give that information in an intimate area but since the app is simple we don't worry much.", "scenario_id": "MAS-R-99", "risks": [["44", "51", 5.0], ["302", "318", 5.0], ["378", "386", 5.0], ["395", "403", 1.0], ["680", "700", 1.0], ["712", "717", 2.0], ["719", "730", 4.0], ["735", "750", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.chipotle.ordering", "usage_freq": "weekly", "text": "In this screen of the app that I chose to feature it is the rewards point exchange for my favorite restaurant: Chipotle Mexican Grill. Just by eating at the restaurant I am able to accumulate points whether it is a pick up in person order or an online order via delivery. Once you gather enough points based on how much you had spent you can then come to the rewards exchange and spend the points to get free stuff to redeem such as clothes merchandise, food, drinks or gift cards. It’s a great incentive as a loyalty program that I’ve benefited from greatly. The app automatically calculates the points you earn by scanning your personal QR code in person at the register or if you place an online order it will process the points at the end of the transaction. It’s very simple navigate the app itself, but in order to get to the rewards exchange all you have to do is open the app, click the tab on the main page and select the reward you want. The reward is then added to your account and all you have to do is select it as a QR code to scan at the register in person, or add it to your online order for use.", "scenario_id": "MAS-R-100", "risks": [["60", "82", 2.0], ["111", "119", 1.0], ["157", "167", 1.0], ["233", "238", 1.0], ["295", "301", 1.0], ["311", "333", 2.0], ["404", "424", 1.0], ["433", "452", 1.0], ["454", "458", 1.0], ["460", "466", 1.0], ["470", "480", 1.0], ["510", "517", 1.0], ["639", "646", 1.0], ["692", "704", 2.0], ["832", "848", 1.0], ["952", "958", 1.0], ["981", "988", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=homeworkout.homeworkouts.noequipment", "usage_freq": "daily", "text": "I used this screen to monitor my daily calorie burn routine, also my fitness routine. It shows the progress of my change, We can check what type of exercises I done, The frequency and duration of my workouts can be monitored. I can also see the body fat percentage. Here we can also see the date wise report which is more helpful to check weather we made a progress consistency . and we can able to enter our weight manually so can we can also check our weight loss. The information this screen needed is my weight and exercise done today will be saved. which can be used to calculate my calorie. The exercise will be provided based on my calorie count setting. If I need to burn calories. i Can set exercise preference according to It. If I need to work out more this app can add extra workout according to my prefrence.", "scenario_id": "MAS-R-101", "risks": [["39", "59", 1.0], ["69", "84", 0.0], ["95", "120", 1.0], ["135", "164", 0.0], ["199", "207", 1.0], ["245", "264", "N"], ["291", "300", 0.0], ["301", "307", 1.0], ["357", "377", 0.0], ["409", "415", 0.0], ["454", "465", 1.0], ["528", "538", "N"], ["588", "595", 1.0], ["601", "609", 0.0], ["639", "660", 1.0], ["680", "688", 1.0], ["700", "719", 0.0], ["787", "794", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.walmart.android", "usage_freq": "weekly", "text": "I use this screen to look up when I bought a product last so I can see how long it lasts me. I also use this screen to find exact items that I liked but cannot remember. it also helps me because you can use this screen to start a return and return items in store that you don't like. It helps me when I am shopping because it tells me when I bought the exact item before. I use this a lot when it comes to groceries and personal care products because I can look up when I bought them and get an idea on how many I need to buy a month so I can budget for it. I probably shop at Walmart more than any other store so things like purchase history and super important to me. It gives me peace of mind to know there is a record of all of my shopping at the store.", "scenario_id": "MAS-R-102", "risks": [["29", "57", 4.0], ["71", "91", 4.0], ["124", "168", 2.0], ["248", "253", 4.0], ["335", "370", 4.0], ["420", "442", 4.0], ["503", "533", 4.0], ["605", "610", 2.0], ["626", "642", 4.0], ["715", "743", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/fitbit-health-fitness/id462638897", "usage_freq": "daily", "text": "First thing i do in the morning is open the app and see how much sleep i have gotten that night, that usually dictates my day knowing how tired i am. I then at the gym track my heart rate, i want to get it up to at least 100+ that way i know how hard i am working out and if i need to workout harder. I think also do some cardio which i try to do at least 3K steps  a day and sometimes pass that. If i don't reach that in the morning i use the app again in the afternoon to gain more steps and keep track of heart rate while i'm getting my steps in. Late at night i then open the app before i go to sleep to check how my day was and if i achieved most of my goals which i usually do", "scenario_id": "MAS-R-103", "risks": [["56", "95", 1.0], ["134", "148", 1.0], ["242", "267", 1.0], ["275", "276", 2.0], ["285", "299", 1.0], ["322", "328", 0.0], ["484", "489", 0.0], ["508", "518", 4.0], ["614", "628", 2.0], ["633", "663", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.strava", "usage_freq": "weekly", "text": "When I want to do an activity like walking or hiking or biking, I go into the app and allow it to use my location while I'm doing the activity so it can log details of the distance, the location where the activity was taking place and a map of where the activity took place, the calories burned, and things like elevation gain and moving speed. I use this progress screen to keep track of the activities I have done each week, for the past three months. My goal is to exercise regularly and consistently and this screen shows me a graph where I can see how I'm doing, with each activity, at a glance. In order to get the graph data, the app had to track my location for the activity. I can click on the different activity tabs to see how I've done with each activity and I can move a slider bar to see the total miles I have done for each week of the month.", "scenario_id": "MAS-R-104", "risks": [["157", "164", 4.0], ["172", "180", 1.0], ["195", "213", 3.0], ["214", "230", 3.0], ["237", "240", 4.0], ["244", "273", 3.0], ["279", "287", 0.0], ["312", "326", 0.0], ["331", "343", 0.0], ["356", "364", 1.0], ["393", "403", 3.0], ["553", "566", 2.0], ["578", "586", 3.0], ["621", "626", 1.0], ["657", "665", 4.0], ["713", "726", 3.0], ["740", "747", 3.0], ["784", "794", 1.0], ["806", "856", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.messaging", "usage_freq": "daily", "text": "To stay in touch with my friend and family or to complete a specific step in a multi-factor authentication process, I open the app and choose the correct filter.  For friends and family I use the Personal tab to quickly find new messages.  For one-time authentication messages I switch to the Business tab.  To open a conversation to view the text message I click on the unread message thread, which shows up in a bold white when it hasn't yet been viewed.  Once inside the thread I can read the full message and choose how I want to reply, or if it contains a verification code I can quickly copy it to my clipboard and insert it on the relevant login page.  I can also easily archive or delete entire message threads to lessen clutter within the app and make it easier scroll down to previous threads that are of importance to me.", "part2_false_pos9": "1", "part2_false_pos13": "1", "scenario_id": "MAS-R-105", "risks": [["92", "114", 5.0], ["229", "237", 5.0], ["253", "276", 5.0], ["318", "330", 5.0], ["343", "355", 5.0], ["378", "392", 5.0], ["474", "480", 5.0], ["501", "508", 5.0], ["520", "539", 5.0], ["561", "578", 5.0], ["703", "718", 5.0], ["795", "802", 5.0], ["803", "831", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/ring-always-home/id926252661", "usage_freq": "daily", "text": "I use this screen to keep our home safe and keep an eye on the dogs while I am working. The front door ring camera is great to keep an eye on people who may be walking around the neighborhood. The doorbell lights up very bright which tells intruders or people trespassing they are on camera. I also have the front door bell tell me when there has been a package delivered. The back doorbell is more security, and when I am inside working on my computer I can keep an eye on the dogs in the back yard. Interactions are very simple. I can click on either front door or back yard, and it pulls up two options; one to watch a live view of the screen or to watch recorded events. The information used is wifi, my location, local network, microphone, camera access, and cellular data. I am fine with this information being used because it secures my home.", "scenario_id": "MAS-R-106", "risks": [["63", "67", 2.0], ["142", "148", 2.0], ["179", "191", 0.0], ["352", "371", 3.0], ["667", "673", 3.0], ["708", "716", 4.0], ["718", "731", 5.0], ["733", "743", 5.0], ["745", "758", 5.0], ["764", "777", 5.0], ["844", "848", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "This is my activity summary page on my apple fitness app.  This is where I can view the summary of my activity, which includes exercise minutes, standing time, and movement calories over the course of a week.  The goals that I want to achieve through this screen is to review and monitor whether or not I am meeting my movement goals, my exercise goals, and my standing goals each day over the course of a week.  My interactions with this screen in order to achieve my goals is to take a look at it and track my progress and ask myself if I am moving enough, working out enough, and standing enough.  The information that is used by this mobile application in order to support this screen includes my biometric data such as workouts, heart rate, and movement.  It also collects information such as logged workouts and body position.", "part2_false_pos10": "1", "scenario_id": "MAS-R-107", "risks": [["11", "27", 0.0], ["88", "95", 0.0], ["102", "110", 0.0], ["127", "143", 0.0], ["145", "158", 0.0], ["164", "181", 0.0], ["288", "333", 0.0], ["338", "352", 0.0], ["361", "375", 0.0], ["376", "410", 0.0], ["512", "520", 0.0], ["536", "577", 0.0], ["583", "591", 0.0], ["701", "715", 0.0], ["724", "732", 0.0], ["734", "744", 0.0], ["750", "758", 0.0], ["818", "831", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.spotify.music", "usage_freq": "daily", "text": "I can change the audio and podcast quality on this screen and set my customized preferences to Autoplay, Change language, content restriction, streaming quality, offline download quality, and offline downloaded file location. I can also customize my hearing experience using an equalizer setting. With this feature, I can change the sounds like rock, jazz, pop, and so on. I can also turn on the private session using this screen, where I can listen to my favorite songs and podcast secretly and anonymously without saving my history and activity. This is an excellent feature of this app. Using language preference, I can choose multiple languages to listen to my favorite mesmerizing music even if I don't understand the meaning of the lyrics.  I can also choose to show the lyrics of the songs I listen. This is also an excellent feature. Here, I can listen and sing together. I love this feature.", "part2_false_pos1": "1", "scenario_id": "MAS-R-108", "risks": [["17", "22", 1.0], ["27", "42", 0.0], ["80", "91", 2.0], ["112", "120", 0.0], ["122", "141", 3.0], ["143", "160", 0.0], ["170", "186", 1.0], ["211", "224", 5.0], ["250", "268", 1.0], ["307", "314", 0.0], ["333", "339", "N"], ["345", "349", "N"], ["351", "355", "N"], ["404", "411", 2.0], ["465", "470", "N"], ["475", "482", 1.0], ["526", "533", 4.0], ["538", "546", 4.0], ["639", "648", 1.0], ["686", "691", 2.0], ["738", "744", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.myfitnesspal.android", "usage_freq": "daily", "text": "My fitness app is used for our fitness goal it is so similar and very interested.The information provided helps me for my health goals. My Fitness Pal is a smartphone app and website that tracks diet and exercise. The app uses gratification elements to encourage adherence to exercise and diet goals. To track nutrients, users can either scan the bar codes of various food items or manually find them in the app's large pre- existing database. My Fitness Pal will calculate the number of calories you've consumed from food and burned from exercise and let you know how many calories you Our BMR calculator will calculate your Basal Metabolic Rate, or the number of calories your body would burn if you stayed in bed all day.This app, once upon a time, was a great aid to my own weight loss. Over time, more and more of the features were, one by one, blocked by a pay wall. Now, just to use some of the features I loved, such as scan by barcode, it's pay only and with other subscriptions I'm paying for already and for basic features that used to be free, 19.99 a month feels steep. ", "part2_false_pos1": "1", "part2_false_pos10": "1", "part2_false_pos19": "1", "scenario_id": "MAS-R-109", "risks": [["31", "43", 1.0], ["122", "134", 2.0], ["195", "199", 2.0], ["204", "212", 1.0], ["227", "249", 2.0], ["289", "299", 1.0], ["310", "319", 2.0], ["347", "356", 1.0], ["368", "378", 2.0], ["434", "442", 1.0], ["488", "496", 2.0], ["497", "538", 1.0], ["565", "582", 2.0], ["626", "646", 1.0], ["651", "683", 1.0], ["690", "694", 2.0], ["778", "784", 1.0], ["823", "831", 2.0], ["936", "943", 1.0], ["974", "987", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.socialnmobile.dictapps.notepad.color.note", "usage_freq": "daily", "text": "This is basicly one of the few screens the app even has, i wanted a very basic app to use as a note book of sorts where i can manage my budget and write down important information. This screen is what i use to cycle through different color notes depending on what i am writing down to remember. important is things like medical instructions, reminders to pick up medications, peoples phone numbers or doctors appointments or just general things to remember that are of priority to me. Bills is where i manage my monthly finances and you can see that in the background. Amazon stuff is where i put monthly supplies i i need to buy from Amazon things like hand sanitizer trash bags. It doesn't always have to be from Amazon i could buy them from other areas but i just do most my shopping from Amazon so i it's named that for the moment. It's basicly my grocery and needed item list. I can sort them buy priority for instance sort by date will mean they are sorted by last input so if something is important and i just added it important in red will at the top like it is now. There is also different brackets like Notes, Colander and its current setting ALL i don't use these since they seem to all do the same thing and i just leave it on ALL. The color can be changed and change the color to things that are the most important. I wanted a simple system and i choose one.", "scenario_id": "MAS-R-110", "risks": [["95", "104", 1.0], ["136", "142", 2.0], ["234", "245", "N"], ["320", "340", 5.0], ["342", "351", 0.0], ["363", "374", 5.0], ["384", "397", 5.0], ["401", "421", 5.0], ["520", "528", 2.0], ["605", "613", 1.0], ["654", "679", 5.0], ["852", "859", 0.0], ["871", "880", 2.0], ["902", "910", 2.0], ["932", "936", 2.0], ["1284", "1289", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.healthifyme.basic", "usage_freq": "monthly", "text": "I want gain a weight. This app shows my current weight and gaining weight, My active level It is very helpful for me. It contains a Nutrition goal my daily calorie budget like protein level, carb, fats and fiber level How many Grams I want to eat for my weight gain. It shows How many glass of water I want to drink it is very useful for me.  How many steps I want to walk It also shown In the page. I followed This activity for my goal settings.  This app is very helpful for me. It shows a all details in the page. This app gives a daily information's about my health very well. I followed all the given activity I really gain some weight. I can feel it. In this app this page is very important and useful page. I am really happy with this app. It very helpful for me.", "scenario_id": "MAS-R-111", "risks": [["67", "73", 1.0], ["78", "90", 0.0], ["156", "170", 1.0], ["176", "189", 1.0], ["191", "195", 0.0], ["197", "201", 1.0], ["206", "211", 2.0], ["212", "217", 1.0], ["254", "265", 1.0], ["276", "318", 1.0], ["343", "372", 0.0], ["416", "424", 1.0], ["432", "445", 0.0], ["540", "569", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.facebook.katana", "usage_freq": "weekly", "text": "To use and control what apps I have connected to my Facebook account I use this screen. In order to get there, I open Facebook and go to account settings. I open the Security and Privacy settings, then select the Apps and Websites to view this information. I can them view my Facebook login apps and websites. Anytime you use Facebook connect it shows up here. From here I can disconnect any apps or websites I no longer use. It lets me know who has access and by clicking an item I can choose to stop sharing information and remove access. I can also remove old accounts that are no longer active and keep my security and privacy more safe. It also will easily let me view any suspicious logins and connected apps and websites. Then I can remove them. Personal privacy is important to me, so I like to manage my connected apps pretty strictly. ", "scenario_id": "MAS-R-112", "risks": [["52", "60", 4.0], ["61", "68", 3.0], ["137", "153", 4.0], ["187", "195", 3.0], ["213", "217", 4.0], ["222", "230", 4.0], ["276", "295", 3.0], ["300", "308", 4.0], ["446", "456", "N"], ["563", "571", 3.0], ["610", "618", "N"], ["623", "630", 4.0], ["689", "695", 4.0], ["753", "769", 4.0], ["823", "827", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.facebook.katana", "usage_freq": "daily", "text": "I use this screen to be able to look at things for rent, sale, or for free in my local area. What my goal is that I am trying to achieve when I visit this screen is looking for something gently used either for free or at a discount to what it would cost me to buy new. Often this is household items or something for my children. I have also used it to look at hte local housing market and rentals available. My interactions with this screen are usually needing to set the search radius from my location as well as sorting through the categories that I am looking at. I am also able to just search for the item name directly as you would in any other marketplace. The information the app uses to support this screen is my location as well as my profile name and photo. ", "part2_false_pos1": "1", "part2_false_pos2": "1", "part2_false_pos5": "1", "scenario_id": "MAS-R-113", "risks": [["40", "55", 2.0], ["57", "61", 2.0], ["87", "91", 3.0], ["177", "186", "N"], ["283", "298", 1.0], ["364", "377", 3.0], ["378", "384", "N"], ["389", "396", "N"], ["472", "485", 3.0], ["534", "544", "N"], ["605", "614", "N"], ["721", "729", 3.0], ["744", "756", 4.0], ["761", "766", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.facebook.katana", "usage_freq": "daily", "text": "I use this screen to see what friends are doing. I can see activities in my town happening. I can get the news from around the world. I keep in touch with family and friends. I use facebook to run my business and find new customers. I run ads for products that I sell online such as t shirts and hoodies. I am always aware of what is happening in my community because people in the area will post about it. I follow all the local and major news organizations so that I can know what is going on in the world around me. I use paid ads to promote products that I sell online and in person. I post links to my very own website to gain new customers for my internet marketing business. I could not imagine living today without this app and the possibilities it opens up", "scenario_id": "MAS-R-114", "risks": [["59", "69", 1.0], ["76", "80", 1.0], ["106", "110", 0.0], ["166", "173", 0.0], ["181", "189", 2.0], ["200", "208", 1.0], ["222", "231", 1.0], ["247", "255", 0.0], ["285", "291", 0.0], ["296", "303", 0.0], ["350", "359", 0.0], ["440", "458", 1.0], ["530", "533", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "This is the screen on my apple health app that allows me to see my average walking and running distance each day.  I can look at the previous day, week, month, or even year and see what trends I have had.  The goals that I want to achieve through this screen are to better track how much I ran that day.  I can look at the trend of my walking distance or my running distance and see if i am meeting my goals.  My interactions with this screen to achieve my goals is I use it to monitor my progress and see if i am walking enough or running enough throughout the day.  The information that is used by this app to support this screen includes information such as my workouts that are logged, the numnber of steps walked, my biometric data such as heart rate and steps walks.", "part2_false_pos3": "1", "part2_false_pos6": "1", "scenario_id": "MAS-R-115", "risks": [["67", "94", 0.0], ["95", "103", 0.0], ["104", "112", 0.0], ["181", "203", 0.0], ["279", "302", 0.0], ["323", "328", 0.0], ["335", "351", 0.0], ["358", "374", 0.0], ["489", "497", 0.0], ["506", "565", 0.0], ["664", "672", 0.0], ["722", "736", 0.0], ["745", "755", 0.0], ["760", "771", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/fitbit-health-fitness/id462638897", "usage_freq": "daily", "text": "I use this screen to monitor my weight and see if I am making progress. My goal is to loose weight. I check it regularly to make sure it is updating and that I am staying on task.  Someday and weeks I do not look at it at all or I will forget to wear my watch because I have taken it off to charge.  I also look to see how long I have been trying to reach my goal.  I like to walk so I look back at locations and I also look to see if I know anyone in my community.  Its fun to see badges and trophies I may have acquired but sometimes I feel like this informaiton is very personal and is not what I want the world to see.d  I also like to track my step count each day and try to exceed it if I can. ", "scenario_id": "MAS-R-116", "risks": [["32", "38", 4.0], ["62", "70", 4.0], ["254", "259", 4.0], ["319", "363", 4.0], ["399", "408", 4.0], ["455", "464", 4.0], ["482", "488", 4.0], ["493", "501", 4.0], ["649", "659", 4.0]]}, {"app_url": "https://apps.apple.com/us/app/capital-one-mobile/id407558537", "usage_freq": "weekly", "text": "I use this screen to manage and view the contact information and bank account linked to this specific Zelle profile. To get to this screen, I open the app and chose \"Profile\" and then \"Zelle\". Here I can unlink my email address, link a new one, and link, unlink and register my phone number. It's useful not only to edit this information but also to view it in order to ensure that I'm using or supplying someone else with the correct information in order to receive a payment. Sometimes I've had to do this when sending payments to myself from another bank account, as I have had several bank accounts that at times have shared or used similar contact information. I don't think both a email and phone number are required to use Zelle but I assume that it can be helpful. If you click the \"i\" icon in the top right corner of the container labeled \"Additional contact info\" you will see a brief description of this feature. ", "scenario_id": "MAS-R-117", "risks": [["41", "60", 2.0], ["102", "115", 2.0], ["214", "227", 2.0], ["469", "476", 2.0], ["521", "529", 2.0], ["553", "565", 2.0], ["589", "602", 2.0], ["687", "692", 1.0], ["697", "709", 2.0], ["860", "872", 2.0], ["915", "922", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.ubercab", "usage_freq": "monthly", "text": "I use this screen to check past trips I have taken, which has a number of uses. First off it logs the amount each trip cost, which I use to keep track of my budget and for my taxes if I ride for work purposes. The other major use it has is that rebook button on the right. Sometimes I cancel a ride to adjust the time, like maybe I reserved a ride but I want to do it 30 minutes later. Other times maybe I just need to make the same trip I've made before. Well, with this screen I can just come to the Activity section and hit rebook. That way I don't need to figure out all the same details, type in all the addresses and time and whatnot like the first time. However it does keep the addresses of where I go and when, like an alibi lol. But I don't want to display my home address. In fact even the map kinda reveals where I am...", "scenario_id": "MAS-R-118", "risks": [["32", "37", 5.0], ["98", "123", 1.0], ["157", "163", 2.0], ["175", "180", 4.0], ["343", "347", "N"], ["433", "437", 2.0], ["609", "618", 5.0], ["699", "709", 4.0], ["770", "782", 5.0], ["801", "804", "N"], ["819", "829", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.foxnextgames.m3", "usage_freq": "daily", "text": "I really like to use this screen as an overview for my progress in this app. It shows my username/ user id and a spot where i can change it if i so wish. Also It allows me to achieve the goal of maintaining my overall score. With this information i can stay up to date with my progression and standings of all areas of the game, those are the main goals i like to achieve here, have all information needed all in one place. The information on this screen is used by the app to know my player id/username and overall statistics and strength of my characters. If i make any changes the app automatically collects and stores the updated information for me so i do not have to do anything myself.  Thus Its my favorite because it is used as a tool to help me grow stronger. ", "scenario_id": "MAS-R-119", "risks": [["55", "63", 2.0], ["99", "106", 2.0], ["218", "223", 1.0], ["277", "288", 2.0], ["293", "302", 2.0], ["310", "327", 2.0], ["485", "494", 1.0], ["495", "503", 1.0], ["516", "526", 1.0], ["531", "542", 1.0], ["546", "556", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.walmart.android", "usage_freq": "monthly", "text": "I use this screen to look through orders and to see when they are going to arrive. It needs my name and address to be able to track these orders, naturally. It's also useful to remember which items are about to arrive and what I've ordered already. Without this screen I would have no way of looking through the different orders or to know when orders will arrive. It also allows the returns and other information about orders available. Often, Walmart will run out of an item and they will substitute another item. Often the changed item isn't very good, so in this page you can tell reject the subbed items before the delivery is made. This app is a very efficient way of looking through orders on the go and unlike many other apps, doesn't constantly having me wishing I was using the desktop version instead. This screen and by extension this app help me reach my shopping goals and needs.", "scenario_id": "MAS-R-120", "risks": [["34", "40", 2.0], ["62", "74", "N"], ["95", "99", 1.0], ["104", "111", 2.0], ["186", "217", 3.0], ["222", "247", 3.0], ["472", "476", 2.0], ["596", "602", "N"], ["603", "608", 2.0], ["868", "882", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/discord-chat-talk-hangout/id985746746", "usage_freq": "daily", "text": "This screen allows you to change your Username, which can be done at any time and works in tandem with servers you may be on. (Certain servers may ask that you change your username to match the theme, or for identification purposes within that community you have joined.) It allows you to change your password, or to input a phone number should you need to recover your account due to account theft or anything else that may occur that compromises your account's safety. This page also allows you to enable security measures to protect your account from unwanted access. You can also use this page to manage blocked users who you no longer want to be able to contact you, you may also disable your account here. You interact with this screen by selecting which option you need and following the prompts after to confirm or cancel changes. You can also disable your account, should the need arise, or delete it. The information that is used to support this screen is usually access to your email address, phone number or authentication device program that is on your phone that confirms that you are who you say you are. This screen is primarily for managing your safety as well as limiting or allowing people to contact you. Anything on this screen is interactable so I would typically click on Username, and it would allow me to change my username in a pop up that arises or a different screen. It may ask for confirmation to get there.", "scenario_id": "MAS-R-121", "risks": [["38", "46", 5.0], ["194", "199", "N"], ["244", "253", 4.0], ["301", "309", 5.0], ["385", "398", "N"], ["453", "460", 5.0], ["507", "524", "N"], ["563", "569", "N"], ["616", "621", "N"], ["989", "1002", 5.0], ["1004", "1016", 5.0], ["1020", "1049", "N"], ["1066", "1071", 5.0], ["1340", "1348", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.airbnb.android", "usage_freq": "monthly", "text": "I use this screen to have my updated contact information on how others can reach me.  I keep it updated so that when I make reservations the hosts can contact me and I can contact them.  I regularly book on Air Bnb because it is  a good site that I have a lot of trust in.  I use it often and I like the places that I have stayed at.  I would gladly use it more in the future.  I am open to giving out my information  because I need to in order for people to contact me about places.  I like having my location and information private sometimes but if I want to use Air BNB I need to consent to this procedure.  I am willing to do this because I trust  the site and I have used it in the past. ", "scenario_id": "MAS-R-122", "risks": [["37", "56", 2.0], ["60", "70", 3.0], ["75", "80", 3.0], ["141", "146", 2.0], ["304", "310", 2.0], ["449", "455", 2.0], ["502", "510", 3.0], ["515", "526", 3.0], ["657", "661", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/draftkings-fantasy-sports/id710535379", "usage_freq": "monthly", "text": "I want to be able to achieve good data information pulling from this picture. It will explain and be very detailed on how the tournaments and matches are played today! It is very important to read each detail very carefully and to extract the correct guess and data from the pool. I want to be able to predict the outcome of the matches pretty efficiently and to be able to predict the next outcome winners. I am able to choose the correct option by looking at the screenshot homepage and to find which matches to bet on, whether its based on data or just straight gambling. I most importantly, want to be able to be confident in this ability so I am better suited in the future when I come across this problem again. This practice is very good and can lead to great habits when it comes to betting.", "scenario_id": "MAS-R-123", "risks": [["34", "50", 3.0], ["126", "137", 3.0], ["142", "149", 3.0], ["150", "166", 3.0], ["202", "208", 3.0], ["251", "256", 3.0], ["314", "321", 3.0], ["391", "406", 3.0], ["543", "547", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.relayrides.android.relayrides", "usage_freq": "yearly", "text": "I use this screen to change my contact preference.  From here I adjust my setting for email, phone contact, payment, and other things like this.  I can put in credit card information so that I can pay people for cars that rent.  I use this screen to get to messages where I can contact the people who I am renting from.  I can then communicate with the person and send payments automatically.  This screen allows me to receive messages and continue to build my own profile.  This page is easy to navigate and easy to update.  When I don't use the app after a certain amount of time I am signed out and stop getting the notifications.  I can also control notification from here and that is good because I don't like getting a lot of notifications.  I like to be able to turn things off.  ", "scenario_id": "MAS-R-124", "risks": [["31", "49", 1.0], ["74", "81", 2.0], ["86", "91", 2.0], ["93", "106", 2.0], ["108", "115", 2.0], ["159", "182", 2.0], ["201", "207", 1.0], ["212", "216", 1.0], ["217", "226", 1.0], ["306", "313", 1.0], ["353", "359", 1.0], ["369", "377", 2.0], ["427", "435", 2.0], ["465", "472", 1.0], ["654", "666", 2.0], ["732", "745", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.gm", "usage_freq": "daily", "text": "This is the page where I can control which notifications I get.  I like to use this page to control the amount of email notifications and  the sounds that my phone makes when I get new emails.  I can also use this page to figure out what to do with my attachments and where to send them.  I don't like getting too many attachments because I worry about viruses and other mal ware that is in many attachments now days.  I can also use this page to access and set up my spam folder.  This is very helpful because I receive many messages now days that are spam.  There is an abundance of spam messages and it is annoying to always be filtering through these emails and trying to navigate the categories.  I like to have the spam messages filtered and moved away quickly.   ", "scenario_id": "MAS-R-125", "risks": [["43", "56", 2.0], ["104", "113", 2.0], ["114", "133", 1.0], ["143", "149", 0.0], ["158", "163", 3.0], ["185", "191", 3.0], ["319", "330", 4.0], ["353", "360", 1.0], ["468", "479", 1.0], ["526", "534", 2.0], ["553", "557", 1.0], ["585", "598", 1.0], ["689", "699", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/myfitnesspal-calorie-counter/id341232718", "usage_freq": "daily", "text": "So this screen shows my starting weight on the date that I first started using the app. When looking at this screen I can see how my weight has changed and even update my goals such as the goal weight and how much weight to lose each week. I do also use this screen to access my nutrient goals, which I customize to my current recommended diet plan (such as fiber, sodium, calorie customization, and sugar grams). With this screen you can also access your macronutritent percentage goals if you have a change you need to make other than the recommended guidelines. I do not like that you cannot change your goal weight to under a specific BMI. I can see how long it's taken me to lose weight by calculating the time between the current date and the starting weight date and that makes me either feel accomplished or depressed depending on the day.", "scenario_id": "MAS-R-126", "risks": [["24", "39", 5.0], ["47", "51", 3.0], ["171", "176", 5.0], ["189", "200", 4.0], ["205", "238", 1.0], ["279", "293", 2.0], ["339", "348", 2.0], ["358", "363", 1.0], ["365", "371", 1.0], ["373", "394", 5.0], ["400", "411", 1.0], ["456", "487", 1.0], ["553", "563", 1.0], ["685", "691", 5.0], ["758", "769", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.sportclips.ultimatemvp", "usage_freq": "monthly", "text": "This is for the shop where I often get my hair cut. They don't take reservations in the traditional sense. When I'm ready for a haircut, I open the app and select the store that I want to go to. That takes me to this screen where I can see how long the current wait time is, a list of the stylists that are working, and if it's just for me or if I'm bringing in additional people. If I want a specific stylist then I can see next to their name how long the wait is just for them. Then I can decide if I really want to wait for them or just take the next available, etc. Once I do all that, I hit the \"check in\" button at the bottom. Once I do that it is similar to making a reservation, but the app tracks my location so it knows when I am near the store. If I'm close then the stylist I selected (or whichever one is available if I selected that) will wait for me to arrive.", "scenario_id": "MAS-R-127", "risks": [["16", "20", 0.0], ["42", "50", 0.0], ["128", "135", 0.0], ["167", "172", 0.0], ["240", "273", 0.0], ["289", "297", 0.0], ["303", "314", 0.0], ["320", "339", 0.0], ["347", "379", 0.0], ["439", "443", 2.0], ["444", "478", 0.0], ["518", "522", 0.0], ["674", "685", 0.0], ["709", "717", 3.0], ["778", "785", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.todoist", "usage_freq": "daily", "text": "This is the main screen I use on todoist for tasks I should do. My goals for this screen is to add and complete goals I add, or categorize them into subgoals to help clear up my inbox. I mainly use the big red button to add goals on nearly anything, sometimes even to just save my thoughts for later. I tap the circles next to the task when I complete the task. I can also sort by date and tags as well but I usually don't bother with that. I focus on recently added tasks first. Under the hamburger menu there is a variety of options for sorting and tagging which I have setup but don't use that often, mostly for more long term and less inane goals and tasks. I try to look at this screen multiple times a day and work from the tasks, and often write down things before bed to clear my mind. ", "scenario_id": "MAS-R-128", "risks": [["45", "50", 4.0], ["149", "157", 3.0], ["224", "229", 4.0], ["356", "360", 4.0], ["381", "385", 3.0], ["390", "394", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.dd.doordash", "usage_freq": "weekly", "text": "Before I place an order within this app, I come right to this page, because I check to see whether I have earned any credits that I could then apply to my upcoming order. This is in the section that is named \"DoorDash Credits.\" There could be a monetary amount there, or a promo code that is active for me. I can select either the credits, the promo codes, or both of them. The app then applies that to my cart and takes my payment information for the upcoming order, which is found at the very top of the app section that is named \"Saved Payment Methods.\" Once I am done, I go and I select what I want to get with the applied credits and promo codes, schedule a time for the delivery to be made, and I officially place the order. The app applies everything, uses my payment information to complete the rest of what is due with my default credit card. My name and my address are also used for the delivery driver to then complete the delivery of the order directly to me.", "scenario_id": "MAS-R-129", "risks": [["117", "124", 5.0], ["218", "225", 5.0], ["245", "260", 3.0], ["273", "283", 5.0], ["406", "410", "N"], ["461", "466", 3.0], ["539", "554", 5.0], ["639", "650", 5.0], ["676", "684", "N"], ["767", "786", 5.0], ["811", "822", "N"], ["831", "838", "N"], ["839", "850", 5.0], ["855", "859", 4.0], ["867", "874", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/spotify-music-and-podcasts/id324684580", "usage_freq": "daily", "text": "This is my main hub for what I listen to the majority of the day.  I mainly listen to podcasts when I use Spotify, so I will go to my \"New Episodes\" section and select the episodes from the subscriptions I have that I want to listen to, then I download them, and wait for them to finish.  Once their downloaded I go to my \"Your Episodes\" tab and begin to listen.  As I complete episodes they are marked as completed, then I remove the download to preserve space on my phone.  Occasionally I go to the home or search tab to look for new music, but I have a large amount of songs that I have \"Liked\" that are my go-to's.  When I feel like listening to music instead of podcasts, I normally go to my Like Songs and click shuffle and see what pops up.", "scenario_id": "MAS-R-130", "risks": [["31", "37", "N"], ["139", "147", 0.0], ["190", "203", 0.0], ["378", "386", 0.0], ["572", "577", 0.0], ["650", "655", 0.0], ["667", "675", 0.0], ["697", "707", 0.0], ["734", "746", "N"]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "I have a very important goal of climbing up at least 3 flights of stairs each day.  This app screen shows my progress towards that goal in that it tracks how many flights of stairs that I climb each day.  I can then filter out by day, week, month, or even by the year.  The goals that I want to achieve through this screen is to track how many flights of stairs that I am climbing each day and tracking my progress towards my goals.  My interactions with this screen to achieve these goals is to look at it and ensure that I am climbing the right number of stair cases each day.  The information that is used by the app to support this screen includes by biometric data such as movement and heart rate.  I can also personally log information on the backend that this screen can use.  ", "part2_false_pos1": "1", "part2_false_pos6": "1", "scenario_id": "MAS-R-131", "risks": [["66", "72", 0.0], ["154", "202", 0.0], ["335", "389", 0.0], ["406", "414", 0.0], ["426", "431", 0.0], ["557", "568", 0.0], ["655", "669", 0.0], ["678", "686", 0.0], ["691", "701", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "As a user of the Apple Health app, I have found it to be an essential tool for managing and tracking my overall health and wellness. I use it to set and monitor my daily activity goals, including steps taken, distance traveled, and calories burned. I also track my nutrition by logging my meals and water intake. Additionally, I use the app to track my sleep patterns, as well as my calorie burning numbers.\r\n\r\nMy health app summary screen provides me with an overview of my daily activity, nutrition, and sleep patterns. This allows me to quickly see how I am doing in terms of meeting my goals and making progress towards my overall health and wellness goals.\r\n\r\nI interact with the Apple Health app several times throughout the day, checking in on my progress and making updates as necessary. This app has helped me to develop healthier habits, such as drinking more water, getting more exercise, and getting better sleep.\r\n\r\nThe information used by the Apple Health app comes from a variety of sources, including my Apple Watch, my iPhone, and third-party apps that I have connected to the app. This information is then aggregated and displayed in an easy-to-understand format, allowing me to make informed decisions about my health and wellness. Overall, I have found the Apple Health app to be an incredibly valuable tool in helping me to achieve my health and wellness goals.", "scenario_id": "MAS-R-132", "risks": [["104", "131", 0.0], ["170", "184", 0.0], ["196", "201", 0.0], ["209", "217", 0.0], ["232", "240", 0.0], ["289", "294", 0.0], ["299", "311", 0.0], ["353", "367", 0.0], ["383", "406", 0.0], ["421", "432", 0.0], ["481", "489", 0.0], ["491", "500", 0.0], ["635", "660", 0.0], ["754", "762", 0.0], ["870", "875", 0.0], ["890", "898", 0.0], ["1356", "1375", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.photos", "usage_freq": "daily", "text": "I use this screen when I want to share photos with other people, especially a large number of photos. I use it to share photos I've taken, as well as share photos with a family member who wants prints, but doesn't yet know which photos they want prints of. To achieve this, I click on 'Sharing' in Google Photos to get to this screen, and then I'd select 'Create shared album'. If I have one already created that I want to share again or with another person, I'll click on the particular album, and then click on the plus sign under that album's name, which enables me to add people to share it with. When I use this screen, I have to enable it to have access to my camera and contacts in order to share anything. A person I shared photos with, or I myself, sometimes also will edit albums. For example, when I need to make prints for a family member, I or they will click 'like' on the particular image to indicate that's what they want printed. It's a lot easier than other ways.", "scenario_id": "MAS-R-133", "risks": [["39", "45", 5.0], ["177", "183", 5.0], ["241", "255", 3.0], ["305", "311", 5.0], ["370", "375", 5.0], ["546", "550", 4.0], ["576", "582", 5.0], ["666", "672", 2.0], ["677", "685", 5.0], ["783", "789", 5.0], ["824", "830", 5.0], ["898", "903", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/chase-mobile-bank-invest/id298867247", "usage_freq": "daily", "text": "This page is basically my spending and usage of my money in the bank. It shows how much I have spend and how much I have earned through various jobs I have done. I can set a goal of certain usage limit of my money by clicking on SET A NEW GOAL button on the top. Then I can enter a number that I want to keep my spending under. The app will remind me everytime I will go over the limit and usage of the money. The interactions described before is how I would track my usage of my money and my spending and earning information. The information that the app collect is a part of this screen. And they may share these information of my bank usage to third party which I do not want them to do in any circumstances. They combine my profile information combined with my usage data also my contacts and could share to third parties. ", "part2_false_pos10": "1", "scenario_id": "MAS-R-134", "risks": [["51", "56", 4.0], ["64", "68", 5.0], ["79", "100", 3.0], ["105", "160", 4.0], ["190", "201", 3.0], ["282", "288", 4.0], ["414", "426", 3.0], ["468", "473", 4.0], ["493", "501", 5.0], ["514", "525", 5.0], ["633", "643", 4.0], ["728", "747", 4.0], ["765", "775", 4.0], ["784", "792", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=net.daylio", "usage_freq": "daily", "text": "I use it to track my current goal progress as well as get a good overview of where my mood is at. This page is helpful as you can get to all the relevant information from the homepage so it makes it easier not having to jump all around. I use this as more of a hub so I can access the calendar and stats, and I try to track my mood at least twice a day. To track your mood you click the plus icon and then pick from a list of moods and then rate your day. You can also add pictures from this screen which is helpful as pictures make days more recognizable when you're looking back on the days a few months/years later. Daylio is my favorite app and has definitely changed my life. The home page screen may not look like much, but once you get used to it it's great. ", "scenario_id": "MAS-R-135", "risks": [["29", "42", 2.0], ["77", "96", 2.0], ["285", "293", 4.0], ["298", "303", "N"], ["368", "372", 2.0], ["426", "431", 2.0], ["451", "454", 3.0], ["519", "527", 5.0], ["533", "537", 2.0], ["619", "625", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/steam-mobile/id495369748", "usage_freq": "weekly", "text": "So basically what this screenshot shows is my wish-list which currently only consists of one game. Steam uses this information as usage data, and realizes since the game in my wish list can be sort of taken for a sports game, they are probably going to recommend me sports games from now on. As you can see in the search bar, they also realized I searched for a baseball game. They will keep this information and recommend me related games in the future. This is how they will use  this information and call it usage data. I personally use this wish list to purchase games when they release. For example, up until two weeks ago I had a boxing game on there called \"Undisputed\". It only recently released in beta form, and I was finally able to get out of my wish list and purchase. So you can definitely say that I use the wish list screen to plan the purchase of games before they release, although there are some exceptions like this baseball game.", "scenario_id": "MAS-R-136", "risks": [["46", "55", 0.0], ["93", "97", 0.0], ["130", "140", 0.0], ["176", "185", 0.0], ["213", "224", "N"], ["266", "278", 0.0], ["314", "324", 0.0], ["362", "375", 0.0], ["567", "572", 0.0], ["636", "647", 0.0], ["852", "860", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/facebook/id284882215", "usage_freq": "daily", "text": "When i launch the app the first thing i do is watch for stories and see if there is anything new to view, i scroll from left to right because sometimes the stories are not on the page so i have to go thru the old ones sometimes. Then i scroll down to my feed that's where i will see all relevant friends and people i follow and their posts. Sometimes i find it boring and just skip over most posts but the important ones i stop and read and sometimes i click like or the love button. Not always because sometimes i don't want them to think all i do is check facebook all day and click like on pictures because that would be embarresing. When i do reach the bottom which is mostly never because i don't scroll thru the entire feed . As long as i see the same thing repeated i stop ", "scenario_id": "MAS-R-137", "risks": [["156", "163", 2.0], ["296", "303", 4.0], ["308", "314", 4.0], ["315", "323", 3.0], ["392", "397", 4.0], ["558", "566", 4.0], ["593", "601", 5.0], ["725", "729", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instacart.client", "usage_freq": "weekly", "text": "Whenever I want to cash in on the rewards that I have earned or the promo offers that the app is offering, I come right to this section of the app. It will show me all of the benefits that I am able to use at this moment, and I can select which ones to apply, and it will also tell me when, and if, they expire, so that I know by when to use them, if applicable for that specific promotional offer. The interaction with the screen comes by way of selecting the promo that I want to use on the order that I am about to place, selecting my payment info on that page in case the promo does not pay off the entirety of the charges, and proceeding with my order. The app will then use my payment info, and on later screens, my full name and my address, in order to complete the full delivery of the order that I have placed to me.", "scenario_id": "MAS-R-138", "risks": [["34", "41", 3.0], ["74", "80", 3.0], ["175", "183", 3.0], ["295", "310", "N"], ["380", "397", 3.0], ["461", "466", 3.0], ["619", "626", 5.0], ["651", "656", 3.0], ["683", "695", 5.0], ["722", "731", 4.0], ["739", "746", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instagram.android", "usage_freq": "daily", "text": "I can easily switch accounts using this screen if I use multiple Instagram accounts. I can change or view my profile picture using this screen. I can also edit my profile and bio utilizing the edit profile option on this screen. I can share my profile link with anyone on Instagram. I can follow new people using this screen. I can see how many posts I posted before and how many followers I have and also I can see how many followed me. I can see my previous posts and videos using this screen. I can also remove the old posts. I can create a new post or new reel using this screen. I can add a story to my timeline. I can easily navigate to the homepage or search for anyone by using names and hashtags or I can watch new reels posted by my friends and unknown people by using the bottommost icons.", "scenario_id": "MAS-R-139", "risks": [["20", "28", 5.0], ["109", "124", 2.0], ["163", "170", 1.0], ["175", "178", 3.0], ["244", "256", 3.0], ["336", "366", 1.0], ["371", "396", 4.0], ["416", "436", 4.0], ["460", "465", 2.0], ["470", "476", 2.0], ["548", "552", 0.0], ["560", "564", 0.0], ["596", "601", 0.0], ["608", "616", 2.0], ["686", "691", 4.0], ["696", "704", 1.0], ["724", "729", 1.0], ["743", "750", 3.0], ["763", "769", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/hoopla-digital/id580643740", "usage_freq": "weekly", "text": "One this screen, you can view your currently checked-out audio- and ebooks, and listen to or read the ones you currently have checked out or renew those you have checked out in the past. I click on the titles of the books, and I can check them out again, if available, or I can play or open the audio/ebooks I currently have checked out. You can tap on the image of the cover, or on the title to the right of the picture. You can also tap on the author's name to see if there are other books by that same author available from your library. One you click on the book, you can check it out or play it by using the appropriate option. The book will automatically download to your phone and be reserved for three weeks. The app uses my library card number and library location to find what titles are available from my library and link it to my library account. ", "scenario_id": "MAS-R-140", "risks": [["52", "56", 4.0], ["57", "63", 4.0], ["68", "74", 4.0], ["102", "106", "N"], ["111", "185", 4.0], ["202", "208", 4.0], ["295", "300", 4.0], ["300", "307", 4.0], ["370", "375", 3.0], ["387", "392", 4.0], ["446", "452", 4.0], ["453", "454", "N"], ["455", "459", 4.0], ["486", "491", 4.0], ["492", "521", 2.0], ["532", "539", 4.0], ["637", "641", 4.0], ["733", "752", 5.0], ["757", "773", 5.0], ["782", "823", 3.0], ["842", "857", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/paceline-rewards-for-exercise/id1491824216", "usage_freq": "weekly", "text": "This screen is the home base where I can track my daily progress goals over the course of a month or more.  In an effort to descripe the goals i want to achieve through the screen, I would say that this screen is a snapshot telling me what my activity has been each day throughout the course of one month (or a longer duration of time).  In an effort to describe my interactions iwth this screen to achieve my goals, I would say that I look here in an effort to keep track of my goals and my progress in terms of what movement I have done over the past several days throughout the month.  In an effort to describe the information that is used by the app to support this screen, I would say that my workouts, my biometric data such as heart rate, and several other pieves of data.", "scenario_id": "MAS-R-141", "risks": [["56", "70", 1.0], ["137", "142", 0.0], ["235", "291", 0.0], ["366", "378", 0.0], ["492", "500", 0.0], ["581", "586", "N"], ["698", "706", 0.0], ["711", "725", 0.0], ["734", "744", 0.0]]}, {"app_url": "https://apps.apple.com/us/app/apple-health/id1242545199", "usage_freq": "daily", "text": "This is the page that shows my daily highlights of active energy on my app.  I have a goal of burning a certain number of active calories each day.  In an effort to describe the goals that I want to achieve through this screen, I would say tha tI want to track how many calories I ahve burned in the past few days, and whether I burned more active calories yesterday, than the day before.  My interactions with this screen in order to achieve my goals is to look at it and see whether or not I am meeting my goals of burning the right number of active calories each day and whether or not I am actively improving.  the information that is used by the app to support this screen includes several factors including logged work outs, biometric data such as heart rate, and how active I am.", "part2_false_pos1": "1", "part2_false_pos8": "1", "part2_false_pos11": "1", "scenario_id": "MAS-R-142", "risks": [["37", "57", 2.0], ["58", "64", 0.0], ["112", "118", 0.0], ["129", "137", 0.0], ["261", "313", 0.0], ["319", "387", 0.0], ["529", "560", 0.0], ["561", "569", 0.0], ["574", "612", 0.0], ["720", "724", 0.0], ["725", "729", 0.0], ["731", "745", 0.0], ["754", "764", 0.0], ["770", "785", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.piriform.ccleaner", "usage_freq": "weekly", "text": "It shows the amount of storage the app has cleared. The app clears storage by deleting unwanted media in my phone, repeating pics, cache memory and scans for large images that i can choose to delete if i wish so. The app clears those storage spaces, freeing up the phone, which makes the overall functioning and the performance of the phone relatively better and smooth in comparision to what it had been before the clean up. The app also clears the RAM memory. In all phones, including mine, there would be a ton of background apps running perpetually, which one do not need to have at any given time. The app scans the background to see which all apps are running in the background, singles out those that are not necessary, and gives me the option to shut down those apps, thereby releasing the memory that was hogged down by those apps.", "scenario_id": "MAS-R-143", "risks": [["13", "30", 1.0], ["67", "74", 4.0], ["96", "101", 3.0], ["125", "129", 4.0], ["131", "143", 3.0], ["164", "170", 4.0], ["234", "248", 3.0], ["265", "270", 2.0], ["450", "460", 3.0], ["469", "475", 3.0], ["528", "532", 2.0], ["639", "683", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/fitness/id1208224953", "usage_freq": "daily", "text": "I use this app specifically the one on the screen to see how much distance I covered walking each day. I want to keep track of my health by doing the required exercises in order for me to have a better and healthy lifestyle. It is a very valuable information for me. It is so helpful.    This app helps me to have the option to increase or decrease my daily walking activities. I get motivated when I see the chart goes up and when the numbers go up. I get notifications on my phone whenever I need to increase my walking distance and it also notifies me when I have met my required distance for the day. It is also fun and entertaining whenever I get notifications of getting achievement badges. I believe the app gets the information by syncing via my apple watch and thus it gets data and shows a chart on my app screen.", "scenario_id": "MAS-R-144", "risks": [["57", "101", 2.0], ["130", "136", 3.0], ["159", "168", 2.0], ["358", "376", 2.0], ["457", "470", 3.0], ["514", "530", 2.0], ["574", "591", 2.0], ["592", "603", "N"], ["677", "695", 2.0], ["800", "805", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.truebill", "usage_freq": "weekly", "text": "When using the Rocket Money app I am able to keep track of all of my expenses every month which highlights the income I have coming in and the bills and expenses I have going out. It keeps tracks of my bills and lets me know what bills I have coming up that are due and what the amount is. It also gives me insight on what income I have coming into my account within the same month. I am able to achieve my goals by being able to keep better track of my bills that are due each month. It connects with my bank account through a service called Plaid so it also updates when charges appear on my bank account. I also have the option to mark a bill as paid. Overall it helps me keep better track of my spending so I am able to have a better hold on my finances. ", "part2_false_pos3": "1", "scenario_id": "MAS-R-145", "risks": [["111", "117", 2.0], ["118", "134", 2.0], ["143", "148", 2.0], ["153", "161", 2.0], ["162", "178", "N"], ["225", "265", 2.0], ["270", "288", 2.0], ["318", "381", 2.0], ["573", "580", "N"], ["594", "606", 4.0], ["641", "645", "N"], ["699", "707", "N"], ["749", "757", "N"]]}, {"app_url": "https://apps.apple.com/us/app/venmo/id351727428", "usage_freq": "weekly", "text": "This screen shows me my crypto balance to track how much crypto currency I have and the value of it, as well as my cash balance directly in my venmo account. It also shows me my linked debit and credit cards.\r\n\r\nI use this page to track my cryptocurrency holdings - I don't really trade a lot but I hold some ethereum and bitcoin and I like to be able to check to see what the value of my holdings are. Sometimes I will buy more if the price is low, sometimes I will sell if the price has gone up a lot recently but I am not a serious daytrader or anything so venmo is fine. I also use it to check my cash holdings when people transfer me money.\r\n\r\nVenmo uses a LOT of my personal information obviously. This page is supported by my banking information, my crypto wallet information, and my transaction information. This app is also supported by access to my first and last name, and access to my contacts and friends elsewhere. ", "scenario_id": "MAS-R-146", "risks": [["24", "38", 5.0], ["48", "79", 5.0], ["115", "127", 5.0], ["143", "156", 5.0], ["195", "207", 5.0], ["240", "263", 5.0], ["309", "317", 5.0], ["322", "329", 5.0], ["377", "382", "N"], ["389", "397", 5.0], ["436", "441", "N"], ["601", "614", 5.0], ["639", "644", 5.0], ["672", "692", 5.0], ["733", "752", 5.0], ["757", "782", 5.0], ["791", "814", 5.0], ["869", "878", 2.0], ["897", "905", 5.0], ["910", "917", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/workit-fitness/id1570096202", "usage_freq": "weekly", "text": "I use this screen to keep track of my workout for the day. It allows me to view the sets and reps I have done for various exercises and gives me a good visual representation of my progress. I can also click on an exercise like 1. Reps 10 and it will take me to the exercise where I can then add another set if needed. Mainly I use this screen to get a better sense of what I did for the workout, what I might want to improve on for next time and how much weight I'm lifting. I also like the fact that I can go to any date on the calendar and get a breakdown of my workout for the day and in this case I have a breakdown of what I did today which better informs me about what I should be doing for my next workout. The app uses data that I manually input for each set which has how many reps and how much weight I am doing for a particular exercise to generate this log of information that I use.", "scenario_id": "MAS-R-147", "risks": [["38", "45", 3.0], ["84", "88", 3.0], ["93", "97", 3.0], ["122", "131", 2.0], ["180", "188", 4.0], ["265", "273", "N"], ["368", "394", "N"], ["396", "441", "N"], ["446", "473", 3.0], ["517", "521", 3.0], ["529", "537", "N"], ["670", "712", "N"], ["777", "790", 2.0], ["795", "847", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=bot.touchkin", "usage_freq": "weekly", "text": "This page is to scroll down and see all of your daily progress an conversations that you have with the app. It shows you what I have done each day including excersizes, moods, thoughts, diaries, and chatbot conversations. I come to this screen if I need to be reminded about conclusions on emotional things that I have sorted through before, and be reminded on how I had previously gotten over those issues in my personal life. The information comes from me writing to the chatbot which stores them into certain portions that you can come back to if you need a refresher. The app is used to get over personal problems and trauma and helps you to feel better in your daily life. It gives you someone to confide in without having the responsibility of \"paying them back\" for their help. I like it because to everyone else I am level headed, but the app tells a story of struggle in my everyday life!", "scenario_id": "MAS-R-148", "risks": [["54", "62", 5.0], ["66", "79", 5.0], ["157", "167", 0.0], ["169", "174", 5.0], ["176", "184", 3.0], ["186", "193", 5.0], ["199", "220", 5.0], ["290", "306", 3.0], ["361", "426", 5.0], ["600", "617", 5.0], ["622", "628", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/fitbit-health-fitness/id462638897", "usage_freq": "daily", "text": "I use this screen every day to keep track of how active I am and whether or not I am hitting my personal daily targets for the day. It also allows me to see if I need to start moving around a bit more, especially on days when I am more sedentary like on my off days on Sunday when I might not be as active but I still need to get my steps in because it will be food for me in the long run. What I want to achieve is just being more fit and healthy in general and this gives me a quick glance at where I am in the day and whether or not I a meeting my goals or not. I interact with it by looking at my stats and using that information to parse out if I am ahead or behind where I want to be from an activity level standpoint. I can also click on steps and get an average breakdown of how my day is going versus the past few days, weeks, or even my monthly average.", "scenario_id": "MAS-R-149", "risks": [["45", "60", 3.0], ["65", "110", 3.0], ["111", "118", 2.0], ["119", "130", 3.0], ["160", "195", 3.0], ["495", "516", 3.0], ["521", "563", 3.0], ["601", "606", 4.0], ["647", "670", 3.0], ["671", "706", 2.0], ["707", "712", 3.0], ["745", "750", 3.0], ["783", "802", 4.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.moimob.billplanner", "usage_freq": "weekly", "text": "To use this screen I input all of my bills, their amounts and when their due date is. It helps me keep things organized and know which bills have been paid and which are coming due. You can also change the due date to the following month to knock it down to the bottom of the list, so you're not confused with what bills have or haven't been paid. There is also an option to edit the paid date but so far I have not found this feature to work like it's intended to. I am also able to change the settings to input whether it's a recurring bill and if it's a bill that will be ongoing for the future. It's also easy to delete bills, add new ones or change existing information. I like the fact that you can easily edit the amount due to keep track of ongoing expenses each month. ", "part2_false_pos8": "1", "scenario_id": "MAS-R-150", "risks": [["37", "42", 1.0], ["50", "57", 1.0], ["62", "84", 1.0], ["160", "180", 0.0], ["206", "214", 1.0], ["310", "346", 0.0], ["384", "393", 0.0], ["427", "434", 1.0], ["495", "503", 1.0], ["513", "542", 0.0], ["547", "597", 1.0], ["721", "727", 1.0], ["749", "756", 1.0], ["757", "765", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.wunderground.android.weather", "usage_freq": "daily", "text": "This is the main screen and offers a wide range of information to give you as much information at a glance as possible. The top says which state and town it is showing you weather for. This is usually where you are at the time you are searching, but it can be changed to show anywhere in the world.\r\n Just below that is the warning system. Currently shows a winter storm coming, but really, its already here. The warning has been up since yesterday. Clicking it gives a full break down of the storm and what to expect.\r\nBelow that is the radar. This radar shows the movement and location of whatever weather is coming and going. Can see the storm moving by in this shot. The colors of the radar change, in this case its blue for snow.\r\nAt the bottom is a 10 day forecast of daily weather that you can scroll side to side. Gives all vital information for those days.", "scenario_id": "MAS-R-151", "risks": [["133", "183", 0.0], ["493", "498", 0.0], ["562", "627", 0.0], ["647", "656", "N"], ["762", "770", 0.0], ["774", "787", 0.0]]}, {"app_url": "https://apps.apple.com/ca/app/paypal/id283646709", "usage_freq": "weekly", "text": "When I used this screen I can look at what is in my wallet that I currently have with this app. I can also see what type of finances that are connected with PayPal. In this case, my Wells Fargo's account is connected to it. \r\nMy goal when I use this page is to get all my banks and financial things in order. This page keeps track of bank accounts and credit cards. It's an easy way to see what is linked with my PayPal and way for me to transfer money between the different types of accounts. It also has different promotions on it and gives me the ability to accept direct deposits from other businesses.\r\nThe information that the app uses is my financial information as well as my personal information. They need to confirm that the bank that I use is correct, and that my name fits the bank account.", "scenario_id": "MAS-R-152", "risks": [["38", "58", 5.0], ["111", "163", 4.0], ["182", "193", 2.0], ["196", "203", "N"], ["272", "277", 2.0], ["282", "298", "N"], ["334", "347", 3.0], ["352", "364", 1.0], ["413", "419", 1.0], ["447", "452", "N"], ["484", "492", "N"], ["516", "526", 1.0], ["568", "583", 0.0], ["595", "605", "N"], ["648", "669", "N"], ["684", "704", 0.0], ["736", "740", 1.0], ["776", "780", "N"], ["790", "802", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.fictionpress.fanfiction", "usage_freq": "daily", "text": "I use this screen to help navigate to stories I want to read. First I use the scroll bar or bottom tabs to navigate to the fandom or book that I want to read from. From there I can use the filters to navigate and filter through things like if it is a crossover between multiple different stories or franchises or add more specific filters. I can at the basics filter things alphabetically or by update time. I can also filter for things like word count, the type of content, the rating (E, Teens, Mature, etc), as well as the popularity through things like number of favorites, follows or the total word count. After choosing what story I like I can also favorite it to save it for later or download it so I can read it when I don't have wifi. Overall this is a page for navigating to find the stories I want to read. ", "scenario_id": "MAS-R-153", "risks": [["38", "45", 3.0], ["123", "129", 2.0], ["133", "137", 1.0], ["143", "162", 3.0], ["299", "309", 1.0], ["479", "485", 1.0], ["526", "536", 1.0], ["557", "576", 1.0], ["599", "609", 1.0], ["631", "636", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.grubhub.android", "usage_freq": "weekly", "text": "I use this screen in order to cash out on the benefits that I have earned over the last few weeks and months, primarily the rewards through previous purchases. I can apply these rewards to a brand new order and even combine them for separate orders. In order to cash out, I simply either select an option that has been unlocked for me as a result of my purchases, or apply a cash discount in the form of a discount or a promo code. The app will then use my full name in order to show who it must be delivered to, as well as taking my address and my profile picture down the line in my order, right before I place it and I confirm it. The ultimate goal is to have the food delivered to me at a discounted rate because of the rewards that I have earned on the app itself.", "scenario_id": "MAS-R-154", "risks": [["46", "54", 2.0], ["149", "158", 2.0], ["178", "185", 2.0], ["201", "206", 2.0], ["242", "248", 2.0], ["375", "388", 1.0], ["406", "414", 1.0], ["420", "430", 5.0], ["457", "466", 4.0], ["484", "498", 4.0], ["534", "541", 5.0], ["549", "564", 3.0], ["667", "671", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.srgroup.fastinghours.tracker", "usage_freq": "daily", "text": "I am trying to improve my heath and lose weight by using a fasting, diet and exercise regimen. This screen allows me to see my progress. I input my weight when I started and input it again periodically in order to keep track. The app has a timer that counts both up and down when I start a fast. At the end of the fast I save it in the app which allows it to produce the Recent Fast chart seen in the image. Also seen in the image is my BMI, which is still a bit high so I keep going with my fasts in order to get that down. It also shows me my longest fast, number of fasts and how many hours total I have fasted. Honestly I don't think that info is very useful for me because all I care about is losing the extra fat on my body. Unfortunately the screen doesn't show my weight, that is on another screen that also has a graph so I can't show it in just one screenshot. But this screen does use my weight information that I put in in order to calculate the BMI seen on this screen. If I want to see how the weight loss is proceeding I would tap where it says weight on this screen. ", "scenario_id": "MAS-R-155", "risks": [["26", "31", 2.0], ["41", "47", 1.0], ["59", "66", 0.0], ["68", "72", 2.0], ["77", "85", 2.0], ["127", "135", 2.0], ["240", "245", "N"], ["314", "318", 0.0], ["371", "377", "N"], ["378", "388", 0.0], ["559", "568", "N"], ["569", "574", 0.0], ["579", "613", 0.0], ["715", "718", 1.0], ["899", "917", 1.0], ["958", "961", 1.0], ["1008", "1019", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/tiktok/id835599320", "usage_freq": "daily", "text": "I usually use this screen to find people in my contacts on my phone or friends of friends that I might be interested in connecting with. Some goals that I want to achieve when I am on this screen is find new content to watch and also find new friends or people who might be interested in watching my content. It allows me to find and add friends that I didn't previously realize used tiktok and I can watch their content. To use this screen I usually scroll through and if I find someone that I am interested in I click the follow button on the right hand side of the screen. The information that is used by this app to support this screen is my contact information and I believe they also use my viewing habits and probably search history to find people that I would be interested in following or interacting with. ", "part2_false_pos6": "1", "scenario_id": "MAS-R-156", "risks": [["34", "40", 2.0], ["47", "55", 3.0], ["62", "67", 3.0], ["243", "250", 3.0], ["300", "307", 2.0], ["480", "487", 0.0], ["646", "665", 3.0], ["697", "711", 2.0], ["725", "739", 3.0], ["748", "814", 2.0]]}, {"app_url": "https://apps.apple.com/us/app/spotify-music-and-podcasts/id324684580", "usage_freq": "daily", "text": "this is where i first enter when i launch the app, i try to see whats new on the page sometimes the app numerates what i wants to listen and throws up something random or throws up something that it thinks i would like for that day. Most of the time its right on point and i usually play things that is on that page and rarely have to go into the playlists to find what i want. I sometimes scroll around to see if there is anything new which there rarely is because i am a person that likes to listen to things that i am very familiar with. Most of the time the app reads me out proper and knows exactly what i expect to see on the front page of the app. The podcast section is what i listen to at night right before bedtime usually lately ", "scenario_id": "MAS-R-157", "risks": [["64", "85", 0.0], ["114", "136", 0.0], ["151", "167", 1.0], ["288", "315", 0.0], ["347", "356", 4.0], ["504", "539", 1.0], ["659", "666", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.twitter.android", "usage_freq": "daily", "text": "I use the Topics screen to choose topics suggested by Twitter's algorithm with the goal of further personalizing my timeline. If I am interested in a suggested topic, I click on the plus sign to the right of it. From there, the suggested topics I chose are moved to the \"Followed\" category of the Topics page. If I am not interested in a suggested topic, I click on the gray X beside it and it is moved to the \"Not Interested\" category of the Topics page. The app uses my chosen suggested topics in other parts of Twitter, including the For You page and the Search tab. In the For You page, tweets that fall under my chosen suggested topics are shown to me as an alternative to showing me what the people I follow are posting. On the Search page, various phrases and hashtags that fall under the umbrella of my chosen suggested topics are shown to me.", "part2_false_pos2": "1", "part2_false_pos6": "1", "scenario_id": "MAS-R-158", "risks": [["10", "16", 1.0], ["116", "124", 3.0], ["348", "353", 1.0], ["591", "597", 3.0], ["689", "725", 4.0], ["734", "740", 2.0], ["755", "762", 2.0], ["767", "775", 2.0], ["828", "834", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.tayu.tau.pedometer", "usage_freq": "daily", "text": "What this screen provides is more than just verifiable data. While the settings allows the control of how the steps are tracked, this screen is the live and active usage tracker. It allows me to see the steps taken throughout the day on a graph that creates a visualization which is easy to analyze. This let's me know if I am on track towards my goals and where I am at so far. Ultimately I am trying to make sure I am walking enough every hour and this screen is the main indicative for that. Also it shows me my trends or habits because of the graphs, this allows me to make adjustments to reach my goals. The gps location or hardware sensors are what is going to provide the step reading functionality but one method uses more battery than the other. The limitation becomes how the application is running in the background. Overall I think the settings in this screen as well as visual indicators provide all the functionality I need to stay on track, manage my steps, and utilize the information towards any goals.", "scenario_id": "MAS-R-159", "risks": [["71", "79", 1.0], ["102", "127", 0.0], ["164", "169", 2.0], ["203", "208", 1.0], ["239", "244", 1.0], ["319", "352", 2.0], ["357", "377", "N"], ["515", "521", "N"], ["525", "531", "N"], ["617", "625", 1.0], ["679", "691", 0.0], ["782", "808", 0.0], ["812", "826", "N"], ["890", "900", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.dollargeneral.android", "usage_freq": "daily", "text": "This screen is used to find stores around you by utilizing your phones location tracker. The store uses this to find a store near you so that you can achieve optimal shopping experiences. I shop a lot at Dollar General so this really helps me find a store nearby and always be able to achieve what I want to. The app only uses your phones location to find this information.\r\n\r\nIt also helps as it can search for local ads which improves your shopping experience greatly. I interact with this screen weekly to find local stores to go to. It lets you personalize your shopping experience greatly to where you don't struggle with something that can be tricky. It also means you dont have to share your information with any other app. Like google or otherwise. The screen also allows you to input a zip code instead of having to allow location.", "part2_false_pos3": "1", "scenario_id": "MAS-R-160", "risks": [["28", "34", 1.0], ["71", "87", 1.0], ["166", "186", 1.0], ["250", "255", 1.0], ["332", "338", 1.0], ["339", "347", 1.0], ["418", "421", 1.0], ["442", "461", "N"], ["795", "803", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/pocket-casts/id414834813", "usage_freq": "daily", "text": "This is the first screen i see when i open up the app, this is perfect for me because i can see exactly what is new and what is old. If i see a red dot on the podcast i know right away there is new content available . I set it to download the content as it is released so i don't have to do it manually. I just love opening up my app and have everything ready for me. I pick something i want to listen to and listen to a few minutes of it , If i find that the show will not be any good today i move on to the next podcast and so on. Love the layout of the app because it makes it so easy to read and easy to navigate and find exactly what i am looking for and don't have to scroll around too much", "scenario_id": "MAS-R-161", "risks": [["104", "115", 0.0], ["120", "131", 0.0], ["243", "250", 1.0], ["460", "464", 1.0], ["514", "521", 0.0], ["634", "655", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.amazon.storm.lightning.client.aosp", "usage_freq": "monthly", "text": "On this screen you select any compatible device (Fire TV boxes or pendent, all models of Fire Stick, Fire Cube, Fire TV television, Fire TV Blaster, or Fire TV Recast) and then connect directly to it, in order to take control over it without using an actual, physical remote. It's useful in the instance of you having lost your remote, or you wanting to switch between multiple devices quickly using a single device (the app on your phone), so that you don't have to use multiple remotes or other ways of controlling said devices.\r\n\r\nYou can also set up new devices that are not already connected, or haven't been found automatically from within this screen by selecting the \"Set Up New Device\" option and then having it scan the area for other Fire family devices that are connected on the same local internet as the phone or tablet that the application is running on.", "scenario_id": "MAS-R-162", "risks": [["41", "47", 2.0], ["94", "99", 2.0], ["106", "110", 2.0], ["137", "139", 2.0], ["268", "274", 2.0], ["480", "487", 2.0], ["730", "734", 3.0], ["745", "756", 2.0], ["757", "764", 2.0], ["802", "810", 3.0], ["818", "823", 2.0], ["827", "833", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.collectrinc.collectr", "usage_freq": "weekly", "text": "This s a screen that displays the ability to add cards to my Pokemon card collection and how much each of the cards in my collection are worth combined.  I can interact with this screen and click on what cards I own and also decide to delete them from my collection if I no longer own them or increase the amount of cards I have in my collection. This page is helpful for showcasing their value and just where I can locate the cards that I want to add in including graded cards. I can interact with the ability to see cards available to purchase off eBay as well. The page is organized in a way that makes it accessible. I have a full view of Pokemon card sets that I can click on and I can complete collections by checking off cards that I have added or deleted to my collection. ", "scenario_id": "MAS-R-163", "risks": [["61", "84", 1.0], ["89", "151", 1.0], ["199", "215", 1.0], ["255", "265", 1.0], ["389", "394", 1.0], ["518", "523", 1.0], ["643", "660", 1.0], ["700", "711", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.ubercab.eats", "usage_freq": "weekly", "text": "The main goal of this screen, among others, is to access the benefits of the app that I have earned with my previous purchases on the app itself. Whenever my goal is to use a voucher that I have earned or to use my Uber Cash, I come directly to this portion of the app. I then select whether I want to use my Uber Cash or use a voucher, or I can even do both. It also logs my credit card information, as it may be needed to complete a transaction, should I not have enough to cover it with the vouchers and with the Uber Cash. My interaction consist mainly of selecting which methods I want to use, or to override a default setting from before. The app then combines my credit card info from this screen with my other identifying information down the line in order to complete my order.", "scenario_id": "MAS-R-164", "risks": [["117", "126", 3.0], ["328", "335", 5.0], ["376", "399", 5.0], ["435", "446", 3.0], ["494", "502", 5.0], ["516", "525", 5.0], ["576", "583", 0.0], ["624", "631", 0.0], ["670", "686", 5.0], ["718", "741", 5.0], ["780", "785", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/myfitnesspal-calorie-counter/id341232718", "usage_freq": "weekly", "text": " The goals that I want to achieve through the screen shown in the screen shot that I have submitted are to track my caloric intake by tracking my food each day.  My interactions with this screen in order to achieve my goals are to input my food information for each day and also better track what it is that I am eating so that I may keep track of my caloric intake and what I am eating each and every day that I use the app.  The information that is used by this app to support this screen is the food that I eat each and every day. This information is then processed and used in order to tell me what my estimated and/ or exact caloric intake has been for the day based on the food that I input within the app's interface when I decide to input", "part2_false_pos8": "1", "scenario_id": "MAS-R-165", "risks": [["240", "256", 0.0], ["292", "319", 0.0], ["351", "365", 0.0], ["370", "405", 0.0], ["498", "502", 0.0], ["503", "532", 0.0], ["624", "637", 0.0], ["638", "644", 0.0], ["645", "665", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.netflix.mediaclient", "usage_freq": "weekly", "text": "The Netflix history view screen helps me to better understand and manage my movie and TV show viewing habits. I use this screen to track what I watch, when I watched it, and how often I watch something. By taking a look at the history view screen, I can make more informed decisions on what I watch next. I can access the history view screen by clicking on a link in my profile or by selecting the “Viewing Activity” tab. From there, I am able to view a list of my past and current viewing activity. I can also sort my list by title, category, or date. Additionally, I can use the search feature to quickly locate a show or movie that I recently watched. The information used by the app to power the history view screen includes the titles of movies and shows that I have watched, when I watched them, and how many times I have watched them. Additionally, the app also records the date of the last time I watched a show or movie, so I can easily tell when I last watched something. By using the history view screen, I am able to keep track of the shows I have watched and better manage my viewing habits. This screen helps me to make more informed decisions", "scenario_id": "MAS-R-166", "risks": [["4", "11", 0.0], ["86", "108", 0.0], ["137", "149", 0.0], ["151", "168", 0.0], ["174", "201", 1.0], ["286", "303", 0.0], ["322", "334", 0.0], ["370", "377", 3.0], ["407", "415", 1.0], ["454", "489", 0.0], ["490", "498", 3.0], ["519", "523", 0.0], ["527", "532", 0.0], ["534", "542", 0.0], ["547", "551", 0.0], ["581", "595", 1.0], ["616", "620", 0.0], ["624", "629", 0.0], ["630", "653", 0.0], ["700", "707", 0.0], ["733", "739", 0.0], ["743", "749", 0.0], ["760", "779", 0.0], ["806", "840", 0.0], ["877", "928", 0.0], ["951", "980", 0.0], ["1047", "1052", 0.0], ["1089", "1103", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.paypal.android.p2pmobile", "usage_freq": "daily", "text": "This is the part of the PayPal app that allows me to see what I have been spending my money on.  I use it to help me not spend so much money, it helps me know/remember where and what my money is being used for much easier than simply thinking about it alone, this allows my mind to have a better mental picture of my spending.  It also informs me about all types of payments I may have either from another paypal account or even direct deposits because PayPal now gives you the option to receive direct deposits just like a \"normal\" bank using an account and routing number, but its through paypal!  It's a good part of the part to always know where the money is coming from and where the money is going to.  There are also menus that allows you to put money into your account using cash you can deposit at a variety of stores such as gas stations, walmart, gamestop, etc.", "part2_false_pos15": "1", "scenario_id": "MAS-R-167", "risks": [["57", "94", 5.0], ["135", "140", 5.0], ["178", "209", 5.0], ["317", "325", 5.0], ["366", "374", 5.0], ["413", "420", 5.0], ["436", "444", 5.0], ["496", "511", 5.0], ["533", "537", 5.0], ["559", "573", 5.0], ["644", "674", 5.0], ["679", "706", 5.0], ["783", "787", 5.0], ["820", "826", 5.0], ["839", "847", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.google.android.apps.fitness", "usage_freq": "weekly", "text": "This journal allows me to do a variety of things related to the fitness tracker capabilities. Whether my fitness gadgets are connected or not, my phone will be able to access this app and both automatically create entries on events that have occurred as well as allow me to enter manual entries. What this screen allows me to do is know whether I am on track towards my weekly goals and have the statistics to improve on my next task. I can go through the history of the journal, enter the specific entries to extract data, or add manual entries of events or information. The application uses my account information for profile information such as height, weight, and generic location. Furthermore it will utilize my phones hardware sensor information for the movements, but the rest of the profiles statistics were manually entered. It will run in the background, send crash statistics, as well as use my hardware sensors to continue tracking movements, and this journal will capture the majority of events.", "part2_false_pos1": "1", "scenario_id": "MAS-R-168", "risks": [["64", "92", 1.0], ["105", "120", "N"], ["214", "221", 1.0], ["232", "250", "N"], ["345", "382", "N"], ["396", "406", 0.0], ["456", "463", 1.0], ["549", "555", 2.0], ["596", "615", 1.0], ["620", "639", 1.0], ["648", "654", 0.0], ["656", "662", 0.0], ["668", "675", "N"], ["676", "684", 0.0], ["724", "751", 0.0], ["760", "769", 0.0], ["791", "810", 1.0], ["870", "886", 1.0], ["915", "922", 0.0], ["964", "971", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.ubercab", "usage_freq": "yearly", "text": "Uber is a ride share service app. On this screen I can control the way I use the Uber App and the way it uses my info. If I want to add a permanent address that is my home, or work I can click on those options listed. If I have any other address I want to save that I go to often I can click on the Shortcuts option. Those are great for time saving so I don't have to type in or re-type in addresses that I use often. I can also control what kind of data I want to share with Uber by clicking on the Privacy option and control the log in process for my security by clicking on the Security option. This keeps anyone else from accessing my account that isn't me. I can also come here if I want to change how many notifications I'm getting or how I'm alerted for things like arrivals of cars to pick me up or messages from my driver. I would come here to set things up when I'm starting out on the app or to adjust things as my wants and needs change.", "scenario_id": "MAS-R-169", "risks": [["167", "171", 4.0], ["238", "245", 4.0], ["390", "399", 4.0], ["450", "454", 2.0], ["553", "561", 5.0], ["639", "646", 4.0], ["703", "737", 3.0], ["741", "767", "N"], ["773", "803", 5.0], ["807", "815", 5.0], ["821", "830", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/bank-of-america-mobile-banking/id284847138", "usage_freq": "weekly", "text": "I use this account view screen when I need to know what my bank account number and routing number are in order to make wire transfers directly or for sending and receiving money. I also use this screen to check my current account balance before making purchases as well as after making purchases. I routinely view this screen to check my recent transaction history to ensure that it lines up with what I expect it to look like. I check this page for recent transactions against my manual bookkeeping to make sure they match up. I also use this screen to confirm that purchases have been successfully completed. I use this page to make sure that there has not been any recent suspicious activity in the recent transaction history. This page serves as an overview of this particular account and allows me to see where the account stands at a quick glance.", "scenario_id": "MAS-R-170", "risks": [["11", "23", "N"], ["59", "78", 5.0], ["83", "97", 5.0], ["119", "133", "N"], ["172", "177", "N"], ["214", "237", 5.0], ["457", "469", 5.0], ["488", "499", "N"], ["567", "576", 5.0], ["686", "694", 5.0], ["709", "728", 5.0], ["781", "788", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.mcdonalds.app", "usage_freq": "weekly", "text": "My guilty pleasure is using the McDonalds app. I use it about once a week. I get points every time I do use it and they add up for free food. Also using the app you get special discounts every time you order from McDonalds. Its fun and a nice way to break my 6 days a week Keto Diet. I usually select this on Friday because french fries are free. I will then add one of their burgers and a drink and I enjoy myself. About one every four trips I have enough points so at least one item I am ordering is free. Which is nice. I always tell people who go to McDonald's to get the app because they will save money. I check it daily sometimes they have a really good promotion for that day and I will change up which day is my McDonalds Day. I am getting hungry now!", "scenario_id": "MAS-R-171", "risks": [["136", "140", 2.0], ["177", "186", 3.0], ["213", "222", 2.0], ["273", "282", 2.0], ["331", "336", 2.0], ["376", "383", 1.0], ["390", "395", 1.0], ["457", "463", 1.0], ["480", "484", "N"], ["603", "608", 5.0], ["661", "670", 1.0], ["721", "734", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/backbone-next-level-play/id1449660663", "usage_freq": "weekly", "text": "As you can see in the backbone app you have the ability to search for games. The backbone app searches on various appstores and found one game relevant to my search named Contra Returns. My backbone controller is compatible with it there fore I can download it. The app uses my search and usage data to better sell me games in the dashboard in the future. For example I once purchased Castlevania and received ads for retro games the next week on my dashboard. So they really pay attention to what you are purchasing or just downloading and playing for free and basing their recommendations based off your usage data. I imagine if I searched for soccer games I would end up getting recommended many soccer games the next week. I'm more of a retro gamer and don't really like modern games so I am likely to be recommended old school games based off the usage data they receive from me.", "scenario_id": "MAS-R-172", "risks": [["114", "123", "N"], ["138", "142", 1.0], ["278", "284", 1.0], ["318", "323", 1.0], ["385", "396", "N"], ["410", "413", "N"], ["418", "429", 1.0], ["575", "590", 0.0], ["606", "616", 0.0], ["699", "711", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.planetfitness", "usage_freq": "daily", "text": "To utilize this feature on the app that I chose I navigate to the app and click the My Perks button the main page once opening the app. From here I am given the ability to choose from a list of benefits that come from having membership at this gym. It’s an added incentive to being a member and helps motivate me to continue to be one and stay healthy. The goal is to be rewarded for being a member. It is my understanding that the app will sometimes tailor the benefits to my personal account, in which some benefits are more likely to be useful to me dependent on the information I provide to the account. It’s very nice to have these perks sometimes as I am a big shopper and like discounts. The app also tracks how much usage I have with certain activities that I log and tailors the perks based on these actions. ", "scenario_id": "MAS-R-173", "risks": [["87", "92", 0.0], ["186", "224", 0.0], ["225", "235", 1.0], ["284", "290", 1.0], ["477", "493", 2.0], ["599", "606", 2.0], ["684", "693", 1.0], ["715", "736", 2.0], ["742", "760", 2.0], ["788", "793", 1.0], ["809", "816", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.whatsapp", "usage_freq": "daily", "text": "The WhatsApp contact screen page allows me to keep in touch with my contacts. The goal of this page is to easily add and manage my contacts. To achieve this goal, I can search for contacts and add them to my contact list. I can also delete contacts, block contacts, or mute conversations. The app uses my contacts' names, phone numbers, and profile pictures to support this screen. This information is used to identify and display my contacts on the page and to make it easier for me to communicate with them.", "scenario_id": "MAS-R-174", "risks": [["13", "20", 5.0], ["180", "188", 5.0], ["208", "220", 4.0], ["274", "287", 5.0], ["305", "314", 4.0], ["315", "320", 5.0], ["322", "335", 0.0], ["341", "357", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.apalon.to.do.list", "usage_freq": "daily", "text": "It is a habit tracker with quite good tracking habits and monitoring my fitness activities regularly. This app manages and have streaks for variable habits which are very good for us to maintaining regular activities as well they discipline us in order to the data we have provided to them in the app. They have mentioned and promised that, they will keep my data and information which I have provided will be safe and secure. Also they mentioned that they will monitor my account on behalf of my wellness and discipline with consistency. First, I achieved the goal named \"Regular exercise\" which suggests me to do a 10 minute workout. After I followed the app's recommendation, I have uploaded my data and the tracker app immediately appreciated me and given a reward which made me happy and felt accomplished more! I've decided to do many activities which are suggested by this wonderful tracking app.", "scenario_id": "MAS-R-175", "risks": [["38", "53", 1.0], ["72", "90", 1.0], ["149", "155", 1.0], ["260", "264", 1.0], ["368", "379", 1.0], ["473", "480", 1.0], ["627", "634", 1.0], ["663", "677", 0.0], ["841", "851", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instagram.android", "usage_freq": "daily", "text": "I wanted to keep in contact with my friends, mostly friends that live farther away from me but also share things with friends like post I find interesting or a new product or place I wanna check out or think they will like. They collect save every message and need to have access to my camera and mic, etc so I can send pictures or call my friends, etc. Probably  alot of other information as well but now as sad as it is I'm so use to giving away my person information and privacy to use apps I don't even really think of it. I like messaging here because I can send a friend a post of a cool burger place thats opening in LA or something cool somewhere we both like, like something cool in Japan, etc.  I think Instagram/Facebook/meta is the worst with collecting all your personal data so I think to use this app, I am pretty much letting them have access to everything on my phone and everything I do online even when I am not on the app", "scenario_id": "MAS-R-176", "risks": [["36", "43", 3.0], ["164", "171", 2.0], ["175", "180", 2.0], ["248", "255", 3.0], ["286", "292", 3.0], ["297", "300", 3.0], ["320", "328", 3.0], ["451", "469", 3.0], ["489", "493", 2.0], ["570", "576", 3.0], ["579", "583", 3.0], ["594", "606", 2.0], ["692", "697", 2.0], ["775", "788", 3.0], ["879", "884", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/myfitnesspal-calorie-counter/id341232718", "usage_freq": "daily", "text": "This screen is a major part of my diet plan seeing as it calculates everything that I eat on a daily basis. It's important to stay consistent with posting my meal plans for each day so that I can track whether or not I am hitting my goals that I set for myself. It's a relatively easy process where all I need to do is manually list what I have eaten during the day and even allows me to scan food product barcodes to see. It's meant to be easy so that people are enticed to come back to the application to use it as it adds up all the nutritional value from foods as well. It is very helpful even without the subscription paid version of the application! All in all it's an easy way to calculate how much I need to eat in order to drop the weight to eventually reach my goal that I have set for myself. ", "part2_false_pos2": "1", "part2_false_pos3": "1", "scenario_id": "MAS-R-177", "risks": [["34", "43", 0.0], ["68", "85", 0.0], ["86", "89", 0.0], ["90", "100", 0.0], ["158", "168", 0.0], ["202", "260", 0.0], ["333", "365", 0.0], ["393", "414", 0.0], ["492", "503", 0.0], ["536", "553", 0.0], ["559", "564", 0.0], ["697", "747", 0.0], ["771", "775", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.theathletic", "usage_freq": "weekly", "text": "This page shows a number of different articles by a journalist for The Athletic. There is also a Q&A section at the top that happened earlier today which lets members ask the journalist questions. You can also comment on the other articles, but the journalist doesn't always respond to those. Members can respond to each other's comments though. You can follow your favorite journalists on there in order to get their articles posted to your personalized feed. In order to access The Athletic articles and comments, you need a paid subscription. The subscription money makes it so that there are no ads on the site or app. The site uses engagement to figure out what sports to invest in. Sports with less engagement are not as covered on the site. There is a lot of fantasy sports content since it is a growing field. The journalists often already had their own fanbase before joining the site.", "scenario_id": "MAS-R-178", "risks": [["231", "239", 0.0], ["249", "259", "N"], ["293", "300", "N"], ["329", "337", 1.0], ["375", "386", 1.0], ["550", "568", 0.0], ["599", "602", 2.0], ["662", "686", 0.0], ["688", "694", "N"], ["705", "715", 0.0], ["774", "788", "N"], ["862", "869", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instagram.android", "usage_freq": "daily", "text": "This screen helps me connect with other people who are my friends or who we have close contacts with each other. The screen helps me largely expand my social network. It helps me grow socially and relate well with my friends outside physical closeness. It helps me know my friends social life and wellness as well as associate with them socially. The screen asks me permission to collect my contacts from my phone storage so as it can show me people I know through my contacts and indicate their social life and how they relate socially. It shows how they perform socially and also enables me to realize where they have come from to reach this far. In a nutshell, it helps me know more about my friends' lives than I know through personal contacts. This hugely helps me to engage with them with prior knowledge of how their life is outside our physical interactions. ", "scenario_id": "MAS-R-179", "risks": [["87", "95", 2.0], ["151", "165", 1.0], ["217", "224", 2.0], ["281", "292", 2.0], ["297", "305", 2.0], ["408", "421", 1.0], ["443", "449", 2.0], ["512", "536", 2.0], ["547", "572", 2.0], ["604", "638", 2.0], ["704", "709", 2.0], ["730", "747", 1.0], ["814", "828", 2.0], ["844", "865", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.paypal.android.p2pmobile", "usage_freq": "weekly", "text": "This is the PayPal Wallet screen. On this screen, I can manage most of my finances through PayPal. I can add bank accounts to my PayPal, I can apply for new cards through PayPal, I can cash checks that I receive from this screen, and I can even manage my payment plans that I've used from PayPal; for example, the Pay in 4 that PayPal offers to many retailers, I can manage from this screen. I can setup other payments such as Google Pay and Samsung pay from this screen. I can manage my automatic payments I have setup for things like subscriptions, and I can apply for credit through PayPal with one of their options that are available to me. I can also create a debit card from PayPal through this screen, which will allow me to use money on my account rather than my bank card to make purchases. Finally, I can add cash for specific stores that I frequent.", "scenario_id": "MAS-R-180", "risks": [["74", "82", 2.0], ["109", "122", 2.0], ["157", "162", 2.0], ["190", "196", 2.0], ["255", "268", 1.0], ["314", "322", 1.0], ["350", "359", 0.0], ["498", "506", 1.0], ["536", "549", 0.0], ["571", "577", 2.0], ["665", "675", 2.0], ["736", "741", 2.0], ["748", "755", 2.0], ["771", "780", 2.0], ["789", "798", 1.0], ["819", "823", 2.0], ["837", "843", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.healthifyme.basic", "usage_freq": "daily", "text": "In this page I can monitor my weight goals periodically. I can check my current weight with my goal weight daily. I can able to update my weight daily and also I can set how much weight I need to gain weekly and the app provide exercise and diet according to it. Also I can set the activity level of myself so that app can arrange workouts accordingly which is very helpful. By the all above information above app will set me a daily calorie budget automatically and also It will set me a nutrients budget too which is very helpful for my health. This app used my weight, daily work routine and also my water intake to set my food and workouts for next day. Which is very helpful for not getting exhaust. Also It can monitor my walking steps and also remind me to drink water each 1 hour and also remind me to walk if I am Idle for more than a hour.", "scenario_id": "MAS-R-181", "risks": [["30", "42", 0.0], ["80", "86", 3.0], ["170", "207", 0.0], ["228", "236", 0.0], ["241", "245", 0.0], ["282", "296", 2.0], ["434", "448", 2.0], ["489", "505", 1.0], ["578", "590", "N"], ["603", "615", 2.0], ["626", "630", 1.0], ["635", "643", 0.0], ["728", "741", 0.0], ["770", "775", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instagram.android", "usage_freq": "daily", "text": "I use this screen to take photos that I can upload directly to Instagram. There are many different features that I can use with this page. I can either post a picture to my feed, story, or my reels. If I post a pic to my reels, it will disappear after one day. I can also use different filters on whatever picture I want to take. Instagram takes data from both my face, my location, and the photo itself. Most of the data comes from after the photo is taken. They get more data the more interactions you get with your post. You can either take a picture or a video. You can tag people who are in the post afterwards. I guess the app uses your face to collect data for their facial recognition. I assume that they sell this data to others to support companies that are trying to improve their facial recognition software.", "scenario_id": "MAS-R-182", "risks": [["26", "32", 3.0], ["99", "107", "N"], ["159", "166", 3.0], ["173", "177", 4.0], ["179", "184", 4.0], ["192", "197", 3.0], ["211", "214", 3.0], ["364", "368", 5.0], ["373", "381", 5.0], ["391", "396", 3.0], ["487", "499", 5.0], ["518", "522", 3.0], ["559", "564", 3.0], ["578", "584", 4.0], ["659", "663", 4.0], ["792", "810", 5.0]]}, {"app_url": "https://apps.apple.com/us/app/strava-run-ride-hike/id426826309", "usage_freq": "daily", "text": "These recap screens are important for me to assess how my run went and to compare them to other similar efforts. With this run I can see that I performed worse than I usually do - and as you'll note from the silly commentary, I know that's because I was sick recently and still feel the effects. \r\n\r\nThis page is the most important page for me as a strava user. As soon as I get home from a run, I upload my data and look at the info on this page to assess my effort and see how it compares to other runs I have gone on. This lets me improve my training and also is just kind of fun.\r\n\r\nThis screen is supported by the collection of GPS data, the collection of heart-rate data and estimations of calories burned by use of my height/weight info I have provided to the app. ", "scenario_id": "MAS-R-183", "risks": [["6", "11", 4.0], ["51", "66", 2.0], ["408", "412", 3.0], ["460", "466", 1.0], ["500", "504", 0.0], ["545", "553", 0.0], ["633", "641", 2.0], ["661", "676", 1.0], ["681", "692", "N"], ["725", "731", 0.0], ["732", "743", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.reddit.frontpage", "usage_freq": "daily", "text": "I use this screen to read on different stories on reddit and catch up on the updates because a lot of stories posted usually need updates. This specific subreddit collects and store these stories and their updates for me to read all at once without being bothered to be moved to different pages to just read if there's any updates. It's been a constant use for me and I feel less guilty not reading books, but this is the closest thing I can do to get less cravings for a book that I just can't sit through and end up not finishing. The info of the app that was needed for me in here is basic, I just told the app that I am interested on this subject or topic and I subscribed to the subreddit so that it would recommend if there's any new interesting stories that I have missed or not.", "part2_false_pos1": "1", "part2_false_pos2": "1", "part2_false_pos7": "1", "scenario_id": "MAS-R-184", "risks": [["39", "46", 1.0], ["130", "137", 1.0], ["399", "404", 2.0], ["472", "476", 2.0], ["643", "650", 1.0], ["654", "659", 1.0], ["684", "693", 1.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.draftkings.dknativermgGP", "usage_freq": "daily", "text": "The bets I make on DraftKings is used by them to collect data. The data they collect can be used to set odds or to set player prices in their daily fantasy contests. In order to gamble and play daily fantasy, your location services need to be on in order for DraftKings to know whether gambling is legal in your state. They also use the location services to know if you're accessing the site through a VPN. Some of the daily fantasy contests were sponsored by a corporation. These contests are often offered for free since the money for the contest comes from the company. Profile data can be shared with these third parties in exchange for money. DraftKings uses the betting data to offer promotions that could be relevant to you. They offer promotions such as risk free bets and odds boosts. They can also offer promotions from a specific sport. ", "part2_false_pos16": "1", "scenario_id": "MAS-R-185", "risks": [["4", "8", 1.0], ["19", "29", "N"], ["67", "71", 2.0], ["104", "108", "N"], ["119", "132", 0.0], ["200", "207", 0.0], ["278", "303", "N"], ["307", "317", 0.0], ["337", "354", 1.0], ["370", "399", "N"], ["402", "405", 0.0], ["425", "441", 0.0], ["481", "489", 0.0], ["541", "548", 0.0], ["573", "585", 1.0], ["641", "646", 2.0], ["668", "680", 2.0], ["743", "753", 0.0], ["762", "776", "N"], ["781", "792", "N"], ["841", "846", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=come.playrix.homescapes", "usage_freq": "daily", "text": "Homescapes is a match three game that allows you to track your progress through the game. If you want to be able to import your progress onto a new device, you would have needed to accept their agreement and connected an account to it, so it has a place to back up. The game gives you the option of using your Google Account or your Facebook, or both (I am not sure). In the upper right hand corner, I would select the Cog Wheel settings, then click the Save Progress Button. This screen pops up and allows me to connect or disconnect either my Google Account or my Facebook Account. You have the ability to swap back and forth between the two. Once that is done, you can then changes your user pic by clicking the Edit Profile button. You are able to select one of the supplied images or select the one from your Facebook Account, after logging in.", "scenario_id": "MAS-R-186", "risks": [["63", "71", 0.0], ["148", "154", 0.0], ["194", "203", 0.0], ["221", "228", 0.0], ["270", "274", 0.0], ["333", "341", 2.0], ["419", "437", "N"], ["468", "474", "N"], ["545", "559", 2.0], ["566", "582", 2.0], ["690", "698", 2.0], ["779", "785", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.ubercab.eats", "usage_freq": "weekly", "text": "I use this screen to quickly find restaurants that I have ordered from before and that I like. I can easily scroll thru the list to see the name of the restaurant, the time it would take to get delivered to me, the ratings it has on the app from other users, whether it participates in uber one which would mean no delivery fees, and the address of the restaurant. I can achieve finding a place that I want to eat at quickly, and that I have previous experience with. I can see any of the ratings I have personally given the restaurant. I can click on the individual listing to see more information about the restaurant and to go to the restaurants order page in order to place a new order. I can also use the listing to find previous orders I have made and to find favorite meals I have ordered.", "scenario_id": "MAS-R-187", "risks": [["34", "45", 2.0], ["46", "70", 2.0], ["140", "144", 2.0], ["215", "222", 2.0], ["252", "257", 2.0], ["315", "328", 2.0], ["338", "345", 2.0], ["389", "394", 2.0], ["525", "535", 1.0], ["567", "574", 1.0], ["637", "654", 2.0], ["684", "689", 2.0], ["735", "741", 2.0], ["766", "795", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.nextdoor", "usage_freq": "weekly", "text": "To get to this screen, I first have to login to the app. Then I click on the discover button on the bottom navigation bar. I use this screen to see what is happening near me. The types of things that appear on this map is local events, people asking for help, local news, and people putting things on sale. When I click on one of the icons on the map, it gives me a small preview of the person's post. Depending on the type of the post, I can click a button to interact with it or I can click on read more to go to the full post. If it is an event, I can click on the Interested button to add the event to my calendar. If someone is selling something, I can click on the Message button to start a chat with them. The app uses my current location to populate the map with local icons.", "scenario_id": "MAS-R-188", "risks": [["228", "234", 2.0], ["236", "242", 2.0], ["254", "258", "N"], ["266", "270", 2.0], ["291", "297", 2.0], ["301", "305", "N"], ["387", "395", "N"], ["396", "400", 2.0], ["597", "602", 2.0], ["609", "617", 4.0], ["737", "745", 4.0], ["762", "765", 4.0]]}, {"app_url": "https://apps.apple.com/us/app/spending-tracker/id548615579", "usage_freq": "daily", "text": "I use this screen several times a day to keep track of my spending and income. This is a manual app and not tied to my bank account, credit cards, phone number or email address. Every time I spend money, I open the app and then enter how much I spent and categorizes the expense. Conversely I do the same when I receive an income credit. I use this screen to keep a running tab on how much I am spending daily in order to keep me on track for my weekly and monthly savings goal. I can view my daily, weekly, monthly and yearly data at anytime to see my spending history to review. It is from those screen I analysis what spending categories, if any, I need to make adjustments on throughout the week and month in order to meet my savings goals.  Also based on my patterns of spending. I can also predict my spending and savings  better for the future weeks and months. ", "scenario_id": "MAS-R-189", "risks": [["58", "66", 2.0], ["71", "77", 2.0], ["119", "131", 5.0], ["133", "145", 5.0], ["147", "159", 5.0], ["163", "176", 2.0], ["197", "202", 2.0], ["234", "278", 2.0], ["323", "336", 2.0], ["381", "409", 2.0], ["465", "477", 1.0], ["527", "531", 2.0], ["553", "569", 2.0], ["630", "640", 2.0], ["730", "743", 2.0], ["763", "771", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.squareup.cash", "usage_freq": "yearly", "text": "This screen is where you track the transactions you have made on Cashapp, the whole history. This screen also includes notifications and other such things, but it's the one I use to check my transaction history. It allows you to ensure a transaction has been completed. You can also access receipts for them. Each one contains the information of the person you transacted with if you tap on an individual entry, including their cashapp profile, cashtag, and other such personal info. You can check the source of the payment as well, like the bank. If the money is sitting in cashapp, you can also make it deposit it to your bank from here. It also tracks people you have transacted with in a side scrolling list up top, and has a button for recruiting people. Finally, it contains customer support options. If you want to contest a transaction, you open it up, hit the three buttons up top, and you can hit cash app support from there. Same thing if there was a problem with a transaction or it did not go through.", "part2_false_pos3": "1", "scenario_id": "MAS-R-190", "risks": [["35", "47", 4.0], ["84", "91", 2.0], ["119", "132", 2.0], ["191", "210", 2.0], ["290", "298", 2.0], ["331", "342", "N"], ["428", "443", 2.0], ["445", "452", 1.0], ["469", "482", "N"], ["502", "508", 4.0], ["516", "523", 2.0], ["542", "546", 4.0], ["555", "560", 4.0], ["662", "686", 3.0], ["752", "758", "N"], ["781", "805", "N"], ["832", "843", 2.0], ["907", "923", "N"]]}, {"app_url": "https://apps.apple.com/us/app/pregnancy-tracker-babycenter/id386022579", "usage_freq": "weekly", "text": "This feature is designed to show the progression of my children's stats - height, weight, and head size. There is an average stat for boys and girls, and this feature lets you compare your child to others of the same age. I input their starting stats, which is measured at each doctor checkup. In the background, the app shows the typical growth line so you can see where your child lines up. I can select to view all stats in one chart or weight, height, or head individually to see where my child is on the scale. Each tab at the top can be selected to view that particular stat. The app calculates the exact percentile each child falls in. Each time I go to checkups with my child, I input the new stats, and see if any of the percentile has changed. As I keep inputting numbers, the progression line begins to form and I can tell if my child is falling behind, is consistent, or irregular in their stats.", "scenario_id": "MAS-R-191", "risks": [["33", "51", 0.0], ["82", "88", 0.0], ["94", "103", 0.0], ["217", "220", 1.0], ["245", "250", 0.0], ["278", "284", 4.0], ["339", "350", 0.0], ["448", "454", 0.0], ["493", "498", 4.0], ["576", "580", 0.0], ["601", "638", 0.0], ["787", "803", 0.0], ["834", "856", "N"]]}, {"app_url": "https://apps.apple.com/us/app/one-sec-delay-distracting-apps/id1532875441", "usage_freq": "daily", "text": "This screen is provided for any app I have chosen to limit access to on my devices. I have several different apps I am trying to use less (distractions, social media detox, etc) - and onesec collects information about how often I try to open these apps and compares it to past history. This requires deep access to my web browsing as well as Apple Shortcut access to app launching to prevent apps from opening to 'add friction' to the process (adding a waiting page before apps launch to make you reconsider) - it's been effective in cutting down my use of apps - as you can see from the redacted named app in question here. That being said, I would not want a third parties to have such deep access into my web browsing history. \r\n\r\nSo far as goals go, obviously my goals here are just to reduce app usage and this screen helps me do that by giving me longitudinal data on if I am being successful in doing so.", "scenario_id": "MAS-R-192", "risks": [["160", "165", 3.0], ["218", "252", 5.0], ["272", "284", 5.0], ["318", "330", 5.0], ["367", "380", 5.0], ["392", "396", 5.0], ["708", "728", 5.0], ["797", "806", 5.0], ["874", "910", "N"]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.dd.doordash", "usage_freq": "weekly", "text": "I use this screen to see what food I have ordered recently and from where. I want to see how much I am spending and where I am spending it at. I also like to use the list to give me ideas of what to order for lunch. I can hit the reorder button and order the exact same item without wasting time customizing my order. I can also view the receipt to see what custom options I made for the order. This screen reflects my orders from restaurants. The app has my credit card saved to make the orders. The app also has access to my location. It knows when I placed the order and when I picked up the order. The app will also occasionally prompt me on this screen and others asking me do I want to go and leave a review about my experience at the restaurant.", "scenario_id": "MAS-R-193", "risks": [["25", "58", 0.0], ["89", "111", 0.0], ["116", "141", 0.0], ["191", "214", 0.0], ["270", "274", 0.0], ["311", "316", 0.0], ["338", "345", 0.0], ["353", "372", 0.0], ["419", "425", 0.0], ["431", "442", 0.0], ["459", "470", 5.0], ["527", "535", 0.0], ["546", "569", 0.0], ["574", "600", 0.0], ["720", "733", 0.0], ["741", "751", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.duolingo", "usage_freq": "daily", "text": "Duolingo is a language learning app, so all of the goals I want to achieve both through this screen and Duolingo in general are related to language learning. This screen includes a list of each language that I have studied on Duolingo and provides \"XP\" or experience in each of these languages. The primary way I use this screen is as a progress indicator, as it allows me to see how much \"XP\" I have accumulated in each language that I am studying. Right now, I am mainly studying Spanish and Latin, so those two courses, both of which are listed here, are my primary focus. I have been learning Spanish on Duolingo for quite a while longer than I have been learning Latin, and my current goal is to reach 15,000 XP in it (Spanish). I started learning Latin on Duolingo at the beginning of this year, and I have two goals for it: my first is to complete the course, and my second is for it to surpass French as the course with the second most XP in it. As I do courses on Duolingo, Duolingo saves progress that I have completed, and I accumulate more XP. These courses that I have worked on, alongside the XP that I have gained, are put onto this screen. From this screen, I am able to see a good overview of my general progress with all languages on the app, but I am mostly only concerned with Spanish and Latin as of right now.", "scenario_id": "MAS-R-194", "risks": [["380", "392", 1.0], ["421", "429", 1.0], ["440", "448", 0.0], ["494", "499", 1.0], ["859", "865", 1.0], ["998", "1006", 1.0], ["1062", "1069", 1.0], ["1107", "1109", 1.0], ["1239", "1248", 1.0]]}, {"app_url": "https://apps.apple.com/us/app/lichess-online-chess/id968371784", "usage_freq": "daily", "text": "I like to use this page of the app, Lichess, because it is very informative and it can teach you great openings and tactics for the beginning game of Chess. I want to be able to achieve greatness by learning all the ins and outs of the tactical openings and how to predict them accordingly. You can view different types of guides from different people and/or from certified OGs who are grandmasters at this very complex game. You can even create your guides to help the community grow and to teach them your unique ways! The information used on these screens are based on a review guide and how the community reviews them. It is a good idea to read up a coupled guides before typing your own so you understand what the community wants and how it impacts your chess playing in the field of unforgiving moves where it can punish you.", "scenario_id": "MAS-R-195", "risks": [["103", "111", 3.0], ["116", "123", 3.0], ["150", "155", 3.0], ["216", "219", 3.0], ["236", "253", 3.0], ["323", "329", 3.0], ["345", "351", 3.0], ["420", "424", 3.0], ["574", "586", 3.0], ["591", "616", 3.0], ["719", "728", 3.0], ["739", "753", 3.0], ["759", "764", 3.0]]}, {"app_url": "https://apps.apple.com/us/app/mlb-the-show-companion-app/id1537657167", "usage_freq": "weekly", "text": "So when I go on the community market I'm usually searching for players. In this case I am searching for a \"99\" rated Julio Rodriguez. I type his name in the search bar and see that I have enough coins to purchase him, so I do so. The information the app uses from me in this screen is, they notice the player I looked for, and realize then he may be a popular player. Players that are searched for more end up more likely to be in promos, or have more cards released throughout the year. This way they find out who the popular players being searched for are, and cater to that crowd by releasing new cards, with better stats than before, to be available in packs available for purchase or simply by unlocking the player doing missions. So if a player is popular, they use that usage data to keep the players happy.", "scenario_id": "MAS-R-196", "risks": [["20", "29", "N"], ["63", "70", 0.0], ["117", "132", "N"], ["145", "149", 0.0], ["157", "167", "N"], ["195", "200", 0.0], ["298", "310", "N"], ["360", "366", 0.0], ["368", "375", 0.0], ["431", "437", "N"], ["511", "534", "N"], ["600", "605", "N"], ["619", "624", 0.0], ["726", "734", "N"], ["777", "787", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.konylabs.capitalone", "usage_freq": "weekly", "text": "I have several goals in using the screen. First, I cross-reference the app to an Excel spreadsheet where I track my finances. This includes my short and long-term debt, utilities, rent, upcoming expenses, vacation, etc. Due to my past history, I track this information very closely to determine when it hits my app/bank account and when it clears. Second, I am closely tracking another figure on the app which is my overall bank account balance. It is imperative that I keep this above zero or that I know when I will deposit more money. Third, outside of my payroll, I work on Amazon MTurk and a couple of other platforms, so I use the app to confirm deposits from these outside sources which I then also cross-reference to my Excel spreadsheet. This help me know on a day to day basis how much work I need to complete on MTurk, for instance, to keep my account in the black. Personal circumstances are very tight for me right now with a divorce being finalized, unexpected medical expenses, etc. My salary, while good, does not currently cover my monthly expenses. It will improve and part of that comes with the daily monitoring I can do through this app.", "scenario_id": "MAS-R-197", "risks": [["116", "124", 4.0], ["158", "162", "N"], ["163", "167", 3.0], ["169", "178", 1.0], ["180", "184", 2.0], ["186", "194", "N"], ["205", "213", "N"], ["308", "315", 2.0], ["315", "327", 2.0], ["332", "346", "N"], ["424", "444", 4.0], ["531", "536", 3.0], ["559", "566", 4.0], ["652", "660", 3.0], ["680", "687", "N"], ["791", "828", "N"], ["855", "862", 3.0], ["877", "899", "N"], ["975", "991", 1.0], ["1001", "1007", 4.0], ["1057", "1065", 3.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.bestbuy.android", "usage_freq": "monthly", "text": "This is the product screen on Best Buy's app. From here, I can examine the product that I am interested in. I can pick what particular attributes I want from a product if there are multiple to choose from; screen size, resolution, storage space, etc. I can browse reviews from people who have purchased this particular product, and I can browse through photos that people have taken of their product. I can browse specific features from the product, as there is a convenient list that I can expand, and I can browse the specific specs for the model that I am looking at. I can watch official videos from the product so I can learn more about it, and obviously, I can add the product to my cart so I can purchase it; I can also select shipping or pickup from this screen. Finally, I can purchase a store warranty from this screen, if I choose to do so.", "scenario_id": "MAS-R-198", "risks": [["75", "82", 0.0], ["119", "167", 0.0], ["206", "217", 0.0], ["219", "229", 0.0], ["231", "244", 0.0], ["264", "271", 0.0], ["277", "283", "N"], ["353", "359", 1.0], ["423", "431", 0.0], ["475", "479", 0.0], ["529", "534", 0.0], ["543", "548", 0.0], ["592", "598", 0.0], ["689", "693", 0.0], ["797", "811", 0.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.ubercab", "usage_freq": "weekly", "text": "The Uber Services screen includes all of the services that goes beyond the basic uber app functionality. It allows you to see the other kinds of services that are available and offered by the uber app. For example, if you want to create a charter trip with multiple people or have someone pick up a package, there is an option for that. Let's say you choose the charter icon- it goes to a scheduling window similar to the main uber screen. You have to pick a date, time, location and stops. Once you have entered those values, it gives you a price. Charter services can get expensive so you must be aware. The information that is used by this service is your location, name and address, just like the main uber app.", "part2_false_pos1": "1", "part2_false_pos2": "1", "scenario_id": "MAS-R-199", "risks": [["9", "17", 5.0], ["45", "53", 5.0], ["86", "89", "N"], ["239", "251", 5.0], ["266", "272", 5.0], ["299", "306", "N"], ["362", "369", 5.0], ["389", "399", 5.0], ["459", "463", 5.0], ["465", "469", 5.0], ["484", "489", 5.0], ["519", "525", 5.0], ["542", "547", 5.0], ["549", "565", 5.0], ["643", "650", "N"], ["659", "667", 5.0], ["669", "673", 5.0], ["678", "685", 5.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.discoverfinancial.mobile", "usage_freq": "monthly", "text": "This is one of my credit cards, mostly inactive now as the current balance suggests. I briefly funded an online savings account in order to take advantage of a promotion from Discover. Once the promotional period was over, I withdrew the money, leaving only a penny behind, I think by accident. When I have used this account more frequently, I would visit the app in order to accomplish several goals. First, I would visit this screen to confirm how much I had charged to the card in a payment cycle. Occasionally I would process a credit card payment from the app, but more often I would pay the balance using my laptop. While my savings account was active I visited the app maybe once monthly to check on the earned interest. I also use this screen periodically, also perhaps once monthly, to check my FICO credit score. I don't even remember putting my home details into the app, and don't think that the estimated home value is very accurate. ", "scenario_id": "MAS-R-200", "risks": [["18", "30", 4.0], ["160", "169", 3.0], ["238", "243", 4.0], ["317", "324", 5.0], ["446", "499", 4.0], ["532", "551", 3.0], ["597", "604", 4.0], ["631", "646", 4.0], ["718", "726", 3.0], ["804", "808", 4.0], ["809", "821", 4.0], ["856", "868", 4.0], ["918", "928", 4.0]]}, {"app_url": "https://apps.apple.com/us/app/fitness/id1208224953", "usage_freq": "daily", "text": "I use this screen to help motivate myself and keep track of my progress.  I look at my trends at the end of each week to see where I am in terms of daily movement, and how far I need to go in order to actually meet my goals.  The goals portrayed on this screen are my movement and activity goals, in other words, how much I want to move each day in order to meet my goals.  I interact with it almost daily, but use it at the end of each week in a meaningful way.  My information such as movement, workouts, activity, and other relevant biometric data such as heart rate is used by the app in order to be able to support the screen that is depicted within the screen shot that I have submitted hwile completing this survey.  I make good use out of this.  ", "scenario_id": "MAS-R-201", "risks": [["63", "71", 2.0], ["87", "93", 2.0], ["125", "162", 2.0], ["168", "200", 2.0], ["210", "223", 2.0], ["281", "295", 2.0], ["313", "371", 2.0], ["487", "495", 2.0], ["497", "505", 2.0], ["507", "515", 2.0], ["536", "550", 2.0], ["559", "569", 2.0]]}, {"app_url": "https://play.google.com/store/apps/details?id=com.instacart.client", "usage_freq": "weekly", "text": "I interact with this screen in order to keep track of my orders in real time. Whenever shopping is in process, I can make real time changes to the order if the shopper has any trouble with a certain item, like picking a replacement for it, refunding the item in full, or simply by asking the shopper some questions. This way, I am able to achieve my goals. My goals are almost always achieved with the help of a shopper through this page, as the likelihood of at least one item being unavailable is extremely high, at least by where I live. Things like my credit card information are used by the app itself in order to make real time charges to my account, and my shopper never has access to that, which keeps me fully safe from any type of fraud. My address, name, and real photo are used to tell the shopper both where to deliver and who to deliver to.", "scenario_id": "MAS-R-202", "risks": [["57", "63", 1.0], ["147", "152", 1.0], ["254", "258", 0.0], ["292", "299", 5.0], ["556", "579", 5.0], ["634", "641", 0.0], ["648", "655", 5.0], ["751", "758", 5.0], ["760", "764", 4.0], ["775", "780", 4.0], ["815", "831", 5.0], ["836", "853", 5.0]]}]